#include <iostream>
#include <fstream>
#include <string>
#include <list>
#include <vector>
#include <algorithm>
#include <numeric>
#include <Windows.h>
#include <iomanip>

using namespace std;

enum _Code
{
	CP866,
	CP1251
};
void Convert(string& s, _Code code)
{
	int i = 0;
	switch (code)
	{
	case _Code::CP1251:
		while (s[i])
		{
			if (s[i] > -129 && s[i] < -80)
			{
				s[i] += 64;
			}
			else
				if (s[i] > -33 && s[i] < -16)
				{
					s[i] += 16;
				}
			i++;
		}
		break;
	case _Code::CP866:
		while (s[i])
		{
			if (s[i] > -65 && s[i] < -16)
			{
				s[i] -= 64;
			}
			else
				if (s[i] > -17 && s[i] < 0)
				{
					s[i] -= 16;
				}
			i++;
		}
		break;
	}
}

//++++++++++++++ МАКЕТЫ ВЫДЕЛА +++++++++++++++++++++++
class RaschPok
{
public:
	int id{};
	int GrupVozrasta{};
	int KlassVozrasta{};
	int ProdolgKlVoz{};
	int VozrastSpelosti{};
	char GruppaBoniteiov{};
};
class Maket_0
{
public:
	int _1_kz{};	int _2_kv{};
	int _3_admR{};	int _4_arend{};
	int _5_relef{};	int _6_rekrZon{};

	bool operator ==(Maket_0 const& other)
	{
		if (this->_1_kz != other._1_kz)				return false;
		if (this->_2_kv != other._2_kv)				return false;
		if (this->_3_admR != other._3_admR)			return false;
		if (this->_4_arend != other._4_arend)		return false;
		if (this->_5_relef != other._5_relef)		return false;
		if (this->_6_rekrZon != other._6_rekrZon)	return false;
		return true;
	}
	bool operator !=(Maket_0 const& other)
	{
		return !(this->operator==(other));
	}
	void Clear()
	{
		this->_1_kz = 0;	this->_2_kv = 0;
		this->_3_admR = 0;	this->_4_arend = 0;
		this->_5_relef = 0;	this->_6_rekrZon = 0;
	}
};
class Maket_1
{
public:
	int _1_vd{};	int _2_S{};			int _3_katZem{};
	int _4_spRub{};	int _5_OZU{};		string _6_sklon{};
	int _7_krut{};	int _8_vidEroz{};	int _9_stepEroz{};
};
class Maket_2
{
public:
	int _1_hoz1{};	int _2_procVib{};	int _3_rtk1{};
	int _4_hoz2{};	int _5_rtk2{};		int _6_hoz3{};
	int _7_rtk3{};	string _8_celPor{};
};
class Maket_3
{
public:
	string _1_glPor{};	string _2_bon{};	string _3_tipL{};
	string _4_tum{};		string _5_godRub{};	int _6_kolPnei{};
	int _7_kolPneiC{};	int _8_dPnei{};		int _9_tipVirub{};
};
class Maket_4
{
public:
	int _1_zahl{};	int _2_zahlLikv{};	int _3_suhost{};
};
class Maket_10
{
public:
	int _1_yarus{};			int _2_kSost{};		string _3_porod{};
	int _4_vozr{};			int _5_visot{};		int _6_diam{};
	int _7_klTov{};			int _8_proish{};	string _9_poln{};
	int _10_sumPlSech{};	int _11_zapas{};
};
class Maket_31
{
public:
	string _1_kol{};	string _2_vis{};	int _3_vozr{};
	int _4_koef1{};		string _5_por1{};	int _6_koef2{};
	string _7_por2{};	int _8_koef3{};		string _9_por3{};
	int _10_ocenka{};
};
class Maket_32
{
public:
	int _1_gust{};	string _2_por1{};	string _3_por2{};	string _4_por3{};
};
class Maket_11
{
public:
	string _1_god{};	int _2_SPP{};	int _3_SSK{};
	string _4_RMR{};	string _5_RVR{}; string _6_kol{};
	int _7_sost{};		int _8_PG{};
};
class Maket_12
{
public:
	int _1_tip{};	string _2_god{};	string _3_por{};
	int _4_vid1{};	int _5_stepen1{};	int _6_vid2{};
	int _7_stepen2{};
};
class Maket_13
{
public:
	string _1_shir{};	string _2_dlin{};	int _3_sost{};
	int _4_nazn{};		int _5_tipPok{};	string _6_shirPrCh{};
	int _7_sezD{};		string _8_dlinHM{};
};
class Maket_14
{
public:
	int _1_katU{};	int _2_vid1{};		int _3_procP1{};
	int _4_vid2{};	int _5_procP2{};	int _6_vid3{};
	int _7_procP3{};
};
class Maket_15
{
public:
	string	_1_mer,
		_2_god,
		_3_por,
		_4_zap,
		_5_analiz,
		_6_ocenka,
		_7_prNeud,
		_8_plosh;
};
class Maket_16
{
public:
	string	_1_kat,
		_2_por,
		_3_vozr,
		_4_vis,
		_5_edIzm,
		_6_urog,
		_7_dostUr;
};
class Maket_17
{
public:
	int _1_polz{};	int _2_kach{};		int _3_tipS{};
	int _4_sost{};	string _5_porZ{};	int _6_procZ{};
	string _7_urogai{};
};
class Maket_18
{
public:
	string _1_godNach{};	string _2_godZP{};		string _3_godZF{};
	int _4_sost{};			int _5_prNeudSost{};	int _6_nomTS{};
	int _7_narTeh{};		int _8_stim{};
};
class Maket_19
{
public:
	int _1_tipB{};		int _2_tipR{};		string _3_moshT{};
	string _4_porZ{};	int _5_porcZ{};
};
class Maket_20
{
public:
	string	_1_katPot,
		_2_mestPot,
		_3_por,
		_4_zapOb,
		_5_zapLikv,
		_6_zapDel,
		_7_kodVed;
};
class Maket_21
{
public:
	string	_1_tipLand,
		_2_estOc,
		_3_sanOc,
		_4_ust,
		_5_prohVid,
		_6_prosmVid,
		_7_stadDigr,
		_8_MAF;
};
class Maket_22
{
public:
	string	_1_kat,
		_2_god,
		_3_por,
		_4_rmr,
		_5_rvr,
		_6_kolDer,
		_7_kolDerPl,
		_8_urog;
};
class Maket_23
{
public:
	int _1_osVd_1{};	int _2_osVd_2{};	int _3_osVd_3{};
	int _4_osVd_4{};	int _5_osVd_5{};	int _6_osVd_6{};
	int _7_osVd_7{};	int _8_osVd_8{};	int _9_osVd_9{};
	int _10_osVd_10{};	int _11_osVd_11{};
};
class Maket_24
{
public:
	string	_1_tipP,
		_2_mehSost,
		_3_stVlag,
		_4_stepZad,
		_5_moshP,
		_6_prVihGP;
};
class Maket_25
{
public:
	string	_1_nazn,
		_2_god,
		_3_rmr,
		_4_rvr,
		_5_kolD;
};
class Maket_26
{
public:
	string _1_kod;
};
class Maket_27
{
public:
	string	_1_nomV,
		_2_s,
		_3_katZem,
		_4_koefSPP,
		_5_prPor,
		_6_glPor,
		_7_poln,
		_8_prMer;
};
class Maket_28
{
public:
	string	_1_prizDost,
		_2_tipTrans,
		_3_rast;
};
class Maket_29
{
public:
	string	_1_tipSet,
		_2_god,
		_3_katZem,
		_4_por,
		_5_rdos,
		_6_rmos,
		_7_bon;
};
class Maket_34
{
public:
	string	_1_tip,
		_2_balUr,
		_3_urOreh,
		_4_rang,
		_5_smol,
		_6_kelLap,
		_7_pihLap;
};

//++++++++++++++ СПРАВОЧНИКИ +++++++++++++++++++++++
class KatZashit
{
public:
	int TXT;
	int SOLI;
	string NAME;
};
class KatZemel
{
public:
	int TXT;
	int SOLI;
	string NAME;
};
class Meropr
{
public:
	int TXT;
	int SOLI;
	string NAME;
};
class Poroda
{
public:
	string NAME;
	int SOLI;
};
class OZU
{
public:
	int TXT;
	string SOLI;
	string NAME;
};
class TipiLesa
{
public:
	string tipLesa;
	int TUM;
	int GTL;
	string NameGTL;
	string PorLK;
};
class RubkiUhoda
{
public:
	int raion{};
	string poroda{};
	char sostav{};
	char bonitet{};
	int shifrUhoda{};
	int polnota{};
	int procentViborki{};
};
class VozrSpel
{
public:
	char grupZashitn{};
	string poroda;
	char grupBonit{};
	int vozrastSpel{};
	int prodKlVozr{};
};
KatZashit Spr_KatZash[34] =
{
	{58, 142700, "Леса, расположенные на особо охраняемых природных территориях"},
	{60, 142800, "Леса, расположенные на особо охраняемых природных территориях"},
	{5, 110300, "Леса, расположенные в водоохранных зонах"},
	{38, 131900, "Леса, расположенные в первом и втором поясах зон санитарной охраны источников питьевого и хозяйственно-бытового водоснабжения"},
	{14, 120700, "Леса, расположенные в защитных полосах лесов"},
	{16, 120800, "Леса, расположенные в защитных полосах лесов"},
	{34, 131801, "Леса, расположенные в лесопарковых зонах"},
	{36, 131802, "Леса, расположенные в зеленых зонах"},
	{54, 132300, "Леса природных парков"},
	{0, 133000, "Городские леса"},
	{44, 132000, "Горно-санитарные леса"},
	{50, 132100, "Горно-санитарные леса"},
	{4, 110100, "Запретные полосы лесов, расположенные вдоль водных объектов"},
	{6, 110200, "Нерестоохранные полосы лесов"},
	{20, 121000, "Государственные защитные лесные полосы"},
	{13, 120602, "Противоэрозионные леса"},
	{28, 121400, "Леса, расположенные в пустынных, полупустынных, лесостепных, лесотундровых зонах, степях, горах"},
	{72, 143400, "Леса, расположенные в пустынных, полупустынных, лесостепных, лесотундровых зонах, степях, горах"},
	{18, 120900, "Леса, имеющие научное или историко-культурное значение"},
	{64, 143000, "Леса, имеющие научное или историко-культурное значение"},
	{62, 142900, "Леса, имеющие научное или историко-культурное значение"},
	{66, 143100, "Леса, имеющие научное или историко-культурное значение"},
	{68, 143200, "Леса, расположенные в орехово-промысловых зонах"},
	{70, 143300, "Лесные плодовые насаждения"},
	{24, 121200, "Ленточные боры"},
	{83, 204101, "Эксплуатационные леса"},
	{84, 204102, "Эксплуатационные леса"},
	{85, 204300, "Эксплуатационные леса"},
	{88, 204200, "Эксплуатационные леса"},
	{92, 304601, "Эксплуатационные леса"},
	{93, 304602, "Эксплуатационные леса"},
	{94, 304603, "Эксплуатационные леса"},
	{96, 304700, "Эксплуатационные леса"},
	{98, 305000, "Резервные леса"}
};
KatZemel Spr_KatZemel[131] =
{
	{3, 1101, "Насаждение естественного происхождения"},
	{4, 1102, "Насаждение из подроста"},
	{5, 1103, "Насаждение, расстроенное условно-сплошными рубками"},
	{7, 1105, "Насаждение в стадии реконструкции"},
	{8, 1106, "Насаждени, имеющее в составе примесь пород искусственного происхождения"},
	{9, 1107, "Насаждение с лесными культурами под пологом"},
	{10, 1108, "Лесные культуры"},
	{11, 1109, "Культуры, созданные путём реконструкции"},
	{12, 1110, "Культуры видовые"},
	{13, 1111, "Культуры декоративные"},
	{14, 1112, "Культуры ландшафтные"},
	{15, 1113, "Культуры - полезащитные лесные полосы"},
	{16, 1114, "Культуры с культурами под пологом"},
	{17, 1115, "Культуры в стадии реконструкции"},
	{31, 1201, "Несомкнувшиеся культуры"},
	{32, 1202, "Несомкнувшиеся культуры, созданные путём реконструкции"},
	{34, 1204, "Несомкнувшиеся культуры видовые"},
	{35, 1205, "Несомкнувшиеся культуры декоративные"},
	{36, 1206, "Несомкнувшиеся культуры ландшафтные"},
	{37, 1207, "Несомкнувшиеся культуры - полезащитные лесные полосы"},
	{40, 1340, "Питомник"},
	{41, 1341, "Плантация"},
	{42, 1342, "Школа древесная"},
	{43, 1343, "Дендросад"},
	{44, 1344, "Теплица"},
	{51, 1400, "Редина естественная"},
	{53, 1503, "Гарь"},
	{54, 1504, "Погибшее насаждение"},
	{55, 1505, "Ветровальник"},
	{57, 1507, "Лесосека года лесоустройства"},
	{58, 1508, "Раскорчёвванная площадь"},
	{59, 1509, "Вырубка"},
	{60, 1510, "Прогалина"},
	{61, 1511, "Пустырь"},
	{62, 1512, "Земли рекультивированные"},
	{82, 2101, "Пашня"},
	{83, 2102, "Сенокос"},
	{84, 2103, "Пастбище, выгон"},
	{85, 2104, "Сырт"},
	{86, 2105, "Луг субальпийский, альпийский"},
	{87, 2106, "Скотопрогон"},
	{90, 2107, "Поле кормовое"},
	{101, 2108, "Озеро"},
	{102, 2109, "Река"},
	{103, 2110, "Ручей"},
	{104, 2111, "Пруд"},
	{105, 2112, "Водохранилище"},
	{106, 2113, "Канал"},
	{107, 2114, "Канава мелиоративная, арык"},
	{108, 2115, "Сеть коллекторная"},
	{109, 2116, "Старица"},
	{110, 2120, "Сад (не дендрологический)"},
	{111, 2121, "Коллективный сад"},
	{112, 2122, "Тутовник"},
	{115, 2123, "Ягодник культурный"},
	{116, 2124, "Хмельник"},
	{121, 2301, "Дорога железная"},
	{122, 2302, "Дорога железная узкой колеи"},
	{123, 2303, "Дорога автомобильная с искусственным покрытием"},
	{125, 2305, "Дорога автомобильная грунтовая"},
	{126, 2306, "Зимник"},
	{127, 2307, "Тропа"},
	{128, 2308, "Дорожка пешеходная"},
	{129, 2310, "Просека квартальная"},
	{130, 2311, "Коридор технологический"},
	{131, 2312, "Визир"},
	{132, 2313, "Граница окружная"},
	{133, 2314, "Канал (не мелиоративный)"},
	{140, 2320, "Разрыв противопожарный"},
	{141, 2330, "Прогон"},
	{162, 2402, "Кордон"},
	{163, 2403, "Усадьба частная"},
	{164, 2404, "Склад лесной"},
	{165, 2405, "Пасека пчелиная"},
	{166, 2406, "Станция метеорологическая"},
	{167, 2407, "Площадка вертолётная"},
	{168, 2408, "Посёлок лесной"},
	{169, 2409, "Зимовье, охотничий домик"},
	{170, 2410, "Кемпинг"},
	{171, 2411, "Дом отдыха"},
	{172, 2412, "Лагерь отдыха (пионерский)"},
	{174, 2414, "Сооружение парковое"},
	{175, 2415, "Площадка детская"},
	{176, 2416, "Стадион"},
	{177, 2417, "Площадка спортивная или игровая"},
	{178, 2418, "Площадка с памятником"},
	{182, 2422, "Пляж"},
	{183, 2423, "Стоянка автотранспорта"},
	{184, 2424, "Санаторий"},
	{185, 2425, "Кладбище"},
	{187, 2427, "Скотомогильник"},
	{188, 2419, "Ремиз"},
	{189, 2420, "Поляна для отдыха"},
	{190, 2421, "Ландшафтная поляна"},
	{211, 2501, "Овраг"},
	{212, 2502, "Балка"},
	{213, 2503, "Склон крутой"},
	{214, 2504, "Обнажение скальное"},
	{215, 2505, "Россыпь каменистая, галечник"},
	{216, 2506, "Пески"},
	{217, 2507, "Болото"},
	{218, 2508, "Марь"},
	{219, 2509, "Плавни (не камышовые)"},
	{220, 2510, "Солодь"},
	{221, 2511, "Солонец"},
	{222, 2512, "Гольцы"},
	{223, 2513, "Тундра (не горная)"},
	{224, 2514, "Горная тундра"},
	{225, 2515, "Снежник"},
	{226, 2516, "Ледник"},
	{227, 2517, "Отвал"},
	{228, 2518, "Нефтекачалка"},
	{229, 2519, "Плавни камышовые"},
	{230, 2520, "Осыпь"},
	{231, 2521, "Оползень"},
	{232, 2522, "Образование карстовое"},
	{233, 2523, "Наледь"},
	{234, 2524, "Спецплощадка"},
	{239, 2539, "Прочие земли"},
	{240, 2540, "Карьер действующий"},
	{241, 2541, "Торфоразработки"},
	{242, 2542, "Отвал пород, золы, шлака"},
	{248, 2548, "Линия (трасса) электропередач"},
	{249, 2549, "Линия связи"},
	{250, 2550, "Газопровод"},
	{251, 2551, "Нефтепровод"},
	{252, 2552, "Водопровод"},
	{253, 2553, "Прочие трассы"},
	{254, 2554, "Мусоропровод"},
	{255, 2555, "Свалка мусора и производственных отходов"},
	{256, 2556, "Трасса мелиоративная"}
};
Meropr Spr_Meropr[113] =
{
	{1, 1211, "Сплошная рубка"},
	{2, 1212, "Сплошная рубка с сохр.подр."},
	{5, 1222, "Постепенная рубка"},
	{20, 1411, "Осветление"},
	{21, 1412, "Осветление"},
	{22, 1413, "Осветление"},
	{25, 1421, "Прочистка"},
	{26, 1422, "Прочистка"},
	{27, 1423, "Прочистка"},
	{30, 1430, "Прореживание"},
	{31, 1431, "Прореживание"},
	{32, 1432, "Прореживание"},
	{33, 1433, "Прореживание"},
	{35, 1441, "Прореживание"},
	{36, 1442, "Прореживание"},
	{37, 1443, "Проходная"},
	{43, 1881, "Расчистка"},
	{50, 3211, "Лесные культуры"},
	{57, 3261, "Агротехнический уход"},
	{64, 3271, "Минерализация"},
	{68, 3270, "Содейств. ест. лесовосст."},
	{3, 1269, "Рубка по сост."},
	{4, 1220, "Пост.рубка"},
	{6, 1223, "Пост.3-пр.руб."},
	{7, 1230, "Гр-выбор.руб."},
	{8, 1260, "Выбороч.рубка"},
	{9, 1216, "Узкосплош.руб."},
	{10, 1311, "Рубка редин"},
	{11, 1301, "Рубка ед.дер."},
	{12, 1701, "Руб.реконс.спл."},
	{13, 1705, "Руб.реконс.част"},
	{14, 1711, "Уб. верх.пол."},
	{15, 1601, "Сплош.санрубка"},
	{16, 1605, "Выбор.санрубка"},
	{17, 1621, "Уборка захламл."},
	{18, 1807, "Рубка подлеска"},
	{19, 0000, "Лесопотологическое обследование"},
	{24, 1415, "Осв.авиахимм."},
	{28, 1424, "Прочист.н/хим"},
	{29, 1425, "Проч.авиахимм."},
	{38, 1551, "Ландш.руб.рек."},
	{39, 1552, "Ландш.руб.дек."},
	{40, 1445, "Руб. переформ."},
	{41, 1446, "Рубка обновл."},
	{42, 1845, "Разрубка"},
	{53, 3212, "Культуры п/пол."},
	{54, 3221, "Рекон.культуры"},
	{55, 3222, "Рекон.сплошная"},
	{56, 3223, "Рекон.частичн."},
	{58, 3262, "Уход химическ."},
	{59, 3281, "дополнение"},
	{60, 3301, "Закладка питомника"},
	{61, 3321, "Закладка плантации"},
	{62, 3329, "Закладка план елок"},
	{63, 3331, "Закладка пост сем уч-ка"},
	{65, 3272, "Огораживание"},
	{66, 3273, "Уход за сохр пдр."},
	{67, 3274, "Химобработка почвы"},
	{69, 3285, "Естеств.заращивание"},
	{70, 3103, "Вспашка сплош."},
	{71, 3112, "Вспашка полос."},
	{72, 3111, "Вспашка борозд"},
	{73, 3152, "Устр.площ.мех."},
	{74, 3154, "Устр.площ.ручн."},
	{75, 3151, "Террас.склонов"},
	{76, 3113, "Без подг.почвы"},
	{80, 4301, "Расч-ка угодий"},
	{81, 4307, "Отвод пов.вод"},
	{82, 4335, "Срезка кустар."},
	{83, 4331, "Срезка кочек"},
	{84, 4321, "Подсев трав"},
	{85, 4211, "Внесен.удобр."},
	{86, 4345, "Кор.улучш.сен."},
	{87, 4351, "Пов.улучш.сен."},
	{90, 5105, "Огораж.мурав."},
	{91, 5125, "Рассел.мурав."},
	{92, 5201, "авиахим.борьба"},
	{93, 5231, "Опрыскивание"},
	{94, 6134, "Уст-ка аншлаг."},
	{95, 6211, "Минер.полос"},
	{96, 6221, "Уход за м/пол."},
	{100, 2340, "Уст-во укрытий"},
	{101, 2342, "Уст-во беседок"},
	{102, 2350, "Устр.дет.площ."},
	{103, 2351, "Устр.площ.спор"},
	{104, 2345, "Уст.лес.мебели"},
	{105, 2355, "Благоуст.пляжа"},
	{106, 2371, "Обор.ст.турист"},
	{107, 2372, "Оборуд.ст.а/тр."},
	{108, 2391, "Устр-во лужаек"},
	{109, 2389, "Расчистка троп"},
	{111, 2412, "Созд.корм.пол."},
	{120, 7101, "Стр-во дорог"},
	{121, 7131, "Ремонт дорог"},
	{122, 7305, "Стр-во мостов"},
	{123, 7308, "Стр-во переезд."},
	{124, 7345, "Ремонт мостов"},
	{129, 2281, "Сбор грибов"},
	{130, 2222, "Заг.лексырья"},
	{131, 2224, "Загот.орехов"},
	{132, 2225, "Заг.плодов дек"},
	{133, 2228, "Загот.трав"},
	{134, 2230, "Загот.ягод"},
	{135, 2231, "Заг.пищ.сырья"},
	{136, 2232, "Заг.корм.сырья"},
	{137, 2233, "Загот.техсырья"},
	{138, 2102, "Подсочка леса"},
	{140, 2259, "Запр.паст.скот"},
	{141, 2260, "Запр.сенокошен"},
	{142, 2104, "Запр.подсочку"},
	{143, 2261, "Пастьба скота"},
	{144, 4101, "Мелиор.лесхоз."},
	{145, 4102, "Мелиор.подряд."}
};
Poroda Spr_Poroda[91] =
{
	{"С", 100100},
	{"Е", 100200},
	{"П", 100300},
	{"К", 100500},
	{"Л", 100400},
	{"Б", 302600},
	{"ОС", 304000},
	{"ЛП", 304200},
	{"ОЛС", 304106},
	{"ОЛЧ", 304110},
	{"АБ", 202806},
	{"АК", 202805},
	{"АЖ", 817215},
	{"БАР", 818100},
	{"БХ", 508605},
	{"ББ", 302620},
	{"БКС", 802694},
	{"БЯР", 818400},
	{"БРК", 818200},
	{"БК", 202100},
	{"БЗН", 818600},
	{"БОБ", 818305},
	{"Д", 202000},
	{"ДН", 202070},
	{"ДЧ", 202080},
	{"ДРК", 111111},
	{"ЕЕ", 100215},
	{"ЕС", 100240},
	{"Г", 202200},
	{"ГШ", 509000},
	{"ИЛ", 202545},
	{"ИВД", 304400},
	{"ИВ", 304400},
	{"ИВБ", 304403},
	{"ИВК", 804330},
	{"ИВЛ", 304410},
	{"ИР", 820700},
	{"КР", 100501},
	{"КВ", 100502},
	{"КЛ", 202400},
	{"КЛК", 202401},
	{"КЛО", 202430},
	{"КЛП", 202433},
	{"КЛЯ", 202450},
	{"КЛТ", 202444},
	{"КЛН", 820800},
	{"КС", 100508},
	{"КСТ", 700510},
	{"КРС", 821500},
	{"КРЛ", 821510},
	{"КЗ", 821100},
	{"ЛПН", 304201},
	{"ЛСБ", 100440},
	{"ЛЩ", 822100},
	{"ЛХ", 822400},
	{"МЛ", 822600},
	{"МЖ", 100600},
	{"ОБЛ", 823100},
	{"ОЛС", 304105},
	{"ПС", 100345},
	{"Я", 202300},
	{"ЯЗ", 202310},
	{"ЯО", 202325},
	{"ЯБ", 513400},
	{"ЯБД", 513410},
	{"Р", 511800},
	{"РК", 824010},
	{"РДД", 824100},
	{"СПС", 100101},
	{"СБ", 100105},
	{"СЕ", 100106},
	{"СИР", 824800},
	{"СЛ", 512100},
	{"ТН", 512125},
	{"СМР", 825100},
	{"СО", 100150},
	{"СПР", 824610},
	{"Т", 304300},
	{"ТАЛ", 804318},
	{"ШЕЛ", 804340},
	{"ТК", 304301},
	{"ТБ", 304305},
	{"ОСК", 304345},
	{"Ж", 820400},
	{"ЖЕ", 820800},
	{"В", 202500},
	{"ВК", 202501},
	{"ВШН", 508700},
	{"ШП", 824200},
	{"ЧР", 512800},
	{"ЧЛГ", 824021}
};
OZU Spr_OZU[42] =
{
	{3, "033", "Леса на каменистых россыпях, а также полосы леса по периметру шириной 50-100 м"},
	{5, "053", "Полосы леса вдоль снежных лавин и селевых потоков (100-200 м)"},
	{6, "063", "Водоохранная зона водных объектов, болот"},
	{7, "073", "Опушки леса (50-100 м), примыкающие к железным и автодорогам"},
	{8, "083", "Участки леса вокруг лечебных и оздоровительных учреждений (в радиусе 1 км)"},
	{9, "093", "Участки леса вокруг минеральных источников (в радиусе 1 км)"},
	{10, "103", "Участки леса вокруг сельских населённых пунктов и и садоводческих обществ (в радиусе 1 км)"},
	{11, "113", "Участки леса вокруг глухариных токов (в радиусе 300 м)"},
	{12, "123", "Полосы леса по берегам рек, заселённых бобрами (шир. 100 м)"},
	{13, "133", "Особо-охранные части заказников (охранная зона)"},
	{14, "143", "Участки леса с наличием ценных древесных пород, растений"},
	{16, "163", "Полосы леса в горах вдоль верхней его границы с безлесным пространством (200 м)"},
	{17, "173", "Полосы леса 100 м вдоль бровок обрывов, осыпей и оползней"},
	{19, "193", "Участки леса на крутых горных склонах"},
	{20, "203", "Защитные полосы лесов вдоль гребней и линий водоразделов (100-200 м)"},
	{22, "223", "Полосы леса вдоль трасс туристических маршрутов (100-250 м)"},
	{23, "233", "Участки леса на легко размываемых и выветриваемых грунтах"},
	{24, "243", "Участки леса, имеющие под пологом высокопродуктивные ягодники промыслового значения (более 30%)"},
	{25, "253", "Площадь спецназначения"},
	{26, "263", "Полосы леса, защищающие клюквенные болота (шириной 100 м)"},
	{27, "273", "Леса на карстовых участках и защитные полосы вокруг (50-100 м)"},
	{28, "283", "Леса на рекультивированных карьерах и отвалах"},
	{30, "293", "Лесосеменные участки (ПСУ)"},
	{32, "303", "Орехоплодные участки"},
	{33, "313", "Медоносные участки леса"},
	{34, "323", "Насаждения-эталоны"},
	{35, "333", "Плюсовые насаждения"},
	{36, "343", "Леса, имеющие научное или историческое значение"},
	{37, "353", "Насаждения 5А-5Б бонитетов"},
	{38, "363", "Участки спелого леса с запасом на 1 га менее 50 кбм"},
	{39, "373", "Генетический резерват"},
	{40, "383", "Изреженное ОЗУ"},
	{41, "393", "Захрущевлённые площади"},
	{42, "423", "Кедровый стланик"},
	{44, "443", "Памятники природы"},
	{45, "453", "Участки леса в местах исчезновения редких животных и растений"},
	{46, "463", "Участки леса, имеющие важное значение для охраны месторождений подземных вод и источников водоснабжения"},
	{47, "473", "Биологическая редина"},
	{48, "483", "Санитарная зона промпредприятия"},
	{49, "493", "Памятники истории"},
	{50, "503", "Резерв"},
	{88, "888", ""}
};
TipiLesa Spr_TipLes[344] =
{
	{"ЛРШГ", 111, 1, "Нагорная", "С"},
	{"КРЛШГ", 112, 1, "Нагорная", "Е"},
	{"БКЛШГ", 112, 1, "Нагорная", "С"},
	{"ЛРГ", 121, 1, "Нагорная", "С"},
	{"КРВЛШ", 121, 1, "Нагорная", "Е"},
	{"БКГ", 121, 1, "Нагорная", "С"},
	{"БККТР", 122, 1, "Нагорная", "С"},
	{"ЕМКТР", 122, 1, "Нагорная", "Е"},
	{"ПМЧМШ", 131, 1, "Нагорная", "С"},
	{"БКОМШ", 131, 1, "Нагорная", "С"},
	{"КМГМШ", 132, 1, "Нагорная", "Е"},
	{"БКГМШ", 132, 1, "Нагорная", "С"},
	{"ЕМХМШ", 133, 1, "Нагорная", "Е"},
	{"КМХМШ", 133, 1, "Нагорная", "Е"},
	{"БКХМШ", 133, 1, "Нагорная", "С"},
	{"СНГ", 211, 1, "Нагорная", "С"},
	{"СНГ", 311, 1, "Нагорная", "С"},
	{"ЛНГ", 211, 1, "Нагорная", "С"},
	{"КНГ", 211, 1, "Нагорная", "Е"},
	{"КНГ", 311, 1, "Нагорная", "Е"},
	{"ЕНГ", 211, 1, "Нагорная", "Е"},
	{"ЕНГ", 311, 1, "Нагорная", "Е"},
	{"ЕНГ", 321, 1, "Нагорная", "Е"},
	{"СКМ", 212, 1, "Нагорная", "С"},
	{"СКМ", 313, 1, "Нагорная", "С"},
	{"ЕКМ", 313, 1, "Нагорная", "Е"},
	{"ККМ", 212, 1, "Нагорная", "Е"},
	{"ККМ", 313, 1, "Нагорная", "Е"},
	{"СКМ", 221, 2, "Брусничниковая, осочковая", "С"},
	{"ЕКМ", 221, 2, "Брусничниковая, осочковая", "Е"},
	{"ККМ", 221, 2, "Брусничниковая, осочковая", "Е"},
	{"СБРЛШ", 233, 2, "Брусничниковая, осочковая", "С"},
	{"КБРМЛ", 233, 2, "Брусничниковая, осочковая", "Е"},
	{"СМЛБР", 311, 2, "Брусничниковая, осочковая", "С"},
	{"СМЛБР", 312, 2, "Брусничниковая, осочковая", "С"},
	{"СМЛБР", 411, 2, "Брусничниковая, осочковая", "С"},
	{"СМЛБР", 412, 2, "Брусничниковая, осочковая", "С"},
	{"КЗВБР", 312, 2, "Брусничниковая, осочковая", "Е"},
	{"СМЛ", 411, 2, "Брусничниковая, осочковая", "С"},
	{"ЕНГ", 421, 2, "Брусничниковая, осочковая", "Е"},
	{"СНГ", 421, 2, "Брусничниковая, осочковая", "С"},
	{"СБР", 312, 2, "Брусничниковая, осочковая", "С"},
	{"СБР", 413, 2, "Брусничниковая, осочковая", "С"},
	{"СБР", 422, 2, "Брусничниковая, осочковая", "С"},
	{"СБР", 321, 2, "Брусничниковая, осочковая", "С"},
	{"СКЛШ", 412, 2, "Брусничниковая, осочковая", "С"},
	{"ККЛШ", 412, 2, "Брусничниковая, осочковая", "Е"},
	{"СЕБР", 421, 2, "Брусничниковая, осочковая", "С"},
	{"СБРВР", 412, 2, "Брусничниковая, осочковая", "С"},
	{"ЕОСЛП", 321, 2, "Брусничниковая, осочковая", "Е"},
	{"ЕСЛОС", 322, 2, "Брусничниковая, осочковая", "Е"},
	{"СОСЗЛ", 412, 2, "Брусничниковая, осочковая", "С"},
	{"СОСЛП", 413, 2, "Брусничниковая, осочковая", "С"},
	{"СОСМТ", 413, 2, "Брусничниковая, осочковая", "С"},
	{"СБРВК", 421, 2, "Брусничниковая, осочковая", "С"},
	{"СБОСТ", 421, 2, "Брусничниковая, осочковая", "С"},
	{"ЕОС", 323, 2, "Брусничниковая, осочковая", "Е"},
	{"СМШ", 222, 3, "Ягодниковая", "С"},
	{"ЕМШ", 222, 3, "Ягодниковая", "Е"},
	{"КМШ", 222, 3, "Ягодниковая", "Е"},
	{"КМШМП", 223, 3, "Ягодниковая", "Е"},
	{"СБРГ", 223, 3, "Ягодниковая", "С"},
	{"СЗМЯГ", 314, 3, "Ягодниковая", "С"},
	{"СЗМЯГ", 421, 3, "Ягодниковая", "С"},
	{"ЛЗМЯГ", 314, 3, "Ягодниковая", "С"},
	{"КЗМЯГ", 314, 3, "Ягодниковая", "Е"},
	{"ЛМШЯГ", 421, 3, "Ягодниковая", "С"},
	{"ЕСЯГ", 321, 3, "Ягодниковая", "Е"},
	{"ЕСЯГ", 322, 3, "Ягодниковая", "Е"},
	{"ЕСЗЯК", 435, 3, "Ягодниковая", "Е"},
	{"ЕСЯГ", 323, 3, "Ягодниковая", "Е"},
	{"СЯГ", 331, 3, "Ягодниковая", "С"},
	{"СЯГ", 322, 3, "Ягодниковая", "С"},
	{"СЯГ", 431, 3, "Ягодниковая", "С"},
	{"СЯГ", 432, 3, "Ягодниковая", "С"},
	{"СЧ", 314, 3, "Ягодниковая", "С"},
	{"СЧ", 422, 3, "Ягодниковая", "С"},
	{"ЕЧ", 314, 3, "Ягодниковая", "Е"},
	{"СЯГЗМ", 432, 3, "Ягодниковая", "С"},
	{"ЕЯГЗМ", 323, 3, "Ягодниковая", "Е"},
	{"СЗЯГ", 414, 3, "Ягодниковая", "С"},
	{"ЕСЗЯГ", 333, 3, "Ягодниковая", "Е"},
	{"ЕСЗЯГ", 435, 3, "Ягодниковая", "Е"},
	{"ЕЯГ", 432, 3, "Ягодниковая", "Е"},
	{"ЕЯГ", 323, 3, "Ягодниковая", "Е"},
	{"СББР", 421, 3, "Ягодниковая", "С"},
	{"СМШ", 313, 3, "Ягодниковая", "С"},
	{"ЕМШ", 313, 3, "Ягодниковая", "Е"},
	{"КМШ", 313, 3, "Ягодниковая", "Е"},
	{"КМШ", 413, 3, "Ягодниковая", "Е"},
	{"ЕЗММТ", 314, 3, "Ягодниковая", "Е"},
	{"ЕЗМТР", 431, 3, "Ягодниковая", "Е"},
	{"ЕЗМК", 433, 3, "Ягодниковая", "Е"},
	{"КЗММП", 414, 3, "Ягодниковая", "Е"},
	{"ЕЗММТ", 414, 3, "Ягодниковая", "Е"},
	{"ЕЗМЯГ", 421, 3, "Ягодниковая", "Е"},
	{"ЕЗММ", 422, 3, "Ягодниковая", "Е"},
	{"СЕЯЗМ", 435, 3, "Ягодниковая", "С"},
	{"СЯГ", 323, 3, "Ягодниковая", "С"},
	{"СБЧР", 421, 3, "Ягодниковая", "С"},
	{"КББРМ", 421, 3, "Ягодниковая", "Е"},
	{"СЕЯГ", 432, 3, "Ягодниковая", "С"},
	{"СБЧР", 441, 3, "Ягодниковая", "С"},
	{"ЕЛП", 331, 4, "Липняковая, разнотравная", "Е"},
	{"ЕЛП", 333, 4, "Липняковая, разнотравная", "Е"},
	{"ЕЛП", 332, 4, "Липняковая, разнотравная", "Е"},
	{"ЕЛП", 422, 4, "Липняковая, разнотравная", "Е"},
	{"ЕЛП", 423, 4, "Липняковая, разнотравная", "Е"},
	{"ЕЛП", 432, 4, "Липняковая, разнотравная", "Е"},
	{"СЛП", 422, 4, "Липняковая, разнотравная", "С"},
	{"СЛП", 423, 4, "Липняковая, разнотравная", "С"},
	{"СЛП", 431, 4, "Липняковая, разнотравная", "С"},
	{"СЕТЛ", 431, 4, "Липняковая, разнотравная", "С"},
	{"СЛП", 432, 4, "Липняковая, разнотравная", "С"},
	{"СТРЛ", 335, 4, "Липняковая, разнотравная", "С"},
	{"ЕТРЛП", 336, 4, "Липняковая, разнотравная", "Е"},
	{"СЯГЛП", 332, 4, "Липняковая, разнотравная", "С"},
	{"СТЯЛП", 434, 4, "Липняковая, разнотравная", "С"},
	{"СТГРЛ", 331, 4, "Липняковая, разнотравная", "С"},
	{"ЕКРТ", 333, 4, "Липняковая, разнотравная", "Е"},
	{"СЕЛП", 442, 4, "Липняковая, разнотравная", "С"},
	{"СЛПО", 322, 4, "Липняковая, разнотравная", "С"},
	{"ЕМШРТ", 223, 4, "Липняковая, разнотравная", "Е"},
	{"КМШМТ", 421, 4, "Липняковая, разнотравная", "Е"},
	{"ЕЗММТ", 421, 4, "Липняковая, разнотравная", "Е"},
	{"КЗМП", 422, 4, "Липняковая, разнотравная", "Е"},
	{"ЕЗМП", 422, 4, "Липняковая, разнотравная", "Е"},
	{"ЕЗМК", 252, 4, "Липняковая, разнотравная", "Е"},
	{"ЕЗМК", 423, 4, "Липняковая, разнотравная", "Е"},
	{"ЕЗМЧ", 253, 4, "Липняковая, разнотравная", "Е"},
	{"ЕК", 332, 4, "Липняковая, разнотравная", "Е"},
	{"ЕК", 334, 4, "Липняковая, разнотравная", "Е"},
	{"СКЗМ", 321, 4, "Липняковая, разнотравная", "С"},
	{"СМ", 321, 4, "Липняковая, разнотравная", "С"},
	{"КМП", 321, 4, "Липняковая, разнотравная", "Е"},
	{"ЕМП", 321, 4, "Липняковая, разнотравная", "Е"},
	{"ЕСТР", 433, 4, "Липняковая, разнотравная", "Е"},
	{"СЛП", 422, 4, "Липняковая, разнотравная", "С"},
	{"СЛПО", 422, 4, "Липняковая, разнотравная", "С"},
	{"ЕЛП", 422, 4, "Липняковая, разнотравная", "Е"},
	{"ЕТР", 332, 4, "Липняковая, разнотравная", "Е"},
	{"СТР", 433, 4, "Липняковая, разнотравная", "С"},
	{"СТР", 441, 4, "Липняковая, разнотравная", "С"},
	{"СРТР", 341, 4, "Липняковая, разнотравная", "С"},
	{"СРТР", 423, 4, "Липняковая, разнотравная", "С"},
	{"ЕТР", 332, 4, "Липняковая, разнотравная", "Е"},
	{"ЕСТР", 331, 4, "Липняковая, разнотравная", "Е"},
	{"ЕЛПО", 322, 4, "Липняковая, разнотравная", "Е"},
	{"ЕСТР", 337, 4, "Липняковая, разнотравная", "Е"},
	{"СОРЛ", 334, 4, "Липняковая, разнотравная", "С"},
	{"СОРЛ", 432, 4, "Липняковая, разнотравная", "С"},
	{"СОРЛ", 433, 4, "Липняковая, разнотравная", "С"},
	{"ЕТРЗМ", 332, 4, "Липняковая, разнотравная", "Е"},
	{"ЕТРЗМ", 334, 4, "Липняковая, разнотравная", "Е"},
	{"ЕШРКР", 341, 4, "Липняковая, разнотравная", "Е"},
	{"СЕТРЗМ", 333, 4, "Липняковая, разнотравная", "С"},
	{"ЕПЗМ", 334, 4, "Липняковая, разнотравная", "Е"},
	{"БОСРТ", 422, 4, "Липняковая, разнотравная", "С"},
	{"БОСРТ", 423, 4, "Липняковая, разнотравная", "С"},
	{"БОСВ", 423, 4, "Липняковая, разнотравная", "С"},
	{"СЗЛРТ", 421, 4, "Липняковая, разнотравная", "С"},
	{"СЗЛРТ", 431, 4, "Липняковая, разнотравная", "С"},
	{"СБОТР", 422, 4, "Липняковая, разнотравная", "С"},
	{"ДСКОР", 433, 4, "Липняковая, разнотравная", "Е"},
	{"БКРТ", 434, 4, "Липняковая, разнотравная", "Е"},
	{"СЕТЗМ", 435, 4, "Липняковая, разнотравная", "С"},
	{"БКСКР", 434, 4, "Липняковая, разнотравная", "Е"},
	{"ЕЧМШ", 332, 5, "Травяно-зеленомошная", "Е"},
	{"КХВЗМ", 321, 5, "Травяно-зеленомошная", "Е"},
	{"ЕХВЗМ", 321, 5, "Травяно-зеленомошная", "Е"},
	{"ЕКРП", 341, 5, "Травяно-зеленомошная", "Е"},
	{"ЕКРП", 441, 5, "Травяно-зеленомошная", "Е"},
	{"СБРБГ", 322, 5, "Травяно-зеленомошная", "С"},
	{"СТЗМ", 323, 5, "Травяно-зеленомошная", "С"},
	{"КБРБМ", 322, 5, "Травяно-зеленомошная", "Е"},
	{"СКРТ", 431, 5, "Травяно-зеленомошная", "С"},
	{"ЕКРТ", 341, 5, "Травяно-зеленомошная", "Е"},
	{"ЕКР", 341, 5, "Травяно-зеленомошная", "Е"},
	{"ЕКР", 342, 5, "Травяно-зеленомошная", "Е"},
	{"ЕРЗМ", 342, 5, "Травяно-зеленомошная", "Е"},
	{"СТМЧ", 342, 5, "Травяно-зеленомошная", "С"},
	{"СЧ", 443, 5, "Травяно-зеленомошная", "С"},
	{"СЗМТВ", 422, 5, "Травяно-зеленомошная", "С"},
	{"СБГБР", 422, 5, "Травяно-зеленомошная", "С"},
	{"СБГБР", 423, 5, "Травяно-зеленомошная", "С"},
	{"СТХ", 441, 5, "Травяно-зеленомошная", "С"},
	{"КБРБМ", 423, 5, "Травяно-зеленомошная", "Е"},
	{"ЕЗМРТ", 442, 5, "Травяно-зеленомошная", "Е"},
	{"ЕЗМКТ", 443, 5, "Травяно-зеленомошная", "Е"},
	{"ЕЗМПР", 444, 5, "Травяно-зеленомошная", "Е"},
	{"ЕМШЯГ", 451, 5, "Травяно-зеленомошная", "Е"},
	{"СМШЯГ", 451, 5, "Травяно-зеленомошная", "С"},
	{"СЗМТР", 422, 5, "Травяно-зеленомошная", "С"},
	{"ЕТРЗМ", 343, 5, "Травяно-зеленомошная", "Е"},
	{"СТТЗЛ", 441, 5, "Травяно-зеленомошная", "С"},
	{"СТЧЗМ", 442, 5, "Травяно-зеленомошная", "С"},
	{"ЕЗМЧ", 451, 5, "Травяно-зеленомошная", "Е"},
	{"БРТР", 444, 5, "Травяно-зеленомошная", "Е"},
	{"БИВРТ", 441, 5, "Травяно-зеленомошная", "Е"},
	{"БИВОТ", 451, 5, "Травяно-зеленомошная", "Е"},
	{"БРТЗЛ", 442, 5, "Травяно-зеленомошная", "Е"},
	{"БВН", 451, 5, "Травяно-зеленомошная", "Е"},
	{"БВОС", 452, 5, "Травяно-зеленомошная", "Е"},
	{"СКТМШ", 242, 5, "Травяно-зеленомошная", "С"},
	{"СКТМШ", 251, 5, "Травяно-зеленомошная", "С"},
	{"ЕКТМШ", 242, 5, "Травяно-зеленомошная", "Е"},
	{"ЕТЗМ", 333, 5, "Травяно-зеленомошная", "Е"},
	{"СТЗМ", 333, 5, "Травяно-зеленомошная", "С"},
	{"ЕТЗМ", 242, 5, "Травяно-зеленомошная", "Е"},
	{"ЕКТМШ", 251, 5, "Травяно-зеленомошная", "Е"},
	{"ККТМШ", 242, 5, "Травяно-зеленомошная", "Е"},
	{"ККП", 323, 5, "Травяно-зеленомошная", "Е"},
	{"ЕКП", 323, 5, "Травяно-зеленомошная", "Е"},
	{"ЕКТР", 323, 5, "Травяно-зеленомошная", "Е"},
	{"ЕКТР", 423, 5, "Травяно-зеленомошная", "Е"},
	{"СП", 324, 5, "Травяно-зеленомошная", "С"},
	{"СП", 424, 5, "Травяно-зеленомошная", "С"},
	{"КП", 324, 5, "Травяно-зеленомошная", "Е"},
	{"КП", 424, 5, "Травяно-зеленомошная", "Е"},
	{"ЕП", 324, 5, "Травяно-зеленомошная", "Е"},
	{"ЕП", 424, 5, "Травяно-зеленомошная", "Е"},
	{"БП", 424, 5, "Травяно-зеленомошная", "С"},
	{"БП", 324, 5, "Травяно-зеленомошная", "С"},
	{"ЕВТРП", 251, 5, "Травяно-зеленомошная", "Е"},
	{"ЕПРЧ", 361, 5, "Травяно-зеленомошная", "Е"},
	{"ЕПРЧ", 461, 5, "Травяно-зеленомошная", "Е"},
	{"ЕПРЧ", 462, 5, "Травяно-зеленомошная", "Е"},
	{"СКТР", 423, 5, "Травяно-зеленомошная", "С"},
	{"СКТР", 323, 5, "Травяно-зеленомошная", "С"},
	{"КТТР", 423, 5, "Травяно-зеленомошная", "Е"},
	{"СЕВТР", 361, 5, "Травяно-зеленомошная", "С"},
	{"ЕВТХВ", 351, 5, "Травяно-зеленомошная", "Е"},
	{"СОСТР", 461, 5, "Травяно-зеленомошная", "С"},
	{"ЕХВП", 224, 6, "Мшисто-хвощевая", "Е"},
	{"КХВП", 224, 6, "Мшисто-хвощевая", "Е"},
	{"СХВМШ", 231, 6, "Мшисто-хвощевая", "С"},
	{"ЕХВМШ", 231, 6, "Мшисто-хвощевая", "Е"},
	{"ЕХВМШ", 241, 6, "Мшисто-хвощевая", "Е"},
	{"ЕХВМШ", 421, 6, "Мшисто-хвощевая", "Е"},
	{"КХВМШ", 241, 6, "Мшисто-хвощевая", "Е"},
	{"СДМ", 331, 6, "Мшисто-хвощевая", "С"},
	{"СДМ", 431, 6, "Мшисто-хвощевая", "С"},
	{"ЕХВ", 331, 6, "Мшисто-хвощевая", "Е"},
	{"ЕХВ", 362, 6, "Мшисто-хвощевая", "Е"},
	{"ЕХВ", 423, 6, "Мшисто-хвощевая", "Е"},
	{"СЕКБХ", 461, 6, "Мшисто-хвощевая", "С"},
	{"КХВ", 331, 6, "Мшисто-хвощевая", "Е"},
	{"БДМХВ", 331, 6, "Мшисто-хвощевая", "Е"},
	{"КПР", 431, 6, "Мшисто-хвощевая", "Е"},
	{"ТБМКР", 241, 6, "Мшисто-хвощевая", "Е"},
	{"ЕМШ", 351, 6, "Мшисто-хвощевая", "Е"},
	{"ЕМШ", 362, 6, "Мшисто-хвощевая", "Е"},
	{"КБРБМ", 331, 6, "Мшисто-хвощевая", "Е"},
	{"БДМ", 331, 6, "Мшисто-хвощевая", "Е"},
	{"ЕЗМХВ", 432, 6, "Мшисто-хвощевая", "Е"},
	{"ЕЗМХВ", 461, 6, "Мшисто-хвощевая", "Е"},
	{"ЕЗМХВ", 462, 6, "Мшисто-хвощевая", "Е"},
	{"ЕДМСФ", 471, 6, "Мшисто-хвощевая", "Е"},
	{"СМШКТ", 472, 6, "Мшисто-хвощевая", "С"},
	{"ЕКСФХ", 473, 6, "Мшисто-хвощевая", "Е"},
	{"ССФХВ", 473, 6, "Мшисто-хвощевая", "С"},
	{"ЕП", 431, 6, "Мшисто-хвощевая", "Е"},
	{"ТБМК", 241, 6, "Мшисто-хвощевая", "Е"},
	{"ЕКХМШ", 363, 6, "Мшисто-хвощевая", "Е"},
	{"КЕСМШ", 451, 6, "Мшисто-хвощевая", "Е"},
	{"ЕСХВ", 461, 6, "Мшисто-хвощевая", "Е"},
	{"СДБГ", 432, 6, "Мшисто-хвощевая", "С"},
	{"ЕОХСФ", 362, 6, "Мшисто-хвощевая", "Е"},
	{"ЕХВСФ", 362, 6, "Мшисто-хвощевая", "Е"},
	{"ЕОСЕР", 243, 7, "Болотно-травяная", "Е"},
	{"БОСЕР", 243, 7, "Болотно-травяная", "Е"},
	{"ККТМШ", 252, 7, "Болотно-травяная", "Е"},
	{"СДМСФ", 252, 7, "Болотно-травяная", "С"},
	{"СДМСФ", 371, 7, "Болотно-травяная", "С"},
	{"БДМСФ", 252, 7, "Болотно-травяная", "Е"},
	{"СКСФ", 253, 7, "Болотно-травяная", "С"},
	{"СКСФ", 333, 7, "Болотно-травяная", "С"},
	{"СКСФ", 485, 7, "Болотно-травяная", "С"},
	{"СКСФ", 433, 7, "Болотно-травяная", "С"},
	{"СКСФ", 375, 7, "Болотно-травяная", "С"},
	{"СКСФ", 442, 7, "Болотно-травяная", "С"},
	{"ККСФ", 253, 7, "Болотно-травяная", "Е"},
	{"БКСФ", 253, 7, "Болотно-травяная", "Е"},
	{"СБТР", 332, 7, "Болотно-травяная", "С"},
	{"СБТР", 442, 7, "Болотно-травяная", "С"},
	{"ЕБТР", 332, 7, "Болотно-травяная", "Е"},
	{"ЕХОСФ", 333, 7, "Болотно-травяная", "Е"},
	{"ЕХОСФ", 433, 7, "Болотно-травяная", "Е"},
	{"ЕТРБ", 431, 7, "Болотно-травяная", "Е"},
	{"ЕТРБ", 432, 7, "Болотно-травяная", "Е"},
	{"СТРБ", 432, 7, "Болотно-травяная", "С"},
	{"БТРБ", 431, 7, "Болотно-травяная", "Е"},
	{"СБСФ", 432, 7, "Болотно-травяная", "С"},
	{"СБСФ", 462, 7, "Болотно-травяная", "С"},
	{"СОССФ", 432, 7, "Болотно-травяная", "С"},
	{"СОССФ", 433, 7, "Болотно-травяная", "С"},
	{"СОССФ", 372, 7, "Болотно-травяная", "С"},
	{"СОССФ", 471, 7, "Болотно-травяная", "С"},
	{"КХОСФ", 432, 7, "Болотно-травяная", "Е"},
	{"КХОСФ", 433, 7, "Болотно-травяная", "Е"},
	{"БХОСФ", 432, 7, "Болотно-травяная", "Е"},
	{"БОССФ", 373, 7, "Болотно-травяная", "Е"},
	{"БОССФ", 432, 7, "Болотно-травяная", "Е"},
	{"ББТР", 332, 7, "Болотно-травяная", "Е"},
	{"ЕХВОС", 333, 7, "Болотно-травяная", "Е"},
	{"ЕКХСФ", 481, 7, "Болотно-травяная", "Е"},
	{"ЕКТВВ", 482, 7, "Болотно-травяная", "Е"},
	{"СОС", 441, 7, "Болотно-травяная", "С"},
	{"СОС", 483, 7, "Болотно-травяная", "С"},
	{"ССФМ", 484, 7, "Болотно-травяная", "С"},
	{"ССФ", 462, 7, "Болотно-травяная", "С"},
	{"ССФ", 474, 7, "Болотно-травяная", "С"},
	{"ЕКХВ", 491, 7, "Болотно-травяная", "Е"},
	{"ЕКОСФ", 442, 7, "Болотно-травяная", "Е"},
	{"ЕКОСФ", 492, 7, "Болотно-травяная", "Е"},
	{"БОССФ", 433, 7, "Болотно-травяная", "Е"},
	{"ЕХВВ", 371, 7, "Болотно-травяная", "Е"},
	{"ССФХП", 371, 7, "Болотно-травяная", "С"},
	{"ОЛВТР", 374, 7, "Болотно-травяная", "Е"},
	{"ОЛВТР", 475, 7, "Болотно-травяная", "Е"},
	{"ЕКВТР", 376, 7, "Болотно-травяная", "Е"},
	{"СПСФ", 472, 7, "Болотно-травяная", "С"},
	{"СБПСФ", 473, 7, "Болотно-травяная", "С"},
	{"СББОС", 471, 7, "Болотно-травяная", "С"},
	{"БЕДХВ", 474, 7, "Болотно-травяная", "Е"},
	{"БТОСФ", 475, 7, "Болотно-травяная", "Е"},
	{"ОЛТРВ", 476, 7, "Болотно-травяная", "Е"},
	{"СХВСФ", 441, 7, "Болотно-травяная", "С"},
	{"ЕКСФТ", 441, 7, "Болотно-травяная", "Е"},
	{"ЕСХСФ", 371, 7, "Болотно-травяная", "Е"},
	{"СБВСФ", 372, 7, "Болотно-травяная", "С"},
	{"СОСТР", 471, 7, "Болотно-травяная", "С"},
	{"ЕСФТР", 473, 7, "Болотно-травяная", "Е"},
	{"БОСВ", 441, 7, "Болотно-травяная", "Е"},
	{"БТОС", 442, 7, "Болотно-травяная", "Е"},
	{"БТРОС", 373, 7, "Болотно-травяная", "Е"},
	{"БТРСТ", 464, 7, "Болотно-травяная", "Е"},
	{"БОСТР", 463, 7, "Болотно-травяная", "Е"},
	{"БОСТР", 472, 7, "Болотно-травяная", "Е"},
	{"ОЛКТВ", 363, 7, "Болотно-травяная", "Е"},
	{"ОЛКТВ", 371, 7, "Болотно-травяная", "Е"},
	{"ОЛКТВ", 471, 7, "Болотно-травяная", "Е"},
	{"ОЛВОС", 465, 7, "Болотно-травяная", "Е"},
	{"ОЛВОС", 475, 7, "Болотно-травяная", "Е"}
};
RubkiUhoda Spr_RubkiUhoda[134] =
{
	{2,"С", 'С', 'В',20,8,30},
	{2,"С", 'С', 'В',20,9,45},
	{2,"С", 'С', 'В',20,10,60},
	{2,"С", 'Ч', 'В',25,9,30},
	{2,"С", 'Ч', 'В',25,10,40},
	{2,"С", 'Ч', 'Н',25,8,20},
	{2,"С", 'Ч', 'Н',25,9,30},
	{2,"С", 'Ч', 'Н',25,10,40},
	{2,"С", 'С', 'В',25,8,20},
	{2,"С", 'С', 'В',25,9,30},
	{2,"С", 'С', 'В',25,10,40},
	{2,"С", 'С', 'Н',25,8,20},
	{2,"С", 'С', 'Н',25,9,25},
	{2,"С", 'С', 'Н',25,10,30},
	{2,"С", 'Ч', 'В',32,8,20},
	{2,"С", 'Ч', 'В',32,9,25},
	{2,"С", 'Ч', 'В',32,10,30},
	{2,"С", 'Ч', 'Н',32,8,20},
	{2,"С", 'Ч', 'Н',32,9,25},
	{2,"С", 'Ч', 'Н',32,10,30},
	{2,"С", 'С', 'В',32,8,20},
	{2,"С", 'С', 'В',32,9,30},
	{2,"С", 'С', 'В',32,10,40},
	{2,"С", 'С', 'Н',32,8,20},
	{2,"С", 'С', 'Н',32,9,30},
	{2,"С", 'С', 'Н',32,10,40},
	{2,"С", 'Ч', 'В',37,8,15},
	{2,"С", 'Ч', 'В',37,9,20},
	{2,"С", 'Ч', 'В',37,10,20},
	{2,"С", 'Ч', 'Н',37,8,15},
	{2,"С", 'Ч', 'Н',37,9,20},
	{2,"С", 'Ч', 'Н',37,10,20},
	{2,"С", 'С', 'В',37,8,20},
	{2,"С", 'С', 'В',37,9,25},
	{2,"С", 'С', 'В',37,10,25},
	{2,"С", 'С', 'Н',37,8,20},
	{2,"С", 'С', 'Н',37,9,25},
	{2,"С", 'С', 'Н',37,10,30},
	{2,"Е", 'Ч', 'В',25,8,20},
	{2,"Е", 'Ч', 'В',25,9,30},
	{2,"Е", 'Ч', 'В',25,10,40},
	{2,"Е", 'С', 'В',25,8,30},
	{2,"Е", 'С', 'В',25,9,40},
	{2,"Е", 'С', 'В',25,10,50},
	{2,"Е", 'С', 'Н',25,8,30},
	{2,"Е", 'С', 'Н',25,9,35},
	{2,"Е", 'С', 'Н',25,10,40},
	{2,"Е", 'Ч', 'В',32,8,20},
	{2,"Е", 'Ч', 'В',32,9,25},
	{2,"Е", 'Ч', 'В',32,10,30},
	{2,"Е", 'Ч', 'Н',32,8,20},
	{2,"Е", 'Ч', 'Н',32,9,25},
	{2,"Е", 'Ч', 'Н',32,10,25},
	{2,"Е", 'С', 'В',32,8,30},
	{2,"Е", 'С', 'В',32,9,35},
	{2,"Е", 'С', 'В',32,10,40},
	{2,"Е", 'С', 'Н',32,8,20},
	{2,"Е", 'С', 'Н',32,9,25},
	{2,"Е", 'С', 'Н',32,10,30},
	{2,"Е", 'Ч', 'В',37,8,15},
	{2,"Е", 'Ч', 'В',37,9,20},
	{2,"Е", 'Ч', 'В',37,10,20},
	{2,"Е", 'Ч', 'Н',37,8,15},
	{2,"Е", 'Ч', 'Н',37,9,20},
	{2,"Е", 'Ч', 'Н',37,10,20},
	{2,"Е", 'С', 'В',37,8,20},
	{2,"Е", 'С', 'В',37,9,25},
	{2,"Е", 'С', 'В',37,10,30},
	{2,"Е", 'С', 'Н',37,8,15},
	{2,"Е", 'С', 'Н',37,9,20},
	{2,"Е", 'С', 'Н',37,10,25},
	{2,"Б", 'Ч', 'В',25,9,20},
	{2,"Б", 'Ч', 'В',25,10,40},
	{2,"Б", 'Ч', 'В',37,9,20},
	{2,"Б", 'Ч', 'В',37,10,30},
	{2,"ОС", 'Ч', 'В',25,9,20},
	{2,"ОС", 'Ч', 'В',25,10,30},
	{2,"ОС", 'Ч', 'В',32,8,15},
	{2,"ОС", 'Ч', 'В',32,9,20},
	{2,"ОС", 'Ч', 'В',32,10,20},
	{1,"С", 'Ч', 'В',25,9,15},
	{1,"С", 'Ч', 'В',25,10,20},
	{1,"С", 'С', 'В',25,8,30},
	{1,"С", 'С', 'В',25,9,35},
	{1,"С", 'С', 'В',25,10,40},
	{1,"С", 'С', 'Н',25,8,30},
	{1,"С", 'С', 'Н',25,9,35},
	{1,"С", 'С', 'Н',25,10,40},
	{1,"С", 'Ч', 'В',32,8,20},
	{1,"С", 'Ч', 'В',32,9,25},
	{1,"С", 'Ч', 'В',32,10,30},
	{1,"С", 'Ч', 'Н',32,8,20},
	{1,"С", 'Ч', 'Н',32,9,25},
	{1,"С", 'Ч', 'Н',32,10,30},
	{1,"С", 'С', 'В',32,8,20},
	{1,"С", 'С', 'В',32,9,25},
	{1,"С", 'С', 'В',32,10,30},
	{1,"С", 'С', 'Н',32,8,20},
	{1,"С", 'С', 'Н',32,9,30},
	{1,"С", 'С', 'Н',32,10,40},
	{1,"С", 'Ч', 'В',37,8,20},
	{1,"С", 'Ч', 'В',37,9,25},
	{1,"С", 'Ч', 'В',37,10,25},
	{1,"С", 'Ч', 'Н',37,8,20},
	{1,"С", 'Ч', 'Н',37,9,25},
	{1,"С", 'Ч', 'Н',37,10,25},
	{1,"С", 'С', 'В',37,8,15},
	{1,"С", 'С', 'В',37,9,20},
	{1,"С", 'С', 'В',37,10,25},
	{1,"С", 'С', 'Н',37,8,20},
	{1,"С", 'С', 'Н',37,9,25},
	{1,"С", 'С', 'Н',37,10,25},
	{1,"Е", 'С', 'В',25,8,30},
	{1,"Е", 'С', 'В',25,9,35},
	{1,"Е", 'С', 'В',25,10,40},
	{1,"Е", 'Ч', 'В',32,8,20},
	{1,"Е", 'Ч', 'В',32,9,25},
	{1,"Е", 'Ч', 'В',32,10,30},
	{1,"Е", 'С', 'В',32,8,20},
	{1,"Е", 'С', 'В',32,9,25},
	{1,"Е", 'С', 'В',32,10,30},
	{1,"Е", 'Ч', 'В',37,8,15},
	{1,"Е", 'Ч', 'В',37,9,20},
	{1,"Е", 'Ч', 'В',37,10,20},
	{1,"Е", 'С', 'В',37,8,20},
	{1,"Е", 'С', 'В',37,9,25},
	{1,"Е", 'С', 'В',37,10,30},
	{1,"Б", 'Ч', 'В',25,9,20},
	{1,"Б", 'Ч', 'В',25,10,30},
	{1,"Б", 'Ч', 'В',37,9,15},
	{1,"Б", 'Ч', 'В',37,10,20},
	{1,"ОС", 'Ч', 'В',32,8,15},
	{1,"ОС", 'Ч', 'В',32,9,20},
	{1,"ОС", 'Ч', 'В',32,10,20}
};
VozrSpel Spr_VozSpel[28] =
{
	{'Э', "С", 'В', 81, 20},
	{'Э', "С", 'Н', 101, 20},
	{'Э', "Е", 'В', 81, 20},
	{'Э', "Е", 'Н', 101, 20},
	{'Э', "П", 'В', 81, 20},
	{'Э', "П", 'Н', 101, 20},
	{'Э', "К", 'В', 201, 40},
	{'Э', "Л", 'В', 101, 20},
	{'Э', "ЛПН", 'В', 81, 10},
	{'Э', "Б", 'В', 61, 10},
	{'Э', "ОЛЧ", 'В', 61, 10},
	{'Э', "ЛП", 'В', 61, 10},
	{'Э', "ОС", 'В', 41, 10},
	{'Э', "ОЛС", 'В', 41, 10},
	{'З', "С", 'В', 101, 20},
	{'З', "С", 'Н', 121, 20},
	{'З', "Е", 'В', 101, 20},
	{'З', "Е", 'Н', 121, 20},
	{'З', "П", 'В', 101, 20},
	{'З', "П", 'Н', 121, 20},
	{'З', "К", 'В', 241, 40},
	{'З', "Л", 'В', 121, 20},
	{'З', "ЛПН", 'В', 81, 10},
	{'З', "Б", 'В', 71, 10},
	{'З', "ОЛЧ", 'В', 71, 10},
	{'З', "ЛП", 'В', 71, 10},
	{'З', "ОС", 'В', 51, 10},
	{'З', "ОЛС", 'В', 51, 10}
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//void PokFormat(string& str, string& pokazatel, char format, int kolSimv)
//{
//	if (format == 'A')
//	{
//		str += pokazatel;
//		for (size_t i = 1; i <= kolSimv - pokazatel.size(); i++)
//		{
//			str += ' ';
//		}
//	}
//	else if (format == 'F')
//	{
//		if (kolSimv < (int)pokazatel.size())
//		{
//			int c = 0;
//		}
//		for (size_t i = 1; i <= kolSimv - pokazatel.size(); i++)
//		{
//			str += '0';
//		}
//		str += pokazatel;
//	}
//	else if (format == 'D')
//	{
//		if (pokazatel != "")
//		{
//			pokazatel.erase(pokazatel.find(','), 1);
//		}
//		for (size_t i = 1; i <= kolSimv - pokazatel.size(); i++)
//		{
//			str += '0';
//		}
//		str += pokazatel;
//	}
//	else if (format == 'P')
//	{
//		for (Poroda Por : Spr_Poroda)
//		{
//			if (Por.NAME == pokazatel)
//			{
//				str += to_string(Por.SOLI);
//				break;
//			}
//		}
//	}
//}
//
//void PokFormat(string& str, int& pokazatel, char format, int kolSimv)
//{
//	if (format == 'A')
//	{
//		str += to_string(pokazatel);
//		for (size_t i = 1; i <= kolSimv - to_string(pokazatel).size(); i++)
//		{
//			str += ' ';
//		}
//	}
//	else if (format == 'F')
//	{
//		for (size_t i = 1; i <= kolSimv - to_string(pokazatel).size(); i++)
//		{
//			str += '0';
//		}
//		str += to_string(pokazatel);
//	}
//}
//
//void VstavkaSimv(string& str, int n, char simv)
//{
//	for (; n != 0; n--)
//	{
//		str += simv;
//	}
//}

Maket_0 M_0_G{};
string FileNameIn;
string FileNameOut;
string FileNameOutS;
bool Str_is_int(string str)
{
	for (char simbol : str)
	{
		if (!isdigit(simbol))
		{
			return false;
		}
	}
	return true;
}
bool Push_Znach_int(int &znach, string &push, int &Maket, int &Position) // ПРИ ЧТЕНИИ ФАЙЛА ПРОВЕРЯЕТ ЯВЛЯЕТСЯ ЛИ ЗНАЧЕНИЕ ЦЕЛЫМ ЧИСЛОМ И ВСТАВЛЯЕТ В СООТВ. МАКЕТ И ПОЗИЦИЮ
{
	for (char simbol : push)
	{
		if (!isdigit(simbol))
		{
			cout << "Значение не является int: " << push << " (" << Maket << ": " << Position << ")" << endl;
			return false;
		}
	}
	znach = stoi(push);
	return true;
}
bool Prov_float(string str) // проверка правилности значения флоат
{
	if (str.size() < 3)	return false; // если количество символов меньше 3
	for (char ch : str)
		if (!isdigit(ch) && ch != ',')	return false; // если есть некорректрный символ в строке
	if (str[0] == ',' || str[str.size() - 2] != ',')	
		return false; // если запятая в начале строки или не предпоследний символ
	return true;
}


class Videl
{
public:
	RaschPok RP;
	Maket_0 M_0;
	Maket_1 M_1;
	Maket_2* M_2{};
	Maket_3* M_3{};
	Maket_4* M_4{};
	list<Maket_10> M_10;
	Maket_31* M_31{};
	Maket_32* M_32{};
	list<Maket_11> M_11;
	list<Maket_12> M_12;
	list<Maket_13> M_13;
	list<Maket_14> M_14;
	list<Maket_15> M_15;
	list<Maket_16> M_16;
	list<Maket_17> M_17;
	list<Maket_18> M_18;
	list<Maket_19> M_19;
	list<Maket_20> M_20;
	list<Maket_21> M_21;
	list<Maket_22> M_22;
	list<Maket_23> M_23;
	list<Maket_24> M_24;
	list<Maket_25> M_25;
	list<Maket_26> M_26;
	list<Maket_27> M_27;
	list<Maket_28> M_28;
	list<Maket_29> M_29;
	list<Maket_34> M_34;


	Videl(string& str)
	{
		int Maket = 0;
		int Position = 0;
		string elem;
		bool Kluch = true;
		for (char simvol : str)
		{
			switch (simvol)
			{
			case '.':
				if (Kluch)
				{
					Push_Znach_int(Maket, elem, Maket, Position);
					Kluch = false;
					switch (Maket)
					{
					case 0:
						M_0_G.Clear();
						break;
					case 2:
						M_2 = new Maket_2;
						break;
					case 3:
						M_3 = new Maket_3;
						break;
					case 4:
						M_4 = new Maket_4;
						break;
					case 10:
						M_10.push_back(Maket_10());
						break;
					case 31:
						M_31 = new Maket_31;
						break;
					case 32:
						M_32 = new Maket_32;
						break;
					case 11:
						M_11.push_back(Maket_11());
						break;
					case 12:
						M_12.push_back(Maket_12());
						break;
					case 13:
						M_13.push_back(Maket_13());
						break;
					case 14:
						M_14.push_back(Maket_14());
						break;
					case 15:
						M_15.push_back(Maket_15());
						break;
					case 16:
						M_16.push_back(Maket_16());
						break;
					case 17:
						M_17.push_back(Maket_17());
						break;
					case 18:
						M_18.push_back(Maket_18());
						break;
					case 19:
						M_19.push_back(Maket_19());
						break;
					case 20:
						M_20.push_back(Maket_20());
						break;
					case 21:
						M_21.push_back(Maket_21());
						break;
					case 22:
						M_22.push_back(Maket_22());
						break;
					case 23:
						M_23.push_back(Maket_23());
						break;
					case 24:
						M_24.push_back(Maket_24());
						break;
					case 25:
						M_25.push_back(Maket_25());
						break;
					case 26:
						M_26.push_back(Maket_26());
						break;
					case 27:
						M_27.push_back(Maket_27());
						break;
					case 28:
						M_28.push_back(Maket_28());
						break;
					case 29:
						M_29.push_back(Maket_29());
						break;
					case 34:
						M_34.push_back(Maket_34());
						break;
					default:
						break;
					}
				}
				else
				{
					Position++;
					if (!elem.empty())
					{
						Zapis(Maket, Position, elem);
					}
				}
				elem.clear();
				break;
			case ':':
				Position++;
				Kluch = true;
				if (!elem.empty())
				{
					Zapis(Maket, Position, elem);
					elem.clear();
				}
				Position = 0;
				break;
			case '?':
				Position++;
				if (!elem.empty())
				{
					Zapis(Maket, Position, elem);
					elem.clear();
				}
				break;
			default:
				elem += simvol;
				break;
			}
		}
	}
	void Zapis(int Maket, int Position, string& elem)
	{
		switch (Maket)
		{
		case 0:
			switch (Position)
			{
			case 1:
				Push_Znach_int(M_0_G._1_kz, elem, Maket, Position);
				break;
			case 2:
				Push_Znach_int(M_0_G._2_kv, elem, Maket, Position);
				break;
			case 3:
				Push_Znach_int(M_0_G._3_admR, elem, Maket, Position);
				break;
			case 4:
				Push_Znach_int(M_0_G._4_arend, elem, Maket, Position);
				break;
			case 5:
				Push_Znach_int(M_0_G._5_relef, elem, Maket, Position);
				break;
			case 6:
				Push_Znach_int(M_0_G._6_rekrZon, elem, Maket, Position);
				break;
			default:
				cout << "Неизвестное значение: макет " << Maket << ", позиция " << Position;
				break;
			}
			break;
		case 1:
			M_0 = M_0_G;
			switch (Position)
			{
			case 1:
				Push_Znach_int(M_1._1_vd, elem, Maket, Position);
				RP.id = M_0._2_kv * 1000 + M_1._1_vd;
				break;
			case 2:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_1._2_S = (int)(stof(elem) * 10);
				break;
			case 3:
				Push_Znach_int(M_1._3_katZem, elem, Maket, Position);
				break;
			case 4:
				Push_Znach_int(M_1._4_spRub, elem, Maket, Position);
				break;
			case 5:
				Push_Znach_int(M_1._5_OZU, elem, Maket, Position);
				break;
			case 6:
				M_1._6_sklon = elem;
				break;
			case 7:
				Push_Znach_int(M_1._7_krut, elem, Maket, Position);
				break;
			case 8:
				Push_Znach_int(M_1._8_vidEroz, elem, Maket, Position);
				break;
			case 9:
				Push_Znach_int(M_1._9_stepEroz, elem, Maket, Position);
				break;
			default:
				cout << "Неизвестное значение: макет " << Maket << ", позиция " << Position;
				break;
			}
			break;
		case 2:
			switch (Position)
			{
			case 1:
				Push_Znach_int((*M_2)._1_hoz1, elem, Maket, Position);
				break;
			case 2:
				Push_Znach_int((*M_2)._2_procVib, elem, Maket, Position);
				break;
			case 3:
				Push_Znach_int((*M_2)._3_rtk1, elem, Maket, Position);
				break;
			case 4:
				Push_Znach_int((*M_2)._4_hoz2, elem, Maket, Position);
				break;
			case 5:
				Push_Znach_int((*M_2)._5_rtk2, elem, Maket, Position);
				break;
			case 6:
				Push_Znach_int((*M_2)._6_hoz3, elem, Maket, Position);
				break;
			case 7:
				Push_Znach_int((*M_2)._7_rtk3, elem, Maket, Position);
				break;
			case 8:
				(*M_2)._8_celPor = elem;
				break;
			default:
				cout << "Неизвестное значение: макет " << Maket << ", позиция " << Position;
				break;
			}
			break;
		case 3:
			switch (Position)
			{
			case 1:
				(*M_3)._1_glPor = elem;
				break;
			case 2:
				(*M_3)._2_bon = elem;
				break;
			case 3:
				(*M_3)._3_tipL = elem;
				break;
			case 4:
				(*M_3)._4_tum = elem;
				break;
			case 5:
				(*M_3)._5_godRub = elem;
				break;
			case 6:
				Push_Znach_int((*M_3)._6_kolPnei, elem, Maket, Position);
				break;
			case 7:
				Push_Znach_int((*M_3)._7_kolPneiC, elem, Maket, Position);
				break;
			case 8:
				Push_Znach_int((*M_3)._8_dPnei, elem, Maket, Position);
				break;
			case 9:
				Push_Znach_int((*M_3)._9_tipVirub, elem, Maket, Position);
				break;
			default:
				cout << "Неизвестное значение: макет " << Maket << ", позиция " << Position;
				break;
			}
			break;
		case 4:
			switch (Position)
			{
			case 1:
				Push_Znach_int(M_4->_1_zahl, elem, Maket, Position);
				break;
			case 2:
				Push_Znach_int(M_4->_2_zahlLikv, elem, Maket, Position);
				break;
			case 3:
				Push_Znach_int(M_4->_3_suhost, elem, Maket, Position);
				break;
			default:
				cout << "Неизвестное значение: макет " << Maket << ", позиция " << Position;
				break;
			}
			break;
		case 10:
			switch (Position)
			{
			case 1:
				Push_Znach_int(M_10.back()._1_yarus, elem, Maket, Position);
				break;
			case 2:
				Push_Znach_int(M_10.back()._2_kSost, elem, Maket, Position);
				break;
			case 3:
				M_10.back()._3_porod = elem;
				break;
			case 4:
				Push_Znach_int(M_10.back()._4_vozr, elem, Maket, Position);
				break;
			case 5:
				Push_Znach_int(M_10.back()._5_visot, elem, Maket, Position);
				break;
			case 6:
				Push_Znach_int(M_10.back()._6_diam, elem, Maket, Position);
				break;
			case 7:
				Push_Znach_int(M_10.back()._7_klTov, elem, Maket, Position);
				break;
			case 8:
				Push_Znach_int(M_10.back()._8_proish, elem, Maket, Position);
				break;
			case 9:
				if (M_10.back()._1_yarus != 4 && M_10.back()._1_yarus != 6 && M_10.back()._1_yarus != 7) // ЕСЛИ ЯРУС - НЕСОМКНУВШИЕСЯ ЛЕСНЫЕ КУЛЬТУРЫ, Т.Е. УКАЗАНА ПРИЗИВАЕМОСТЬ ТО НЕ ПРОВЕРЯТЬ КОРРЕКТНОСТЬ float
					if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_10.back()._9_poln = elem;
				break;
			case 10:
				Push_Znach_int(M_10.back()._10_sumPlSech, elem, Maket, Position);
				break;
			case 11:
				Push_Znach_int(M_10.back()._11_zapas, elem, Maket, Position);
				break;
			default:
				cout << "Неизвестное значение: макет 10" << ", позиция " << Position;
				break;
			}
			break;
		case 31:
			switch (Position)
			{
			case 1:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_31->_1_kol = elem;
				break;
			case 2:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_31->_2_vis = elem;
				break;
			case 3:
				Push_Znach_int(M_31->_3_vozr, elem, Maket, Position);
				break;
			case 4:
				Push_Znach_int(M_31->_4_koef1, elem, Maket, Position);
				break;
			case 5:
				M_31->_5_por1 = elem;
				break;
			case 6:
				Push_Znach_int(M_31->_6_koef2, elem, Maket, Position);
				break;
			case 7:
				M_31->_7_por2 = elem;
				break;
			case 8:
				Push_Znach_int(M_31->_8_koef3, elem, Maket, Position);
				break;
			case 9:
				M_31->_9_por3 = elem;
				break;
			case 10:
				Push_Znach_int(M_31->_10_ocenka, elem, Maket, Position);
				break;
			default:
				cout << "Неизвестное значение: макет " << Maket << ", позиция " << Position;
				break;
			}
			break;
		case 32:
			switch (Position)
			{
			case 1:
				Push_Znach_int(M_32->_1_gust, elem, Maket, Position);
				break;
			case 2:
				M_32->_2_por1 = elem;
				break;
			case 3:
				M_32->_3_por2 = elem;
				break;
			case 4:
				M_32->_4_por3 = elem;
				break;
			default:
				cout << "Неизвестное значение: макет " << Maket << ", позиция " << Position;
				break;
			}
			break;
		case 11:
			switch (Position)
			{
			case 1:
				M_11.back()._1_god = elem;
				break;
			case 2:
				Push_Znach_int(M_11.back()._2_SPP, elem, Maket, Position);
				break;
			case 3:
				Push_Znach_int(M_11.back()._3_SSK, elem, Maket, Position);
				break;
			case 4:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_11.back()._4_RMR = elem;
				break;
			case 5:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_11.back()._5_RVR = elem;
				break;
			case 6:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_11.back()._6_kol = elem;
				break;
			case 7:
				Push_Znach_int(M_11.back()._7_sost, elem, Maket, Position);
				break;
			case 8:
				Push_Znach_int(M_11.back()._8_PG, elem, Maket, Position);
				break;
			default:
				break;
			}
			break;
		case 12:
			switch (Position)
			{
			case 1:
				Push_Znach_int(M_12.back()._1_tip, elem, Maket, Position);
				break;
			case 2:
				M_12.back()._2_god = elem;
				break;
			case 3:
				M_12.back()._3_por = elem;
				break;
			case 4:
				Push_Znach_int(M_12.back()._4_vid1, elem, Maket, Position);
				break;
			case 5:
				Push_Znach_int(M_12.back()._5_stepen1, elem, Maket, Position);
				break;
			case 6:
				Push_Znach_int(M_12.back()._6_vid2, elem, Maket, Position);
				break;
			case 7:
				Push_Znach_int(M_12.back()._7_stepen2, elem, Maket, Position);
				break;
			default:
				break;
			}
			break;
		case 13:
			switch (Position)
			{
			case 1:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_13.back()._1_shir = elem;
				break;
			case 2:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_13.back()._2_dlin = elem;
				break;
			case 3:
				Push_Znach_int(M_13.back()._3_sost, elem, Maket, Position);
				break;
			case 4:
				Push_Znach_int(M_13.back()._4_nazn, elem, Maket, Position);
				break;
			case 5:
				Push_Znach_int(M_13.back()._5_tipPok, elem, Maket, Position);
				break;
			case 6:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_13.back()._6_shirPrCh = elem;
				break;
			case 7:
				Push_Znach_int(M_13.back()._7_sezD, elem, Maket, Position);
				break;
			case 8:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_13.back()._8_dlinHM = elem;
				break;
			default:
				break;
			}
			break;
		case 14:
			switch (Position)
			{
			case 1:
				Push_Znach_int(M_14.back()._1_katU, elem, Maket, Position);
				break;
			case 2:
				Push_Znach_int(M_14.back()._2_vid1, elem, Maket, Position);
				break;
			case 3:
				Push_Znach_int(M_14.back()._3_procP1, elem, Maket, Position);
				break;
			case 4:
				Push_Znach_int(M_14.back()._4_vid2, elem, Maket, Position);
				break;
			case 5:
				Push_Znach_int(M_14.back()._5_procP2, elem, Maket, Position);
				break;
			case 6:
				Push_Znach_int(M_14.back()._6_vid3, elem, Maket, Position);
				break;
			case 7:
				Push_Znach_int(M_14.back()._7_procP3, elem, Maket, Position);
				break;
			default:
				break;
			}
			break;
		case 15:
			switch (Position)
			{
			case 1:
				M_15.back()._1_mer = elem;
				break;
			case 2:
				M_15.back()._2_god = elem;
				break;
			case 3:
				M_15.back()._3_por = elem;
				break;
			case 4:
				M_15.back()._4_zap = elem;
				break;
			case 5:
				M_15.back()._5_analiz = elem;
				break;
			case 6:
				M_15.back()._6_ocenka = elem;
				break;
			case 7:
				M_15.back()._7_prNeud = elem;
				break;
			case 8:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_15.back()._8_plosh = elem;
				break;
			default:
				break;
			}
			break;
		case 16:
			switch (Position)
			{
			case 1:
				M_16.back()._1_kat = elem;
				break;
			case 2:
				M_16.back()._2_por = elem;
				break;
			case 3:
				M_16.back()._3_vozr = elem;
				break;
			case 4:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_16.back()._4_vis = elem;
				break;
			case 5:
				M_16.back()._5_edIzm = elem;
				break;
			case 6:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_16.back()._6_urog = elem;
				break;
			case 7:
				M_16.back()._7_dostUr = elem;
				break;
			default:
				break;
			}
			break;
		case 17:
			switch (Position)
			{
			case 1:
				Push_Znach_int(M_17.back()._1_polz, elem, Maket, Position);
				break;
			case 2:
				Push_Znach_int(M_17.back()._2_kach, elem, Maket, Position);
				break;
			case 3:
				Push_Znach_int(M_17.back()._3_tipS, elem, Maket, Position);
				break;
			case 4:
				Push_Znach_int(M_17.back()._4_sost, elem, Maket, Position);
				break;
			case 5:
				M_17.back()._5_porZ = elem;
				break;
			case 6:
				Push_Znach_int(M_17.back()._6_procZ, elem, Maket, Position);
				break;
			case 7:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_17.back()._7_urogai = elem;
				break;
			default:
				break;
			}
			break;
		case 18:
			switch (Position)
			{
			case 1:
				M_18.back()._1_godNach = elem;
				break;
			case 2:
				M_18.back()._2_godZP = elem;
				break;
			case 3:
				M_18.back()._3_godZF = elem;
				break;
			case 4:
				Push_Znach_int(M_18.back()._4_sost, elem, Maket, Position);
				break;
			case 5:
				Push_Znach_int(M_18.back()._5_prNeudSost, elem, Maket, Position);
				break;
			case 6:
				Push_Znach_int(M_18.back()._6_nomTS, elem, Maket, Position);
				break;
			case 7:
				Push_Znach_int(M_18.back()._7_narTeh, elem, Maket, Position);
				break;
			case 8:
				Push_Znach_int(M_18.back()._8_stim, elem, Maket, Position);
				break;
			default:
				break;
			}
			break;
		case 19:
			switch (Position)
			{
			case 1:
				Push_Znach_int(M_19.back()._1_tipB, elem, Maket, Position);
				break;
			case 2:
				Push_Znach_int(M_19.back()._2_tipR, elem, Maket, Position);
				break;
			case 3:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_19.back()._3_moshT = elem;
				break;
			case 4:
				M_19.back()._4_porZ = elem;
				break;
			case 5:
				Push_Znach_int(M_19.back()._5_porcZ, elem, Maket, Position);
				break;
			default:
				break;
			}
			break;
		case 20:
			switch (Position)
			{
			case 1:
				M_20.back()._1_katPot = elem;
				break;
			case 2:
				M_20.back()._2_mestPot = elem;
				break;
			case 3:
				M_20.back()._3_por = elem;
				break;
			case 4:
				M_20.back()._4_zapOb = elem;
				break;
			case 5:
				M_20.back()._5_zapLikv = elem;
				break;
			case 6:
				M_20.back()._6_zapDel = elem;
				break;
			case 7:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_20.back()._7_kodVed = elem;
				break;
			default:
				break;
			}
			break;
		case 21:
			switch (Position)
			{
			case 1:
				M_21.back()._1_tipLand = elem;
				break;
			case 2:
				M_21.back()._2_estOc = elem;
				break;
			case 3:
				M_21.back()._3_sanOc = elem;
				break;
			case 4:
				M_21.back()._4_ust = elem;
				break;
			case 5:
				M_21.back()._5_prohVid = elem;
				break;
			case 6:
				M_21.back()._6_prosmVid = elem;
				break;
			case 7:
				M_21.back()._7_stadDigr = elem;
				break;
			case 8:
				M_21.back()._8_MAF = elem;
				break;
			default:
				break;
			}
			break;
		case 22:
			switch (Position)
			{
			case 1:
				M_22.back()._1_kat = elem;
				break;
			case 2:
				M_22.back()._2_god = elem;
				break;
			case 3:
				M_22.back()._3_por = elem;
				break;
			case 4:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_22.back()._4_rmr = elem;
				break;
			case 5:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_22.back()._5_rvr = elem;
				break;
			case 6:
				M_22.back()._6_kolDer = elem;
				break;
			case 7:
				M_22.back()._7_kolDerPl = elem;
				break;
			case 8:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_22.back()._8_urog = elem;
				break;
			default:
				break;
			}
			break;
		case 23:
			switch (Position)
			{
			case 1:
				Push_Znach_int(M_23.back()._1_osVd_1, elem, Maket, Position);
				break;
			case 2:
				Push_Znach_int(M_23.back()._2_osVd_2, elem, Maket, Position);
				break;
			case 3:
				Push_Znach_int(M_23.back()._3_osVd_3, elem, Maket, Position);
				break;
			case 4:
				Push_Znach_int(M_23.back()._4_osVd_4, elem, Maket, Position);
				break;
			case 5:
				Push_Znach_int(M_23.back()._5_osVd_5, elem, Maket, Position);
				break;
			case 6:
				Push_Znach_int(M_23.back()._6_osVd_6, elem, Maket, Position);
				break;
			case 7:
				Push_Znach_int(M_23.back()._7_osVd_7, elem, Maket, Position);
				break;
			case 8:
				Push_Znach_int(M_23.back()._8_osVd_8, elem, Maket, Position);
				break;
			case 9:
				Push_Znach_int(M_23.back()._9_osVd_9, elem, Maket, Position);
				break;
			case 10:
				Push_Znach_int(M_23.back()._10_osVd_10, elem, Maket, Position);
				break;
			case 11:
				Push_Znach_int(M_23.back()._11_osVd_11, elem, Maket, Position);
				break;
			}
			break;
		case 24:
			switch (Position)
			{
			case 1:
				M_24.back()._1_tipP = elem;
				break;
			case 2:
				M_24.back()._2_mehSost = elem;
				break;
			case 3:
				M_24.back()._3_stVlag = elem;
				break;
			case 4:
				M_24.back()._4_stepZad = elem;
				break;
			case 5:
				M_24.back()._5_moshP = elem;
				break;
			case 6:
				M_24.back()._6_prVihGP = elem;
				break;
			default:
				break;
			}
			break;
		case 25:
			switch (Position)
			{
			case 1:
				M_25.back()._1_nazn = elem;
				break;
			case 2:
				M_25.back()._2_god = elem;
				break;
			case 3:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_25.back()._3_rmr = elem;
				break;
			case 4:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_25.back()._4_rvr = elem;
				break;
			case 5:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_25.back()._5_kolD = elem;
				break;
			default:
				break;
			}
			break;
		case 26:
			switch (Position)
			{
			case 1:
				M_26.back()._1_kod = elem;
				break;
			default:
				break;
			}
			break;
		case 27:
			switch (Position)
			{
			case 1:
				M_27.back()._1_nomV = elem;
				break;
			case 2:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_27.back()._2_s = elem;
				break;
			case 3:
				M_27.back()._3_katZem = elem;
				break;
			case 4:
				M_27.back()._4_koefSPP = elem;
				break;
			case 5:
				M_27.back()._5_prPor = elem;
				break;
			case 6:
				M_27.back()._6_glPor = elem;
				break;
			case 7:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_27.back()._7_poln = elem;
				break;
			case 8:
				M_27.back()._8_prMer = elem;
				break;
			default:
				break;
			}
			break;
		case 28:
			switch (Position)
			{
			case 1:
				M_28.back()._1_prizDost = elem;
				break;
			case 2:
				M_28.back()._2_tipTrans = elem;
				break;
			case 3:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_28.back()._3_rast = elem;
				break;
			default:
				break;
			}
			break;
		case 29:
			switch (Position)
			{
			case 1:
				M_29.back()._1_tipSet = elem;
				break;
			case 2:
				M_29.back()._2_god = elem;
				break;
			case 3:
				M_29.back()._3_katZem = elem;
				break;
			case 4:
				M_29.back()._4_por = elem;
				break;
			case 5:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_29.back()._5_rdos = elem;
				break;
			case 6:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_29.back()._6_rmos = elem;
				break;
			case 7:
				M_29.back()._7_bon = elem;
				break;
			default:
				break;
			}
			break;
		case 34:
			switch (Position)
			{
			case 1:
				M_34.back()._1_tip = elem;
				break;
			case 2:
				M_34.back()._2_balUr = elem;
				break;
			case 3:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_34.back()._3_urOreh = elem;
				break;
			case 4:
				M_34.back()._4_rang = elem;
				break;
			case 5:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_34.back()._5_smol = elem;
				break;
			case 6:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_34.back()._6_kelLap = elem;
				break;
			case 7:
				if (!Prov_float(elem))	cout << M_0._2_kv * 1000 + M_1._1_vd << "/Некорректное значение float: " << "М-" << Maket << " :П-" << Position << endl;
				M_34.back()._7_pihLap = elem;
				break;
			default:
				break;
			}
			break;
		default:
			cout << "Неизвестное значение макета: " << Maket << ", Кв " << this->M_0._2_kv << ", Вд " << this->M_1._1_vd << endl;
			break;
		}
	}
	void ZapisMaket_0_TXT(string& str)
	{
		str += "0.";
		if (M_0._1_kz)				str += to_string(M_0._1_kz);		str += '.';
		if (M_0._2_kv)				str += to_string(M_0._2_kv);		str += '.';
		if (M_0._3_admR)			str += to_string(M_0._3_admR);		str += '.';
		if (M_0._4_arend)			str += to_string(M_0._4_arend);		str += '.';
		if (M_0._5_relef)			str += to_string(M_0._5_relef);		str += '.';
		if (M_0._6_rekrZon)			str += to_string(M_0._6_rekrZon);
		while (str.back() == '.')	str.pop_back();					str += ':';
	}
	void ZapisVidel_TXT(string& str)
	{
		{
			str += "1.";
			if (M_1._1_vd)			str += to_string(M_1._1_vd);		str += '.';
			if (M_1._2_S)			str = str + to_string(M_1._2_S / 10) + ',' + to_string(M_1._2_S % 10);	str += '.';
			if (M_1._3_katZem)		str += to_string(M_1._3_katZem);	str += '.';
			if (M_1._4_spRub)		str += to_string(M_1._4_spRub);		str += '.';
			if (M_1._5_OZU)			str += to_string(M_1._5_OZU);		str += '.';
			if (M_1._6_sklon != "")	str += M_1._6_sklon;			str += '.';
			if (M_1._7_krut)		str += to_string(M_1._7_krut);		str += '.';
			if (M_1._8_vidEroz)		str += to_string(M_1._8_vidEroz);	str += '.';
			if (M_1._9_stepEroz)	str += to_string(M_1._9_stepEroz);
			while (str.back() == '.')	str.pop_back();					str += ':';
		}
		if (M_2)
		{
			str += "2.";
			if (M_2->_1_hoz1)			str += to_string(M_2->_1_hoz1);		str += '.';
			if (M_2->_2_procVib)		str += to_string(M_2->_2_procVib);	str += '.';
			if (M_2->_3_rtk1)			str += to_string(M_2->_3_rtk1);		str += '.';
			if (M_2->_4_hoz2)			str += to_string(M_2->_4_hoz2);		str += '.';
			if (M_2->_5_rtk2)			str += to_string(M_2->_5_rtk2);		str += '.';
			if (M_2->_6_hoz3)			str += to_string(M_2->_6_hoz3);		str += '.';
			if (M_2->_7_rtk3)			str += to_string(M_2->_7_rtk3);		str += '.';
			if (M_2->_8_celPor != "")	str += M_2->_8_celPor;
			while (str.back() == '.')	str.pop_back();						str += ':';
		}
		if (M_3)
		{
			str += "3.";
			if (M_3->_1_glPor != "")	str += M_3->_1_glPor;				str += '.';
			if (M_3->_2_bon != "")		str += M_3->_2_bon;					str += '.';
			if (M_3->_3_tipL != "")		str += M_3->_3_tipL;				str += '.';
			if (M_3->_4_tum != "")		str += M_3->_4_tum;					str += '.';
			if (M_3->_5_godRub != "")	str += M_3->_5_godRub;				str += '.';
			if (M_3->_6_kolPnei)		str += to_string(M_3->_6_kolPnei);	str += '.';
			if (M_3->_7_kolPneiC)		str += to_string(M_3->_7_kolPneiC);	str += '.';
			if (M_3->_8_dPnei)			str += to_string(M_3->_8_dPnei);	str += '.';
			if (M_3->_9_tipVirub)		str += to_string(M_3->_9_tipVirub);
			while (str.back() == '.')	str.pop_back();						str += ':';
		}
		if (M_4)
		{
			str += "4.";
			if (M_4->_1_zahl)		str += to_string(M_4->_1_zahl);		str += '.';
			if (M_4->_2_zahlLikv)	str += to_string(M_4->_2_zahlLikv);	str += '.';
			if (M_4->_3_suhost)		str += to_string(M_4->_3_suhost);
			while (str.back() == '.')	str.pop_back();					str += ':';
		}
		if (!M_10.empty())
		{
			for (Maket_10 el : M_10)
			{
				str += "10.";
				if (el._1_yarus)		str += to_string(el._1_yarus);		str += '.';
				if (el._2_kSost)		str += to_string(el._2_kSost);		str += '.';
				if (el._3_porod != "")	str += el._3_porod;					str += '.';
				if (el._4_vozr)			str += to_string(el._4_vozr);		str += '.';
				if (el._5_visot)		str += to_string(el._5_visot);		str += '.';
				if (el._6_diam)			str += to_string(el._6_diam);		str += '.';
				if (el._7_klTov)		str += to_string(el._7_klTov);		str += '.';
				if (el._8_proish)		str += to_string(el._8_proish);		str += '.';
				if (el._9_poln != "")	str += el._9_poln;					str += '.';
				if (el._10_sumPlSech)	str += to_string(el._10_sumPlSech);	str += '.';
				if (el._11_zapas)		str += to_string(el._11_zapas);
				while (str.back() == '.')	str.pop_back();					str += ':';
			}
		}
		if (M_31)
		{
			str += "31.";
			if (M_31->_1_kol != "")		str += M_31->_1_kol;		str += '.';
			if (M_31->_2_vis != "")		str += M_31->_2_vis;		str += '.';
			if (M_31->_3_vozr)			str += to_string(M_31->_3_vozr);	str += '.';
			if (M_31->_4_koef1)			str += to_string(M_31->_4_koef1);	str += '.';
			if (M_31->_5_por1 != "")	str += M_31->_5_por1;				str += '.';
			if (M_31->_6_koef2)			str += to_string(M_31->_6_koef2);	str += '.';
			if (M_31->_7_por2 != "")	str += M_31->_7_por2;				str += '.';
			if (M_31->_8_koef3)			str += to_string(M_31->_8_koef3);	str += '.';
			if (M_31->_9_por3 != "")	str += M_31->_9_por3;				str += '.';
			if (M_31->_10_ocenka)		str += to_string(M_31->_10_ocenka);
			while (str.back() == '.')	str.pop_back();						str += ':';
		}
		if (M_32)
		{
			str += "32.";
			if (M_32->_1_gust)			str += to_string(M_32->_1_gust); str += '.';
			if (M_32->_2_por1 != "")	str += M_32->_2_por1;			str += '.';
			if (M_32->_3_por2 != "")	str += M_32->_3_por2;			str += '.';
			if (M_32->_4_por3 != "")	str += M_32->_4_por3;
			while (str.back() == '.')	str.pop_back();					str += ':';
		}
		if (!M_11.empty())
		{
			for (Maket_11 el : M_11)
			{
				str += "11.";
				if (el._1_god != "")		str += el._1_god;	str += '.';
				if (el._2_SPP)		str += to_string(el._2_SPP);	str += '.';
				if (el._3_SSK)		str += to_string(el._3_SSK);	str += '.';
				if (el._4_RMR != "")		str += el._4_RMR;		str += '.';
				if (el._5_RVR != "")		str += el._5_RVR;		str += '.';
				if (el._6_kol != "")		str += el._6_kol;		str += '.';
				if (el._7_sost)		str += to_string(el._7_sost);	str += '.';
				if (el._8_PG)		str += to_string(el._8_PG);
				while (str.back() == '.')	str.pop_back();					str += ':';
			}
		}
		if (!M_12.empty())
		{
			for (Maket_12 el : M_12)
			{
				str += "12.";
				if (el._1_tip)		str += to_string(el._1_tip);	str += '.';
				if (el._2_god != "")		str += el._2_god;	str += '.';
				if (el._3_por != "")str += el._3_por;				str += '.';
				if (el._4_vid1)		str += to_string(el._4_vid1);	str += '.';
				if (el._5_stepen1)	str += to_string(el._5_stepen1); str += '.';
				if (el._6_vid2)		str += to_string(el._6_vid2);	str += '.';
				if (el._7_stepen2)	str += to_string(el._7_stepen2);
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_13.empty())
		{
			for (Maket_13 el : M_13)
			{
				str += "13.";
				if (el._1_shir != "")		str += el._1_shir;		str += '.';
				if (el._2_dlin != "")		str += el._2_dlin;		str += '.';
				if (el._3_sost)		str += to_string(el._3_sost);		str += '.';
				if (el._4_nazn)		str += to_string(el._4_nazn);		str += '.';
				if (el._5_tipPok)	str += to_string(el._5_tipPok);		str += '.';
				if (el._6_shirPrCh != "") str += el._6_shirPrCh;		str += '.';
				if (el._7_sezD)		str += to_string(el._7_sezD);		str += '.';
				if (el._8_dlinHM != "")	str += el._8_dlinHM;
				while (str.back() == '.')	str.pop_back();				str += ':';
			}
		}
		if (!M_14.empty())
		{
			for (Maket_14 el : M_14)
			{
				str += "14.";
				if (el._1_katU)		str += to_string(el._1_katU);	str += '.';
				if (el._2_vid1)		str += to_string(el._2_vid1);	str += '.';
				if (el._3_procP1)	str += to_string(el._3_procP1);	str += '.';
				if (el._4_vid2)		str += to_string(el._4_vid2);	str += '.';
				if (el._5_procP2)	str += to_string(el._5_procP2);	str += '.';
				if (el._6_vid3)		str += to_string(el._6_vid3);	str += '.';
				if (el._7_procP3)	str += to_string(el._7_procP3);
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_15.empty())
		{
			for (Maket_15 el : M_15)
			{
				str += "15.";
				if (el._1_mer != "")		str += el._1_mer;		str += '.';
				if (el._2_god != "")		str += el._2_god;		str += '.';
				if (el._3_por != "")		str += el._3_por;		str += '.';
				if (el._4_zap != "")		str += el._4_zap;		str += '.';
				if (el._5_analiz != "")		str += el._5_analiz;	str += '.';
				if (el._6_ocenka != "")		str += el._6_ocenka;	str += '.';
				if (el._7_prNeud != "")		str += el._7_prNeud;	str += '.';
				if (el._8_plosh != "")		str += el._8_plosh;		str += '.';
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_16.empty())
		{
			for (Maket_16 el : M_16)
			{
				str += "16.";
				if (el._1_kat != "")		str += el._1_kat;		str += '.';
				if (el._2_por != "")		str += el._2_por;		str += '.';
				if (el._3_vozr != "")		str += el._3_vozr;		str += '.';
				if (el._4_vis != "")		str += el._4_vis;		str += '.';
				if (el._5_edIzm != "")		str += el._5_edIzm;		str += '.';
				if (el._6_urog != "")		str += el._6_urog;		str += '.';
				if (el._7_dostUr != "")		str += el._7_dostUr;	str += '.';
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_17.empty())
		{
			for (Maket_17 el : M_17)
			{
				str += "17.";
				if (el._1_polz)			str += to_string(el._1_polz);	str += '.';
				if (el._2_kach)			str += to_string(el._2_kach);	str += '.';
				if (el._3_tipS)			str += to_string(el._3_tipS);	str += '.';
				if (el._4_sost)			str += to_string(el._4_sost);	str += '.';
				if (el._5_porZ != "")	str += el._5_porZ;				str += '.';
				if (el._6_procZ)		str += to_string(el._6_procZ);	str += '.';
				if (el._7_urogai != "")		str += el._7_urogai;
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_18.empty())
		{
			for (Maket_18 el : M_18)
			{
				str += "18.";
				if (el._1_godNach != "")		str += el._1_godNach;	str += '.';
				if (el._2_godZP != "")		str += el._2_godZP;		str += '.';
				if (el._3_godZF != "")		str += el._3_godZF;		str += '.';
				if (el._4_sost)			str += to_string(el._4_sost);		str += '.';
				if (el._5_prNeudSost)	str += to_string(el._5_prNeudSost);	str += '.';
				if (el._6_nomTS)		str += to_string(el._6_nomTS);		str += '.';
				if (el._7_narTeh)		str += to_string(el._7_narTeh);		str += '.';
				if (el._8_stim)			str += to_string(el._8_stim);
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_19.empty())
		{
			for (Maket_19 el : M_19)
			{
				str += "19.";
				if (el._1_tipB)			str += to_string(el._1_tipB);	str += '.';
				if (el._2_tipR)			str += to_string(el._2_tipR);	str += '.';
				if (el._3_moshT != "")		str += el._3_moshT;		str += '.';
				if (el._4_porZ != "")	str += el._4_porZ;				str += '.';
				if (el._5_porcZ)		str += to_string(el._5_porcZ);
				while (str.back() == '.')	str.pop_back();				str += ':';
			}
		}
		if (!M_20.empty())
		{
			for (Maket_20 el : M_20)
			{
				str += "20.";
				if (el._1_katPot != "")		str += el._1_katPot;	str += '.';
				if (el._2_mestPot != "")	str += el._2_mestPot;	str += '.';
				if (el._3_por != "")		str += el._3_por;		str += '.';
				if (el._4_zapOb != "")		str += el._4_zapOb;		str += '.';
				if (el._5_zapLikv != "")	str += el._5_zapLikv;	str += '.';
				if (el._6_zapDel != "")		str += el._6_zapDel;	str += '.';
				if (el._7_kodVed != "")		str += el._7_kodVed;	str += '.';
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_21.empty())
		{
			for (Maket_21 el : M_21)
			{
				str += "21.";
				if (el._1_tipLand != "")	str += el._1_tipLand;	str += '.';
				if (el._2_estOc != "")		str += el._2_estOc;		str += '.';
				if (el._3_sanOc != "")		str += el._3_sanOc;		str += '.';
				if (el._4_ust != "")		str += el._4_ust;		str += '.';
				if (el._5_prohVid != "")	str += el._5_prohVid;	str += '.';
				if (el._6_prosmVid != "")	str += el._6_prosmVid;	str += '.';
				if (el._7_stadDigr != "")	str += el._7_stadDigr;	str += '.';
				if (el._8_MAF != "")		str += el._8_MAF;		str += '.';
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_22.empty())
		{
			for (Maket_22 el : M_22)
			{
				str += "22.";
				if (el._1_kat != "")		str += el._1_kat;		str += '.';
				if (el._2_god != "")		str += el._2_god;		str += '.';
				if (el._3_por != "")		str += el._3_por;		str += '.';
				if (el._4_rmr != "")		str += el._4_rmr;		str += '.';
				if (el._5_rvr != "")		str += el._5_rvr;		str += '.';
				if (el._6_kolDer != "")		str += el._6_kolDer;	str += '.';
				if (el._7_kolDerPl != "")	str += el._7_kolDerPl;	str += '.';
				if (el._8_urog != "")		str += el._8_urog;		str += '.';
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_23.empty())
		{
			for (Maket_23 el : M_23)
			{
				str += "23.";
				if (el._1_osVd_1)	str += to_string(el._1_osVd_1);		str += '.';
				if (el._2_osVd_2)	str += to_string(el._2_osVd_2);		str += '.';
				if (el._3_osVd_3)	str += to_string(el._3_osVd_3);		str += '.';
				if (el._4_osVd_4)	str += to_string(el._4_osVd_4);		str += '.';
				if (el._5_osVd_5)	str += to_string(el._5_osVd_5);		str += '.';
				if (el._6_osVd_6)	str += to_string(el._6_osVd_6);		str += '.';
				if (el._7_osVd_7)	str += to_string(el._7_osVd_7);		str += '.';
				if (el._8_osVd_8)	str += to_string(el._8_osVd_8);		str += '.';
				if (el._9_osVd_9)	str += to_string(el._9_osVd_9);		str += '.';
				if (el._10_osVd_10)	str += to_string(el._10_osVd_10);	str += '.';
				if (el._11_osVd_11)	str += to_string(el._11_osVd_11);
				while (str.back() == '.')	str.pop_back();				str += ':';
			}
		}
		if (!M_24.empty())
		{
			for (Maket_24 el : M_24)
			{
				str += "24.";
				if (el._1_tipP != "")		str += el._1_tipP;		str += '.';
				if (el._2_mehSost != "")	str += el._2_mehSost;	str += '.';
				if (el._3_stVlag != "")		str += el._3_stVlag;	str += '.';
				if (el._4_stepZad != "")	str += el._4_stepZad;	str += '.';
				if (el._5_moshP != "")		str += el._5_moshP;		str += '.';
				if (el._6_prVihGP != "")	str += el._6_prVihGP;	str += '.';
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_25.empty())
		{
			for (Maket_25 el : M_25)
			{
				str += "25.";
				if (el._1_nazn != "")		str += el._1_nazn;		str += '.';
				if (el._2_god != "")		str += el._2_god;		str += '.';
				if (el._3_rmr != "")		str += el._3_rmr;		str += '.';
				if (el._4_rvr != "")		str += el._4_rvr;		str += '.';
				if (el._5_kolD != "")		str += el._5_kolD;		str += '.';
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_26.empty())
		{
			for (Maket_26 el : M_26)
			{
				str += "26.";
				if (el._1_kod != "")		str += el._1_kod;		str += '.';
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_27.empty())
		{
			for (Maket_27 el : M_27)
			{
				str += "27.";
				if (el._1_nomV != "")		str += el._1_nomV;		str += '.';
				if (el._2_s != "")			str += el._2_s;			str += '.';
				if (el._3_katZem != "")		str += el._3_katZem;	str += '.';
				if (el._4_koefSPP != "")	str += el._4_koefSPP;	str += '.';
				if (el._5_prPor != "")		str += el._5_prPor;		str += '.';
				if (el._6_glPor != "")		str += el._6_glPor;		str += '.';
				if (el._7_poln != "")		str += el._7_poln;		str += '.';
				if (el._8_prMer != "")		str += el._8_prMer;		str += '.';
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_28.empty())
		{
			for (Maket_28 el : M_28)
			{
				str += "28.";
				if (el._1_prizDost != "")	str += el._1_prizDost;	str += '.';
				if (el._2_tipTrans != "")	str += el._2_tipTrans;	str += '.';
				if (el._3_rast != "")		str += el._3_rast;		str += '.';
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_29.empty())
		{
			for (Maket_29 el : M_29)
			{
				str += "29.";
				if (el._1_tipSet != "")		str += el._1_tipSet;	str += '.';
				if (el._2_god != "")		str += el._2_god;		str += '.';
				if (el._3_katZem != "")		str += el._3_katZem;	str += '.';
				if (el._4_por != "")		str += el._4_por;		str += '.';
				if (el._5_rdos != "")		str += el._5_rdos;		str += '.';
				if (el._6_rmos != "")		str += el._6_rmos;		str += '.';
				if (el._7_bon != "")		str += el._7_bon;		str += '.';
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		if (!M_34.empty())
		{
			for (Maket_34 el : M_34)
			{
				str += "34.";
				if (el._1_tip != "")		str += el._1_tip;		str += '.';
				if (el._2_balUr != "")		str += el._2_balUr;		str += '.';
				if (el._3_urOreh != "")		str += el._3_urOreh;	str += '.';
				if (el._4_rang != "")		str += el._4_rang;		str += '.';
				if (el._5_smol != "")		str += el._5_smol;		str += '.';
				if (el._6_kelLap != "")		str += el._6_kelLap;	str += '.';
				if (el._7_pihLap != "")		str += el._7_pihLap;	str += '.';
				while (str.back() == '.')	str.pop_back();			str += ':';
			}
		}
		str.back() = '?';
	}
	void RaschPokaz()
	{
		if (M_1._3_katZem <= 17)
		{
			if (M_3->_1_glPor == "С")
			{
				RP.ProdolgKlVoz = 20;
				if (M_3->_2_bon == "2" || M_3->_2_bon == "1" || M_3->_2_bon == "1А" || M_3->_2_bon == "1Б")
				{
					RP.VozrastSpelosti = 81;
					RP.GruppaBoniteiov = 'V';
				}
				else
				{
					RP.VozrastSpelosti = 101;
					RP.GruppaBoniteiov = 'N';
				}
			}
			else if (M_3->_1_glPor == "Е" || M_3->_1_glPor == "П")
			{
				RP.ProdolgKlVoz = 20;
				if (M_3->_2_bon == "3" || M_3->_2_bon == "2" || M_3->_2_bon == "1" || M_3->_2_bon == "1А" || M_3->_2_bon == "1Б")
				{
					RP.VozrastSpelosti = 81;
					RP.GruppaBoniteiov = 'V';
				}
				else
				{
					RP.VozrastSpelosti = 101;
					RP.GruppaBoniteiov = 'N';
				}
			}
			else if (M_3->_1_glPor == "Б" || M_3->_1_glPor == "ЛП" || M_3->_1_glPor == "ОЛЧ" || M_3->_1_glPor == "ДН" || M_3->_1_glPor == "ИЛ" || M_3->_1_glPor == "ЛПН")
			{
				RP.ProdolgKlVoz = 10;
				RP.VozrastSpelosti = 61;
			}
			else if (M_3->_1_glPor == "ОС" || M_3->_1_glPor == "ОЛС" || M_3->_1_glPor == "Т" || M_3->_1_glPor == "ТК" || M_3->_1_glPor == "ИВ" || M_3->_1_glPor == "ОЛСА" || M_3->_1_glPor == "ИВД")
			{
				RP.ProdolgKlVoz = 10;
				RP.VozrastSpelosti = 41;
			}
			else if (M_3->_1_glPor == "Л" || M_3->_1_glPor == "Д")
			{
				RP.ProdolgKlVoz = 20;
				RP.VozrastSpelosti = 101;
			}
			else if (M_3->_1_glPor == "К")
			{
				RP.ProdolgKlVoz = 40;
				RP.VozrastSpelosti = 201;
			}
			else if (M_3->_1_glPor == "КЛ" || M_3->_1_glPor == "В")
			{
				RP.ProdolgKlVoz = 20;
				RP.VozrastSpelosti = 81;
			}

			RP.KlassVozrasta = (int)ceil((double)M_10.front()._4_vozr / RP.ProdolgKlVoz);
			if (M_0._1_kz < 83 && M_0._1_kz != 4)
				RP.VozrastSpelosti += RP.ProdolgKlVoz;
			if (M_10.front()._4_vozr <= (RP.ProdolgKlVoz * 2))																			RP.GrupVozrasta = 1;
			else if (M_10.front()._4_vozr > (RP.ProdolgKlVoz * 2) && M_10.front()._4_vozr < (RP.VozrastSpelosti - RP.ProdolgKlVoz))		RP.GrupVozrasta = 2;
			else if (M_10.front()._4_vozr >= RP.VozrastSpelosti)																		RP.GrupVozrasta = 4;
			else																														RP.GrupVozrasta = 3;
		}
	}
	
	void Proverka_3(string &god_lesoustr)
	{
		if (M_3 != NULL)
		{
			if (M_1._3_katZem >= 3 && M_1._3_katZem <= 62)
			{
				for (auto el : { "С", "Б", "ОС", "Е", "П", "ЛП", "ОЛС", "Л", "К", "ОЛЧ", "ЛПН", "Д", "В", "ИВ", "ИВК", "ИВД", "ИЛ", "КЛ", "В", "!" })
				{
					if (el == M_3->_1_glPor)
						break;
					else if (el == "!")
						cout << RP.id << "/неизвестная порода - " << M_3->_1_glPor << endl;
				}
				for (auto el : { "3", "2", "4", "5", "5А", "1", "5Б",  "1А", "1Б", "!" })
				{
					if (el == M_3->_2_bon)
						break;
					else if (el == "!")
						cout << RP.id << "/неизвестный бонитет - " << M_3->_2_bon << endl;
				}
				if (M_3->_3_tipL == "")	cout << RP.id << "/не указан тип леса" << endl; // ТИП ЛЕСА
				else  
					for (char el : M_3->_3_tipL)	
						if (el < 'А' || el > 'Я')
						{
							cout << RP.id << "/неизвестный тип леса - " << M_3->_3_tipL << endl; // ТИП ЛЕСА
							break;
						}
				if (M_3->_4_tum == "")		cout << RP.id << "/не указан ТУМ" << endl; // ТУМ
				if (M_1._3_katZem == 57)
				{
					if (M_3->_5_godRub != god_lesoustr)						cout << RP.id << "/неверно указан год рубки" << endl; // ПРОВЕРКА ГОДА РУБКИ
					if (M_3->_6_kolPnei != 0 || M_3->_7_kolPneiC != 0)	cout << RP.id << "/количество пней не указывается" << endl; // КОЛИЧЕСТВА ПНЕЙ
				}
				else if (M_1._3_katZem == 59)
				{
					if (M_3->_5_godRub == "")	cout << RP.id << "/не указан год рубки" << endl; // ПРОВЕРКА ГОДА РУБКИ
					if (M_3->_6_kolPnei == 0)	cout << RP.id << "/не указано количество пней" << endl; // КОЛИЧЕСТВА ПНЕЙ
				}
				else if (M_3->_5_godRub != "" || M_3->_6_kolPnei != 0 || M_3->_7_kolPneiC != 0 || M_3->_8_dPnei != 0 || M_3->_9_tipVirub != 0)	cout << RP.id << "/характеристика вырубки не заполняется" << endl; // ПРОВЕРКА ВЫРУБКИ

			}
			else
			{
				cout << RP.id << "/3-й макет не заполняется" << endl;
			}
		}
		else if (M_1._3_katZem >= 3 && M_1._3_katZem <= 62)
		{
			cout << RP.id << "/не заполнен 3-й макет" << endl;
		}
	}
	void Proverka_10(string &god_lesoustr)
	{
		if (!M_10.empty())
		{
			if (M_1._3_katZem >= 3 && M_1._3_katZem <= 17)			if (M_10.front()._1_yarus != 1)	cout << RP.id << "/на первом месте должен быть 1-й ярус" << endl; //
			else if (M_1._3_katZem == 31)							if (M_10.front()._1_yarus != 4)	cout << RP.id << "/на первом месте должен быть 4-й ярус" << endl; //
			else if (M_1._3_katZem == 32)							if (M_10.front()._1_yarus != 7)	cout << RP.id << "/на первом месте должен быть 7-й ярус" << endl; //
			else if (M_1._3_katZem >= 34 && M_1._3_katZem <= 37)	if (M_10.front()._1_yarus != 4)	cout << RP.id << "/на первом месте должен быть 4-й ярус" << endl; //
			else if (M_1._3_katZem >= 40 && M_1._3_katZem <= 44)									cout << RP.id << "/10-й макет не заполняется" << endl; //
			else if (M_1._3_katZem == 51)							if (M_10.front()._1_yarus != 8)	cout << RP.id << "/на первом месте должен быть 8-й ярус" << endl; //
			else if (M_1._3_katZem >= 53 && M_1._3_katZem <= 55)	if (M_10.front()._1_yarus != 13)cout << RP.id << "/на первом месте должен быть 13-й ярус" << endl; //
			else if (M_1._3_katZem == 57)							if (M_10.front()._1_yarus != 1)	cout << RP.id << "/на первом месте должен быть 1-й ярус" << endl; //
			else if (M_1._3_katZem >= 58)															cout << RP.id << "/10-й макет не заполняется" << endl; //
			
			switch (M_1._3_katZem)
			{
			case 3:
			{
				for (Maket_10 el : M_10)
				{
					if (el._8_proish == 3) cout << RP.id << "/неверное происхождение породы или КЗ" << endl;
				}
				break;
			}
			case 8:
			{
				if (M_10.front()._8_proish == 3)	cout << RP.id << "/неверное происхождение главной породы - 3" << endl;
				else
				{
					bool flag = false;
					for (Maket_10 el : M_10)
						if (el._8_proish == 3)	flag = true;
					if (flag == false)	cout << RP.id << "/не указано происхождение лесных культур - 3" << endl;
				}
				break;
			}
			case 9:
			{
				bool flag = false;
				for (Maket_10 el : M_10)
				{
					if (el._1_yarus == 2)
					{
						flag = true;
						if (el._8_proish != 3)	cout << RP.id << "/происхождение лесных культур - 3" << endl;
						break;
					}
					else if (el._1_yarus == 6)
					{
						flag = true;
						if (el._8_proish != 3)	cout << RP.id << "/происхождение лесных культур - 3" << endl;
						if (el._9_poln == "")	cout << RP.id << "/не указана приживаемость" << endl;
						if (el._11_zapas != 0)	cout << RP.id << "/убрать запас" << endl; // ПРОВЕРКА ЗАПАСА
					}
				}
				if (flag == false)	cout << RP.id << "/не указан 2-й или 6-й ярус" << endl;
				break;
			}
			case 10:
			{
				if (M_10.front()._8_proish != 3)	cout << RP.id << "/происхождение лесных культур - 3" << endl;
				break;
			}
			case 31:
			{
				if (M_10.front()._8_proish != 3)	cout << RP.id << "/происхождение лесных культур - 3" << endl;
				if (M_10.front()._9_poln == "")		cout << RP.id << "/не указана приживаемость" << endl;
				if (M_10.front()._11_zapas != 0)	cout << RP.id << "/запас не указывается" << endl; // ПРОВЕРКА ЗАПАСА
				break;
			}
			case 57:
			{
				if (M_10.front()._11_zapas != 0)	cout << RP.id << "/запас не указывается" << endl; // ПРОВЕРКА ЗАПАСА
				break;
			}
			default:
				break;
			}

			int summ_koef = 0;
			int vozrast_obsh = 0;
			for (Maket_10 &el : M_10)
			{
				if (el._1_yarus == 0 || summ_koef == 0)	summ_koef += el._2_kSost; // ПРОВЕРКА СУММЫ КОЭФФИЦИЕНТОВ ЯРУСА
				else
				{
					if (summ_koef != 10)	cout << RP.id << "/сумма коэф. в 10-м макете не равна 10" << endl;
					summ_koef = el._2_kSost;
				}


				switch (el._1_yarus)
				{
				case 0:
					break;
				case 1:
				{
					if (el._4_vozr == 0)	cout << RP.id << "/не указан возраст в 1-м ярусе" << endl; // ВОЗРАСТ 0
					if (el._5_visot == 0)	cout << RP.id << "/не указана высота в 1-м ярусе" << endl; // ВЫСОТА 0
					if (el._6_diam == 0)	cout << RP.id << "/не указан диаметр в 1-м ярусе" << endl; // ДИАМЕТР 0
					if (el._8_proish != 0) if (el._8_proish != 3) if (el._8_proish != 5)	cout << RP.id << "/некорректное происхождение в 1-м ярусе" << endl; // ПРОИСХОЖДЕНИЕ
					if (el._9_poln == "")	cout << RP.id << "/не указана полнота в 1-м ярусе" << endl; // ПОЛНОТЫ НЕТ
					if (M_1._3_katZem != 57)
					{
						if (el._11_zapas == 0)	cout << RP.id << "/не указан запас в 1-м ярусе" << endl; // ЗАПАС 0
					}
					break;
				}
				case 2:
				{
					if (el._4_vozr == 0)	cout << RP.id << "/не указан возраст в 2-м ярусе" << endl; // ВОЗРАСТ 0
					if (el._5_visot == 0)	cout << RP.id << "/не указана высота в 2-м ярусе" << endl; // ВЫСОТА 0
					if (el._6_diam == 0)	cout << RP.id << "/не указан диаметр в 2-м ярусе" << endl; // ДИАМЕТР 0
					if (el._8_proish != 0) if (el._8_proish != 3) if (el._8_proish != 5)	cout << RP.id << "/некорректное происхождение в 2-м ярусе" << endl; // ПРОИСХОЖДЕНИЕ
					if (el._9_poln == "")	cout << RP.id << "/не указана полнота в 2-м ярусе" << endl; // ПОЛНОТЫ НЕТ
					if (el._11_zapas == 0)	cout << RP.id << "/не указан запас в 2-м ярусе" << endl; // ЗАПАС 0
					break;
				}
				case 4:
				{
					if (el._3_porod != "С" && el._3_porod != "Е" && el._3_porod != "Л" && el._3_porod != "К")	cout << RP.id << "/неизвестная порода  в 4-м ярусе - " << el._3_porod << endl;
					if (el._4_vozr == 0)	cout << RP.id << "/не указан возраст в 4-м ярусе" << endl; // ВОЗРАСТ 0
					if (el._5_visot >= 2)	cout << RP.id << "/некорректная высота в 4-м ярусе" << endl; // ВЫСОТА 0
					if (el._6_diam >= 2)	cout << RP.id << "/некорректный диаметр в 4-м ярусе" << endl; // ДИАМЕТР 0
					if (el._8_proish != 3)	cout << RP.id << "/некорректное происхождение в 4-м ярусе" << endl; // ПРОИСХОЖДЕНИЕ
					if (el._9_poln == "")	cout << RP.id << "/не указана приживаемость в 4-м ярусе" << endl; // ПОЛНОТЫ НЕТ
					if (el._11_zapas != 0)	cout << RP.id << "/запас не указывается в 4-м ярусе" << endl; // ЗАПАС 0
					break;
				}
				case 5:
				{
					if (el._4_vozr == 0)	cout << RP.id << "/не указан возраст в 5-м ярусе" << endl; // ВОЗРАСТ 0
					if (el._5_visot == 0)	cout << RP.id << "/не указана высота в 5-м ярусе" << endl; // ВЫСОТА 0
					if (el._6_diam == 0)	cout << RP.id << "/не указан диаметр в 5-м ярусе" << endl; // ДИАМЕТР 0
					if (el._8_proish != 0) if (el._8_proish != 5)	cout << RP.id << "/некорректное происхождение в 5-м ярусе" << endl; // ПРОИСХОЖДЕНИЕ
					if (el._9_poln == "")	cout << RP.id << "/не указана полнота в 5-м ярусе" << endl; // ПОЛНОТЫ НЕТ
					if (el._11_zapas == 0)	cout << RP.id << "/не указан запас в 5-м ярусе" << endl; // ЗАПАС 0
					break;
				}
				case 6:
				{
					if (el._3_porod != "С" && el._3_porod != "Е" && el._3_porod != "Л" && el._3_porod != "К")	cout << RP.id << "/неизвестная порода  в 4-м ярусе - " << el._3_porod << endl;
					if (el._4_vozr == 0)	cout << RP.id << "/не указан возраст в 6-м ярусе" << endl; // ВОЗРАСТ 0
					if (el._5_visot >= 2)	cout << RP.id << "/некорректная высота в 6-м ярусе" << endl; // ВЫСОТА 0
					if (el._6_diam >= 2)	cout << RP.id << "/некорректный диаметр в 6-м ярусе" << endl; // ДИАМЕТР 0
					if (el._8_proish != 3)	cout << RP.id << "/некорректное происхождение в 6-м ярусе" << endl; // ПРОИСХОЖДЕНИЕ
					if (el._9_poln == "")	cout << RP.id << "/не указана приживаемость в 6-м ярусе" << endl; // ПОЛНОТЫ НЕТ
					if (el._11_zapas != 0)	cout << RP.id << "/запас не указывается в 6-м ярусе" << endl; // ЗАПАС 0
					break;
				}
				case 7:
				{
					if (el._3_porod != "С" && el._3_porod != "Е" && el._3_porod != "Л" && el._3_porod != "К")	cout << RP.id << "/неизвестная порода  в 4-м ярусе - " << el._3_porod << endl;
					if (el._4_vozr == 0)	cout << RP.id << "/не указан возраст в 7-м ярусе" << endl; // ВОЗРАСТ 0
					if (el._5_visot >= 2)	cout << RP.id << "/некорректная высота в 7-м ярусе" << endl; // ВЫСОТА 0
					if (el._6_diam >= 2)	cout << RP.id << "/некорректный диаметр в 7-м ярусе" << endl; // ДИАМЕТР 0
					if (el._8_proish != 3)	cout << RP.id << "/некорректное происхождение в 7-м ярусе" << endl; // ПРОИСХОЖДЕНИЕ
					if (el._9_poln == "")	cout << RP.id << "/не указана приживаемость в 7-м ярусе" << endl; // ПОЛНОТЫ НЕТ
					if (el._11_zapas != 0)	cout << RP.id << "/запас не указывается в 7-м ярусе" << endl; // ЗАПАС 0
					break;
				}
				case 8:
				{
					if (el._4_vozr == 0)	cout << RP.id << "/не указан возраст в 8-м ярусе" << endl; // ВОЗРАСТ 0
					if (el._5_visot == 0)	cout << RP.id << "/не указана высота в 8-м ярусе" << endl; // ВЫСОТА 0
					if (el._6_diam == 0)	cout << RP.id << "/не указан диаметр в 8-м ярусе" << endl; // ДИАМЕТР 0
					if (el._8_proish != 0) if (el._8_proish != 3) if (el._8_proish != 5)	cout << RP.id << "/некорректное происхождение в 8-м ярусе" << endl; // ПРОИСХОЖДЕНИЕ
					if (el._9_poln != "0,1" && el._9_poln != "0,2")	cout << RP.id << "/некорректная полнота в 8-м ярусе" << endl; // ПОЛНОТЫ НЕТ
					if (el._11_zapas == 0)	cout << RP.id << "/не указан запас в 8-м ярусе" << endl; // ЗАПАС 0
					break;
				}
				case 9:
				{
					if (el._4_vozr == 0)	cout << RP.id << "/не указан возраст в 9-м ярусе" << endl; // ВОЗРАСТ 0
					if (el._5_visot == 0)	cout << RP.id << "/не указана высота в 9-м ярусе" << endl; // ВЫСОТА 0
					if (el._6_diam == 0)	cout << RP.id << "/не указан диаметр в 9-м ярусе" << endl; // ДИАМЕТР 0
					if (el._8_proish != 0)	cout << RP.id << "/происхождение не указывается в 9-м ярусе" << endl; // ПРОИСХОЖДЕНИЕ
					if (el._9_poln != "")	cout << RP.id << "/полнота не указывается в 9-м ярусе" << endl; // ПОЛНОТЫ НЕТ
					if (el._11_zapas == 0)	cout << RP.id << "/не указан запас в 9-м ярусе" << endl; // ЗАПАС 0
					break;
				}
				case 13:
				{
					if (el._4_vozr == 0)	cout << RP.id << "/не указан возраст в 13-м ярусе" << endl; // ВОЗРАСТ 0
					break;
				}
				default:
				{
					cout << RP.id << "/неизвестный ярус - " << el._1_yarus << endl; // ВОЗРАСТ 0
				}
				}

				if (el._3_porod == "")	cout << RP.id << "/не указана порода" << endl; // ПОРОДА
				else
					for (string por : { "С", "Б", "ОС", "Е", "П", "ЛП", "ОЛС", "Л", "К", "ОЛЧ", "ЛПН", "Д", "В", "ИВ", "ИВК", "ИВД", "ИЛ", "КЛ", "В", "!"})
						if (el._3_porod == por)	break;
						else if (por == "!")	cout << RP.id << "/неизвестная порода - " << el._3_porod << endl; // ПОРОДА
				if (el._4_vozr > 300)	cout << RP.id << "/некорректный возраст - " << el._4_vozr << endl; // ВОЗРАСТ > 300

				if (el._5_visot != 1)
					if (el._5_visot > el._6_diam * 2.5 || el._5_visot < el._6_diam * 0.3)	cout << RP.id << "/высота > диаметр*2,5 или диаметр*0,3 - порода " << el._3_porod << endl;
									
				if (el._5_visot > 35)														cout << RP.id << "/некорректная высота - " << el._5_visot << endl; // ВЫСОТА  > 35
				if (el._4_vozr < 100 && el._8_proish != 3 && el._4_vozr % 5 != 0)			cout << RP.id << "/возраст не кратный 5" << endl;
				if (el._4_vozr > 100 && el._8_proish != 3 && el._4_vozr % 10 != 0)			cout << RP.id << "/возраст не кратный 10" << endl;

				if (el._6_diam > 60)	cout << RP.id << "/некорректный диаметр - " << el._6_diam << endl; // ДИАМЕТР  > 60
				if (el._6_diam % 2)		cout << RP.id << "/нечетный диаметр - " << el._6_diam << endl; // НЕ ЧЕТНЫЙ ДИАМЕТР
				if (el._6_diam > el._5_visot * 3)	cout << RP.id << "/диаметр > высота*3 - порода " << el._3_porod << endl;
				if (el._6_diam > 16 && el._6_diam % 4)	el._6_diam = el._6_diam + 2; // УВЕЛИЧИТЬ ДИАМЕТР ПОРОДЫ НА 2
				if (el._7_klTov > 4)	cout << RP.id << "/некорректный кл. товарности - " << el._7_klTov << endl; // КЛАСС ТОВ. > 4
				if (RP.GrupVozrasta >= 3 && el._2_kSost != 0)
				{
					if (el._5_visot == 0)	cout << RP.id << "/не указана высота" << endl; // ПРОВЕРКА ЗАПОЛНЕНИЯ ВЫСОТЫ
					if (el._6_diam == 0)	cout << RP.id << "/не указан диаметр" << endl; // ПРОВЕРКА ЗАПОЛНЕНИЯ ДИАМЕТРА
					if (el._7_klTov == 0)	cout << RP.id << "/не указан кл. товарности" << endl; // ПРОВЕРКА ЗАПОЛНЕНИЯ КЛАССА ТОВАРНОСТИ
				}

				if (el._4_vozr != 0)	vozrast_obsh = el._4_vozr; // ЗАПОМНИТЬ ПОСЛЕДНИЙ ВОЗРАСТ ПОРОДЫ (ОБЩИЙ ДЛЯ НЕСКОЛЬКИХ)
				if (el._8_proish == 3) // ПРОВЕРКА ВОЗРОСТА КУЛЬТУР
				{
					int god_kult = 0;
					bool flag = false;
					if (!M_11.empty())
					{
						for (auto kulturi : M_11)
						{
							if (kulturi._1_god != "")
							{
								if (stoi(kulturi._1_god) <= stoi(god_lesoustr))	god_kult = stoi(kulturi._1_god) + 2000;
								else											god_kult = stoi(kulturi._1_god) + 1900;
								if (vozrast_obsh == (stoi(god_lesoustr) + 2000 - god_kult + 1))	flag = true;
							}
							else
							{
								flag = true;
							}
						}
						if (flag == false)	cout << RP.id << "/возраст культур - " << (stoi(god_lesoustr) + 2000 - god_kult + 1) << endl; //
					}
				}
			}
			if (summ_koef != 10)	cout << RP.id << "/сумма коэф. в 10-м макете не равна 10" << endl;
		}
		else
		{
			if (M_1._3_katZem >= 3 && M_1._3_katZem <= 17)			cout << RP.id << "/не заполнен 10-й макет, 1-й ярус" << endl; //
			else if (M_1._3_katZem == 31)							cout << RP.id << "/не заполнен 10-й макет, 4-й ярус" << endl; //
			else if (M_1._3_katZem == 32)							cout << RP.id << "/не заполнен 10-й макет, 7-й ярус" << endl; //
			else if (M_1._3_katZem >= 34 && M_1._3_katZem <= 37)	cout << RP.id << "/не заполнен 10-й макет, 4-й ярус" << endl; //
			else if (M_1._3_katZem == 51)							cout << RP.id << "/не заполнен 10-й макет, 8-й ярус" << endl; //
			else if (M_1._3_katZem >= 53 && M_1._3_katZem <= 55)	cout << RP.id << "/не заполнен 10-й макет, 13-й ярус" << endl; //
			else if (M_1._3_katZem == 57)							cout << RP.id << "/не заполнен 10-й макет, 1-й ярус" << endl; //
		}
	}
	void Proverka_11()
	{
		if (!M_11.empty()) // ПРОВЕРКА ПОГИБШИХ КУЛЬТУР
		{
			if (M_11.size() > 1)	cout << RP.id << "/больше одного 11 макета" << endl;
			if (M_1._3_katZem >= 3 && M_1._3_katZem <= 8)
			{
				if (M_11.front()._1_god == "")	cout << RP.id << "/не указан год лесных культур" << endl; // ГОД ЛЕСНЫХ КУЛЬТУР
				if (M_11.front()._2_SPP != 0 || M_11.front()._3_SSK != 0 || M_11.front()._4_RMR != "" || M_11.front()._5_RVR != "" || M_11.front()._6_kol != "")	cout << RP.id << "/лишняя характеристика в 11 макете" << endl;
				if (M_11.front()._7_sost != 1)	cout << RP.id << "/состояние ЛК - 1" << endl; //
				if (M_11.front()._8_PG < 20 || M_11.front()._8_PG > 35)	cout << RP.id << "/причина гибели ЛК от 20 до 35" << endl; // ГОД ЛЕСНЫХ КУЛЬТУР
			}
			else if (M_1._3_katZem == 9)
			{
				if (M_11.front()._1_god == "")	cout << RP.id << "/не указан год лесных культур" << endl;
				if (M_11.front()._7_sost < 2 || M_11.front()._7_sost > 4)	cout << RP.id << "/состояние ЛК - от 2 до 4" << endl;
				else if (M_11.front()._7_sost != 2)
				{
					if (M_11.front()._8_PG != 0)	cout << RP.id << "/причина гибели ЛК не указывается" << endl;
				}
				else if (M_11.front()._8_PG < 20 || M_11.front()._8_PG > 35)	cout << RP.id << "/причина гибели ЛК от 20 до 35" << endl;

				for (auto el : M_10)
				{
					if (el._1_yarus == 2)
					{
						if (M_11.front()._2_SPP != 0 || M_11.front()._3_SSK != 0 || M_11.front()._4_RMR != "" || M_11.front()._5_RVR != "" || M_11.front()._6_kol != "")	cout << RP.id << "/лишняя характеристика в 11 макете" << endl;
					}
					else if (el._1_yarus == 6)
					{
						if (M_11.front()._2_SPP == 0 || M_11.front()._3_SSK == 0 || M_11.front()._4_RMR == "" || M_11.front()._5_RVR == "" || M_11.front()._6_kol == "")	cout << RP.id << "/нехватает информации в 11 макете" << endl;
						if (el._9_poln != "")
						{
							if (stoi(el._9_poln) > 80)
							{
								if (M_11.front()._7_sost != 4)	cout << RP.id << "/состояне 4 (приживаемость 81 - 100%)" << endl;
							}
							else if (stoi(el._9_poln) > 25)
							{
								if (M_11.front()._7_sost != 3)	cout << RP.id << "/состояне 3 (приживаемость 26 - 80%)" << endl;
							}
							else if (M_11.front()._7_sost != 2)	cout << RP.id << "/состояне 2 (приживаемость 0 - 25%)" << endl;
						}
					}
				}
			}
			else if (M_1._3_katZem >= 10 && M_1._3_katZem <= 17)
			{
				if (M_11.front()._1_god == "")	cout << RP.id << "/не указан год лесных культур" << endl;
				if (M_11.front()._2_SPP != 0 || M_11.front()._3_SSK != 0 || M_11.front()._4_RMR != "" || M_11.front()._5_RVR != "" || M_11.front()._6_kol != "")	cout << RP.id << "/лишняя характеристика в 11 макете" << endl;
				if (M_11.front()._7_sost < 2 || M_11.front()._7_sost > 4)	cout << RP.id << "/состояние ЛК - от 2 до 4" << endl;
				else if (M_11.front()._7_sost != 2)
				{
					if (M_11.front()._8_PG != 0)	cout << RP.id << "/причина гибели ЛК не указывается" << endl;
				}
				else  if (M_11.front()._8_PG < 20 || M_11.front()._8_PG > 35)
					cout << RP.id << "/причина гибели ЛК от 20 до 35" << endl;
			}
			else if (M_1._3_katZem >= 31 && M_1._3_katZem <= 37)
			{
				if (M_11.front()._1_god == "")	cout << RP.id << "/не указан год лесных культур" << endl;
				if (M_11.front()._2_SPP == 0 || M_11.front()._3_SSK == 0 || M_11.front()._4_RMR == "" || M_11.front()._5_RVR == "" || M_11.front()._6_kol == "")	cout << RP.id << "/нехватает информации в 11 макете" << endl;
				if (M_11.front()._7_sost < 2 || M_11.front()._7_sost > 4)	cout << RP.id << "/состояние ЛК - от 2 до 4" << endl;
				else if (M_11.front()._7_sost != 2)
				{
					if (M_11.front()._8_PG != 0)	cout << RP.id << "/причина гибели ЛК не указывается" << endl;
				}
				else  if (M_11.front()._8_PG < 20 || M_11.front()._8_PG > 35)
					cout << RP.id << "/причина гибели ЛК от 20 до 35" << endl;
				if (M_10.front()._9_poln != "")
				{
					if (stoi(M_10.front()._9_poln) > 80)
					{
						if (M_11.front()._7_sost != 4)	cout << RP.id << "/состояне 4 (приживаемость 81 - 100%)" << endl;
					}
					else if (stoi(M_10.front()._9_poln) > 25)
					{
						if (M_11.front()._7_sost != 3)	cout << RP.id << "/состояне 3 (приживаемость 26 - 80%)" << endl;
					}
					else if (M_11.front()._7_sost != 2)	cout << RP.id << "/состояне 2 (приживаемость 0 - 25%)" << endl;
				}
			}
			else if (M_1._3_katZem >= 40 && M_1._3_katZem <= 41)
			{
				cout << RP.id << "/не заполнен макет 11" << endl;
			}
			else if (M_1._3_katZem >= 53 && M_1._3_katZem <= 73)
			{
				if (M_11.front()._1_god == "")	cout << RP.id << "/не указан год лесных культур" << endl; // ГОД ЛЕСНЫХ КУЛЬТУР
				if (M_11.front()._2_SPP != 0 || M_11.front()._3_SSK != 0 || M_11.front()._4_RMR != "" || M_11.front()._5_RVR != "" || M_11.front()._6_kol != "")	cout << RP.id << "/лишняя характеристика в 11 макете" << endl;
				if (M_11.front()._7_sost != 1)	cout << RP.id << "/состояние ЛК - 1" << endl; //
				if (M_11.front()._8_PG < 20 || M_11.front()._8_PG > 35)	cout << RP.id << "/причина гибели ЛК от 20 до 35" << endl; // ГОД ЛЕСНЫХ КУЛЬТУР
			}
			else if (M_1._3_katZem >= 82)
			{
				cout << RP.id << "/макет 11 не заполняется" << endl;
			}
		}
		else
		{
			if (M_1._3_katZem >= 8 && M_1._3_katZem <= 37)	cout << RP.id << "/не заполнен макет 11" << endl;
		}
	}
	void Proverka_12()
	{
		if (!M_12.empty())
		{
			if (M_1._3_katZem >= 3 && M_1._3_katZem <= 73)
			{
				bool kluch;
				for (auto el : M_12)
				{
					if (el._1_tip < 1 || el._1_tip > 19)
						cout << RP.id << "/неверный тип повреждения 12-м макете (1-19)" << endl;
					else
					{
						if (el._1_tip == 11)
						{
							if (el._4_vid1 < 1 || el._4_vid1 > 10)
							{
								cout << RP.id << "/неверный вид повреждения 12-м макете (при типе болезни леса 1-10)" << endl;
							}
							if (el._6_vid2 < 0 || el._6_vid2 > 10)
							{
								cout << RP.id << "/неверный вид повреждения 12-м макете (при типе болезни леса 1-10)" << endl;
							}
						}
						else if (el._1_tip == 12)
						{
							if (el._4_vid1 < 11 || el._4_vid1 > 31)
							{
								cout << RP.id << "/неверный вид повреждения 12-м макете (при типе энтомовредители 11-31)" << endl;
							}
							if (el._6_vid2 != 0 && (el._6_vid2 < 11 || el._6_vid2 > 31))
							{
								cout << RP.id << "/неверный вид повреждения 12-м макете (при типе энтомовредители 11-31)" << endl;
							}
						}
						else if (el._1_tip == 15)
						{
							if (el._4_vid1 < 35 || el._4_vid1 > 36)
							{
								cout << RP.id << "/неверный вид повреждения 12-м макете (при типе радионуклииды 35-36)" << endl;
							}
							if (el._6_vid2 != 0 && (el._6_vid2 < 35 || el._6_vid2 > 36))
							{
								cout << RP.id << "/неверный вид повреждения 12-м макете (при типе радионуклииды 35-36)" << endl;
							}
						}
						else
						{
							if (el._4_vid1 != 0 || el._6_vid2 != 0)
							{
								cout << RP.id << "/вид повреждения при данном типе не указывается в 12-макете" << endl;
							}
						}

						if (el._5_stepen1 < 1 || el._5_stepen1 > 9)
						{
							cout << RP.id << "/неверная степень повреждения 12-м макете 5-поз. (1-9)" << endl;
						}
						if (el._6_vid2 != 0)
						{
							if (el._7_stepen2 < 1 || el._7_stepen2 > 9)
							{
								cout << RP.id << "/неверная степень повреждения 12-м макете 7-поз. (1-9)" << endl;
							}
						}
						kluch = false;
						if (el._1_tip == 11 || el._1_tip == 12)
						{
							for (Maket_10 el_10 : M_10)
							{
								if (el_10._3_porod == el._3_por)	kluch = true;
							}
							if (kluch == false)
							{
								cout << RP.id << "/поврежденной породы в 12-м макете нет в составе" << endl;
							}
						}
						else if (el._3_por != "")
						{
							cout << RP.id << "/поврежденная порода в 12-м макете не указывается" << endl;
						}
					}

				}
			}
			else
				cout << RP.id << "/в данной КЗ 12-й макет не заполняется" << endl;
		}
	}
	void Proverka_13()
	{
		if (!M_13.empty())
		{
			if (M_1._3_katZem >= 3 && M_1._3_katZem <= 101)
			{
				cout << RP.id << "/13-й макет не заполняется" << endl;
			}
			else if (M_1._3_katZem == 102 || M_1._3_katZem == 103 || M_1._3_katZem == 106 || M_1._3_katZem == 107)
			{
				for (auto el : M_13)
				{
					if (el._1_shir == "")		cout << RP.id << "/не заполнена ширина в 13-м макете" << endl;
					if (el._2_dlin == "")		cout << RP.id << "/не заполнена длина в 13-м макете" << endl;
					if (el._3_sost != 0)		cout << RP.id << "/состояние не заполняется в 13-м макете" << endl;
					if (el._4_nazn != 0)		cout << RP.id << "/назначение не заполняется в 13-м макете" << endl;
					if (el._5_tipPok != 0)		cout << RP.id << "/тип покрытия не заполняется в 13-м макете" << endl;
					if (el._6_shirPrCh != "")	cout << RP.id << "/ширина проезжей части не заполняется в 13-м макете" << endl;
					if (el._7_sezD != 0)		cout << RP.id << "/сезонность действия не заполняется в 13-м макете" << endl;
					if (el._8_dlinHM != "")		cout << RP.id << "/длина хоз. мер. не заполняется в 13-м макете" << endl;
				}
			}
			else if (M_1._3_katZem >= 121 && M_1._3_katZem <= 122)
			{
				for (auto el : M_13)
				{
					if (el._1_shir == "")		cout << RP.id << "/не заполнена ширина в 13-м макете" << endl;
					if (el._2_dlin == "")		cout << RP.id << "/не заполнена длина в 13-м макете" << endl;
					if (el._3_sost != 0)		cout << RP.id << "/состояние не заполняется в 13-м макете" << endl;
					if (el._4_nazn != 0)		cout << RP.id << "/назначение не заполняется в 13-м макете" << endl;
					if (el._5_tipPok != 0)		cout << RP.id << "/тип покрытия не заполняется в 13-м макете" << endl;
					if (el._6_shirPrCh != "")	cout << RP.id << "/ширина проезжей части не заполняется в 13-м макете" << endl;
					if (el._7_sezD != 0)		cout << RP.id << "/сезонность действия не заполняется в 13-м макете" << endl;
					if (el._8_dlinHM != "")		cout << RP.id << "/длина хоз. мер. не заполняется в 13-м макете" << endl;
				}
			}
			else if (M_1._3_katZem == 123)
			{
				for (auto el : M_13)
				{
					if (el._1_shir == "")		cout << RP.id << "/не заполнена ширина в 13-м макете" << endl;
					if (el._2_dlin == "")		cout << RP.id << "/не заполнена длина в 13-м макете" << endl;
					if (el._3_sost != 68)		cout << RP.id << "/состояние дороги в 13-м макете - 68" << endl;
					if (el._4_nazn < 0 && el._4_nazn > 5)		cout << RP.id << "/неверное назначение дороги в 13-м макете" << endl;
					if (el._5_tipPok < 1 && el._5_tipPok > 6)	cout << RP.id << "/неверный тип покрытия дороги в 13-м макете" << endl;
					//if (el._6_shirPrCh != "");
					if (el._7_sezD < 0 || el._7_sezD > 5)		cout << RP.id << "/неверная сезонность действия дороги в 13-м макете" << endl;
					if (el._8_dlinHM != "")		cout << RP.id << "/длина хоз. мер. не заполняется в 13-м макете" << endl;
				}
			}
			else if (M_1._3_katZem == 125)
			{
				for (auto el : M_13)
				{
					if (el._1_shir == "")		cout << RP.id << "/не заполнена ширина в 13-м макете" << endl;
					if (el._2_dlin == "")		cout << RP.id << "/не заполнена длина в 13-м макете" << endl;
					if (el._3_sost != 68)		cout << RP.id << "/состояние дороги в 13-м макете - 68" << endl;
					if (el._4_nazn < 0 && el._4_nazn > 5)		cout << RP.id << "/неверное назначение дороги в 13-м макете" << endl;
					if (el._5_tipPok < 7 && el._5_tipPok > 9)	cout << RP.id << "/неверный тип покрытия дороги в 13-м макете" << endl;
					//if (el._6_shirPrCh != "");
					if (el._7_sezD < 0 || el._7_sezD > 5)		cout << RP.id << "/неверная сезонность действия дороги в 13-м макете" << endl;
					if (el._8_dlinHM != "")		cout << RP.id << "/длина хоз. мер. не заполняется в 13-м макете" << endl;
				}
			}
			else if (M_1._3_katZem == 126)
			{
				for (auto el : M_13)
				{
					if (el._1_shir == "")		cout << RP.id << "/не заполнена ширина в 13-м макете" << endl;
					if (el._2_dlin == "")		cout << RP.id << "/не заполнена длина в 13-м макете" << endl;
					if (el._3_sost != 68)		cout << RP.id << "/состояние дороги в 13-м макете - 68" << endl;
					if (el._4_nazn < 0 && el._4_nazn > 5)		cout << RP.id << "/неверное назначение дороги в 13-м макете" << endl;
					if (el._5_tipPok < 7 && el._5_tipPok > 9)	cout << RP.id << "/неверный тип покрытия дороги в 13-м макете" << endl;
					//if (el._6_shirPrCh != "");
					if (el._7_sezD != 4 && el._7_sezD != 0)		cout << RP.id << "/неверная сезонность действия дороги в 13-м макете" << endl;
					if (el._8_dlinHM != "")		cout << RP.id << "/длина хоз. мер. не заполняется в 13-м макете" << endl;
				}
			}
			else if (M_1._3_katZem == 127 || M_1._3_katZem == 128)
			{
				for (auto el : M_13)
				{
					if (el._1_shir == "")		cout << RP.id << "/не заполнена ширина в 13-м макете" << endl;
					if (el._2_dlin == "")		cout << RP.id << "/не заполнена длина в 13-м макете" << endl;
					if (el._3_sost != 0)		cout << RP.id << "/состояние не заполняется в 13-м макете" << endl;
					if (el._4_nazn != 0)		cout << RP.id << "/назначение не заполняется в 13-м макете" << endl;
					if (el._5_tipPok != 0)		cout << RP.id << "/тип покрытия не заполняется в 13-м макете" << endl;
					if (el._6_shirPrCh != "")	cout << RP.id << "/ширина проезжей части не заполняется в 13-м макете" << endl;
					if (el._7_sezD != 0)		cout << RP.id << "/сезонность действия не заполняется в 13-м макете" << endl;
					if (el._8_dlinHM != "")		cout << RP.id << "/длина хоз. мер. не заполняется в 13-м макете" << endl;
				}
			}
			else if (M_1._3_katZem >= 129 && M_1._3_katZem <= 141)
			{
				for (auto el : M_13)
				{
					if (el._1_shir == "")		cout << RP.id << "/не заполнена ширина в 13-м макете" << endl;
					if (el._2_dlin == "")		cout << RP.id << "/не заполнена длина в 13-м макете" << endl;
					if (el._3_sost < 61 || el._3_sost > 67)		cout << RP.id << "/неверное состояние в 13-м макете (61-67)" << endl;
					if (el._4_nazn != 0)		cout << RP.id << "/назнечение не указывается в 13-м макете" << endl;
					if (el._5_tipPok != 0)		cout << RP.id << "/тип покрытия не указывается в 13-м макете" << endl;
					if (el._6_shirPrCh != "")	cout << RP.id << "/ширина проезжей части не указывается в 13-м макете" << endl;
					if (el._7_sezD != 0)		cout << RP.id << "/сезонность действия не указывается в 13-м макете" << endl;
					if (el._3_sost == 63)
					{
						if (el._8_dlinHM != el._2_dlin)	cout << RP.id << "/неправильная длина хоз. мер. в 13-м макете" << endl;
					}
					else if (el._8_dlinHM != "")
						cout << RP.id << "/длина хоз. мер. не указывается в 13-м макете" << endl;
				}
			}
			else if ((M_1._3_katZem >= 248 && M_1._3_katZem <= 254) || M_1._3_katZem == 254)
			{
				for (auto el : M_13)
				{
					if (el._1_shir == "")		cout << RP.id << "/не заполнена ширина в 13-м макете" << endl;
					if (el._2_dlin == "")		cout << RP.id << "/не заполнена длина в 13-м макете" << endl;
					if (el._3_sost != 0 && (el._3_sost < 61 || el._3_sost > 67))		cout << RP.id << "/неверное состояние в 13-м макете (61-67)" << endl;
					if (el._4_nazn != 0)		cout << RP.id << "/назнечение не указывается в 13-м макете" << endl;
					if (el._5_tipPok != 0)		cout << RP.id << "/тип покрытия не указывается в 13-м макете" << endl;
					if (el._6_shirPrCh != "")	cout << RP.id << "/ширина проезжей части не указывается в 13-м макете" << endl;
					if (el._7_sezD != 0)		cout << RP.id << "/сезонность действия не указывается в 13-м макете" << endl;
					if (el._3_sost == 63)
					{
						if (el._8_dlinHM != el._2_dlin)	cout << RP.id << "/неправильная длина хоз. мер. в 13-м макете" << endl;
					}
					else if (el._8_dlinHM != "")
						cout << RP.id << "/длина хоз. мер. не указывается в 13-м макете" << endl;
				}
			}
			else
			{
				cout << RP.id << "/13-й макет не заполняется" << endl;
			}
		}
		else
		{
			if (M_1._3_katZem == 102 || M_1._3_katZem == 103 || M_1._3_katZem == 106 || M_1._3_katZem == 107)	cout << RP.id << "/не заполнен 13-й макет" << endl;
			else if (M_1._3_katZem >= 121 && M_1._3_katZem <= 141)	cout << RP.id << "/не заполнен 13-й макет" << endl;
			else if ((M_1._3_katZem >= 248 && M_1._3_katZem <= 254) || M_1._3_katZem == 254)	cout << RP.id << "/не заполнен 13-й макет" << endl;
		}
	}
	void Proverka_14()
	{

	}
	void Proverka_15()
	{

	}
	void Proverka_16()
	{

	}
	void Proverka_17()
	{
		if (!M_17.empty())
		{
			if (M_1._3_katZem >= 82 && M_1._3_katZem <= 84)
			{
				for (auto el : M_17)
				{
					if (el._1_polz != 0)
					{
						cout << RP.id << "/пользователь в 17-м макете не заполняется" << endl;
					}
					if (el._2_kach < 2 || el._2_kach > 4)
					{
						cout << RP.id << "/качество угодия в 17-м макете 2-4" << endl;
					}
					if (M_1._3_katZem == 82)
					{
						if (el._3_tipS != 0)
						{
							cout << RP.id << "/тип сенокоса в пашнях не заполняется в 17-м макете" << endl;
						}
						if (el._4_sost < 0 || el._4_sost > 6)
						{
							cout << RP.id << "/неверное состояние пашни в 17-м макете (0-6)" << endl;
						}
					}
					else if (M_1._3_katZem == 83)
					{
						if (el._3_tipS < 1 || el._3_tipS > 3)
						{
							cout << RP.id << "/тип сенокоса в 17-м макете 1-3" << endl;
						}
						if (el._4_sost < 1 || el._4_sost > 6)
						{
							cout << RP.id << "/неверное состояние сенокоса в 17-м макете (1-6)" << endl;
						}
						if (el._7_urogai == "")
						{
							cout << RP.id << "/не заполнена урожайность сенокоса в 17-м макете" << endl;
						}
					}
					else if (M_1._3_katZem == 84)
					{
						if (el._3_tipS < 0 || el._3_tipS > 3)
						{
							cout << RP.id << "/тип сенокоса в пастбищах в 17-м макете 0-3" << endl;
						}
						if (el._4_sost < 0 || el._4_sost > 6)
						{
							cout << RP.id << "/неверное состояние пастбища в 17-м макете (0-6)" << endl;
						}
					}
					if (el._5_porZ != "")
					{
						for (string por : { "С", "Б", "ОС", "Е", "ТАЛ", "ОЛС", "ОЛЧ", "П", "Л", "К", "ОЛС", "ОЛЧ", "ЛП", "ИВ", "!"})
							if (el._5_porZ == por)
								break;
							else if (por == "!")
								cout << RP.id << "/некорректная порода 17-м макете - " << el._5_porZ << endl; // ПОРОДА
						if (el._6_procZ < 5 || el._6_procZ > 35)
						{
							cout << RP.id << "/неверный процент зарастания в 17-м макете (5-35)" << endl;
						}
						if (el._4_sost == 1 || el._4_sost == 2)
						{
							cout << RP.id << "/состояние в 17-м макете - 4" << endl;
						}
					}
					else
					{
						if (el._4_sost == 4)
						{
							cout << RP.id << "/неверное состояние в 17-м макете" << endl;
						}
						if (el._6_procZ != 0)
						{
							cout << RP.id << "/не указана порода зарастания в 17-м макете" << endl;
						}
					}

				}
			}
			else
				cout << RP.id << "/в данной КЗ 17-й макет не заполняется" << endl;
		}
		else
			if (M_1._3_katZem >= 82 && M_1._3_katZem <= 84)
				cout << RP.id << "/не заполнен 17-й макет" << endl;


	}
	void Proverka_18()
	{

	}
	void Proverka_19()
	{

	}
	void Proverka_20()
	{

	}
	void Proverka_21()
	{

	}
	void Proverka_22()
	{

	}
	void Proverka_23()
	{

	}
	void Proverka_24()
	{

	}
	void Proverka_25()
	{

	}
	void Proverka_26()
	{

	}
	void Proverka_27()
	{

	}
	void Proverka_28()
	{

	}
	void Proverka_29()
	{

	}
	void Proverka_31() // ПРОВЕРКА ПОДРОСТА
	{
		if (M_31)
		{
			if (M_1._3_katZem >= 82)
			{
				cout << RP.id << "/31-й макет не заполняется в КЗ - " << M_1._3_katZem << endl; //
			}
			else
			{
				if (!M_31->_1_kol.empty() && stof(M_31->_1_kol) > 10.0)	cout << RP.id << "/сомнительное количество подроста - " << M_31->_1_kol << endl; // КОЛИЧЕСТВО
				else if (M_31->_1_kol.empty())	cout << RP.id << "/не указано количество подроста" << endl; // КОЛИЧЕСТВО
				if (!M_31->_2_vis.empty() && stof(M_31->_2_vis) > 7.0)	cout << RP.id << "/сомнительная высота подроста - " << M_31->_2_vis << endl; // ВЫСОТА
				else if (M_31->_2_vis.empty())	cout << RP.id << "/не указана высота подроста" << endl; // ВЫСОТА
				if (M_31->_3_vozr > 50)	cout << RP.id << "/сомнительный возраст подроста - " << M_31->_3_vozr << endl; // ВОЗРАСТ
				if (M_31->_4_koef1 + M_31->_6_koef2 + M_31->_8_koef3 != 10)	cout << RP.id << "/кол. единиц подроста не равно 10" << endl; // КОЛ. ЕД. ПОДРОСТА
				if (M_31->_4_koef1 != 0)
				{
					if (M_31->_5_por1 != "")
					{
						if (M_31->_5_por1 != "Е") if (M_31->_5_por1 != "П") if (M_31->_5_por1 != "К") if (M_31->_5_por1 != "С") if (M_31->_5_por1 != "Б") if (M_31->_5_por1 != "ОС")if (M_31->_5_por1 != "Л") if (M_31->_5_por1 != "ЛП")
							cout << RP.id << "/некорректная порода подроста - " << M_31->_5_por1 << endl; // ПОРОДА
					}
					else
						cout << RP.id << "/не указана порода 1 подроста" << endl;
				}
				else
					cout << RP.id << "/не указано количество 1-й породы подроста" << endl;

				if (M_31->_6_koef2 != 0)
				{
					if (M_31->_6_koef2 > 9)
					{
						cout << RP.id << "/коэф. 2-й породы подроста больше 9" << endl;
					}
					if (M_31->_7_por2 == "К" && M_31->_6_koef2 >= 3)
					{
						cout << RP.id << "/кедр в подросте на первое место" << endl;
					}
					if (M_31->_7_por2 != "")
					{
						if (M_31->_7_por2 != "Е") if (M_31->_7_por2 != "П") if (M_31->_7_por2 != "К") if (M_31->_7_por2 != "С") if (M_31->_7_por2 != "Б") if (M_31->_7_por2 != "ОС")if (M_31->_7_por2 != "Л") if (M_31->_7_por2 != "ЛП")
							cout << RP.id << "/некорректная порода подроста - " << M_31->_7_por2 << endl; // ПОРОДА
					}
					else
						cout << RP.id << "/не указана порода 2 подроста" << endl; // ПОРОДА
				}
				if (M_31->_8_koef3 != 0)
				{
					if (M_31->_8_koef3 > 9)
					{
						cout << RP.id << "/коэф. 3-й породы подроста больше 9" << endl;
					}
					if (M_31->_9_por3 == "К" && M_31->_8_koef3 >= 3)
					{
						cout << RP.id << "/кедр в подросте на первое место" << endl;
					}
					if (M_31->_9_por3 != "")
					{
						if (M_31->_9_por3 != "Е") if (M_31->_9_por3 != "П") if (M_31->_9_por3 != "К") if (M_31->_9_por3 != "С") if (M_31->_9_por3 != "Б") if (M_31->_9_por3 != "ОС")if (M_31->_9_por3 != "Л") if (M_31->_9_por3 != "ЛП")
							cout << RP.id << "/некорректная порода подроста - " << M_31->_9_por3 << endl; // ПОРОДА
					}
					else
						cout << RP.id << "/не указана порода 3 подроста" << endl; // ПОРОДА
				}
				if (M_31->_10_ocenka != 1)	cout << RP.id << "/некорректная оценка подроста - " << M_31->_10_ocenka << endl; // ОЦЕНКА ПОДРОСТА
			}
		}
	}
	void Proverka_32()
	{

	}
	void Proverka_34()
	{

	}
};
void ChtenieFaila(list<Videl>& base)
{
	cout << "База: ";
	cin >> FileNameIn;
	//FileNameIn = "11650250.06";
	FileNameOut = 'N' + FileNameIn;
	ifstream fin(FileNameIn);
	while (!fin.is_open())
	{
		cout << "Файл базы не найден!" << endl;
		cout << "База: ";
		cin >> FileNameIn;
		fin.open(FileNameIn);
	}
	string str;
	fin >> str;
	int i = 0;
	while (fin >> str)
	{
		//i++;
		//cout << i << endl; // ВЫВОД СТРОКИ ФАЙЛА
		//if (i==3610)
		//{
		//	int ccc = 1;
		//}
		Convert(str, CP1251);
		base.push_back(Videl(str));
	}
	fin.close();
}
void ZapisBase_TXT(list<Videl>& base)
{
	ofstream fout(FileNameOut);
	string str;
	Maket_0 predVidel;
	fout << FileNameIn << '?' << endl;
	for (Videl& videl : base)
	{
		if (videl.M_0 != predVidel)
		{
			videl.ZapisMaket_0_TXT(str);
			predVidel = videl.M_0;
		}
		videl.ZapisVidel_TXT(str);
		Convert(str, CP866);
		fout << str << endl;
		str.clear();
	}
	fout.close();
}
//void ZapisBase_SOLI(list<Videl>& base)
//{
//	ofstream fout(FileNameOutS);
//	string str;
//	for (Videl& videl : base)
//	{
//		// Макет 0
//		for (KatZashit el : Spr_KatZash)
//		{
//			if (el.TXT == videl.M_0._1_kz)
//			{
//				str += to_string(el.SOLI);
//				break;
//			}
//		}
//		PokFormat(str, videl.M_0._2_kv, 'F', 4);
//		PokFormat(str, videl.M_0._3_admR, 'F', 3);
//		PokFormat(str, videl.M_0._4_arend, 'F', 4);
//		PokFormat(str, videl.M_0._5_relef, 'F', 1);
//		PokFormat(str, videl.M_0._6_rekrZon, 'F', 1);
//		VstavkaSimv(str, 10, '0');	// Пропуск 10
//
//		// Макет 1
//		PokFormat(str, videl.M_1._1_vd, 'F', 3);
//		PokFormat(str, videl.M_1._2_S, 'F', 5);
//		for (KatZemel el : Spr_KatZemel)
//		{
//			if (el.TXT == videl.M_1._3_katZem)
//			{
//				str += to_string(el.SOLI);
//				break;
//			}
//		}
//		PokFormat(str, videl.M_1._4_spRub, 'F', 1);
//		for (OZU el : Spr_OZU)
//		{
//			if (el.TXT == videl.M_1._5_OZU)
//			{
//				str += el.SOLI;
//				break;
//			}
//		}
//		PokFormat(str, videl.M_1._6_sklon, 'A', 2);
//		PokFormat(str, videl.M_1._7_krut, 'F', 2);
//		PokFormat(str, videl.M_1._8_vidEroz, 'F', 4);
//		PokFormat(str, videl.M_1._9_stepEroz, 'F', 1);
//		VstavkaSimv(str, 1, '0');	// Пропуск 1
//
//		// Макет 2
//		if (videl.M_2)
//		{
//			for (Meropr el : Spr_Meropr)
//			{
//				if (el.TXT == videl.M_2->_1_hoz1)
//				{
//					PokFormat(str, el.SOLI, 'F', 4);
//					break;
//				}
//			}
//			PokFormat(str, videl.M_2->_2_procVib, 'F', 3);
//			PokFormat(str, videl.M_2->_3_rtk1, 'F', 2);
//			for (Meropr el : Spr_Meropr)
//			{
//				if (el.TXT == videl.M_2->_4_hoz2)
//				{
//					PokFormat(str, el.SOLI, 'F', 4);
//					break;
//				}
//			}
//			PokFormat(str, videl.M_2->_5_rtk2, 'F', 2);
//			for (Meropr el : Spr_Meropr)
//			{
//				if (el.TXT == videl.M_2->_6_hoz3)
//				{
//					PokFormat(str, el.SOLI, 'F', 4);
//					break;
//				}
//			}
//			PokFormat(str, videl.M_2->_7_rtk3, 'F', 2);
//			for (Poroda el : Spr_Poroda)
//			{
//				if (el.NAME == videl.M_2->_8_celPor)
//				{
//					str += to_string(el.SOLI);
//					break;
//				}
//			}
//		}
//
//		// Макет 3
//		if (videl.M_3)
//		{
//			for (Poroda el : Spr_Poroda)
//			{
//				if (el.NAME == videl.M_3->_1_glPor)
//				{
//					str += to_string(el.SOLI);
//					break;
//				}
//			}
//			PokFormat(str, videl.M_3->_2_bon, 'A', 2);
//			PokFormat(str, videl.M_3->_3_tipL, 'A', 5);
//			PokFormat(str, videl.M_3->_4_tum, 'A', 5);
//			PokFormat(str, videl.M_3->_5_godRub, 'F', 2);
//			PokFormat(str, videl.M_3->_6_kolPnei, 'F', 4);
//			PokFormat(str, videl.M_3->_7_kolPneiC, 'F', 4);
//			PokFormat(str, videl.M_3->_8_dPnei, 'F', 2);
//			PokFormat(str, videl.M_3->_9_tipVirub, 'A', 2);
//		}
//
//		// Макет 4
//		if (videl.M_4)
//		{
//			PokFormat(str, videl.M_4->_1_zahl, 'F', 3);
//			PokFormat(str, videl.M_4->_2_zahlLikv, 'F', 3);
//			PokFormat(str, videl.M_4->_3_suhost, 'F', 3);
//		}
//		VstavkaSimv(str, 66, '0');	// Пропуск 66
//
//		// Макет 10
//		if (!videl.M_10.empty())
//		{
//			int yarus = 0;
//			for (Maket_10 el : videl.M_10)
//			{
//				str += "10";
//				if (el._1_yarus != 0)
//				{
//					yarus = el._1_yarus;
//				}
//				PokFormat(str, yarus, 'F', 2);
//				PokFormat(str, el._2_kSost, 'F', 2);
//				for (Poroda Por : Spr_Poroda)
//				{
//					if (Por.NAME == el._3_porod)
//					{
//						str += to_string(Por.SOLI);
//						break;
//					}
//				}
//				PokFormat(str, el._4_vozr, 'F', 3);
//				PokFormat(str, el._5_visot, 'F', 2);	str += '0';
//				PokFormat(str, el._6_diam, 'F', 3);
//				PokFormat(str, el._7_klTov, 'F', 1);
//				PokFormat(str, el._8_proish, 'F', 1);
//				if (el._9_poln != "")
//				{
//					PokFormat(str, el._9_poln.erase(el._9_poln.find(','), 1), 'F', 2);
//					str += '0';
//				}
//				else
//				{
//					str += "000";
//				}
//				PokFormat(str, el._10_sumPlSech, 'F', 4);
//				PokFormat(str, el._11_zapas, 'F', 4);
//				VstavkaSimv(str, 6, '0');	// Пропуск 6
//			}
//		}
//
//		// Макет 31
//		if (videl.M_31)
//		{
//			str += "31";
//			PokFormat(str, videl.M_31->_1_kol, 'D', 4);
//			PokFormat(str, videl.M_31->_2_vis, 'D', 3);
//			PokFormat(str, videl.M_31->_3_vozr, 'F', 3);
//			PokFormat(str, videl.M_31->_4_koef1, 'F', 2);
//			for (Poroda Por : Spr_Poroda)
//			{
//				if (Por.NAME == videl.M_31->_5_por1)
//				{
//					str += to_string(Por.SOLI);
//					break;
//				}
//			}
//			PokFormat(str, videl.M_31->_6_koef2, 'F', 2);
//			for (Poroda Por : Spr_Poroda)
//			{
//				if (Por.NAME == videl.M_31->_7_por2)
//				{
//					str += to_string(Por.SOLI);
//					break;
//				}
//			}
//			PokFormat(str, videl.M_31->_8_koef3, 'F', 2);
//			for (Poroda Por : Spr_Poroda)
//			{
//				if (Por.NAME == videl.M_31->_9_por3)
//				{
//					str += to_string(Por.SOLI);
//					break;
//				}
//			}
//			PokFormat(str, videl.M_31->_10_ocenka, 'F', 1);
//			VstavkaSimv(str, 3, '0');	// Пропуск 3
//		}
//
//		// Макет 32
//		if (videl.M_32)
//		{
//			str += "32";
//			PokFormat(str, videl.M_32->_1_gust, 'F', 1);
//			for (Poroda Por : Spr_Poroda)
//			{
//				if (Por.NAME == videl.M_32->_2_por1)
//				{
//					str += to_string(Por.SOLI);
//					break;
//				}
//			}
//			for (Poroda Por : Spr_Poroda)
//			{
//				if (Por.NAME == videl.M_32->_3_por2)
//				{
//					str += to_string(Por.SOLI);
//					break;
//				}
//			}
//			for (Poroda Por : Spr_Poroda)
//			{
//				if (Por.NAME == videl.M_32->_4_por3)
//				{
//					str += to_string(Por.SOLI);
//					break;
//				}
//			}
//			VstavkaSimv(str, 19, '0');	// Пропуск 19
//		}
//
//		// Макет 11
//		if (!videl.M_11.empty())
//		{
//			for (Maket_11 el : videl.M_11)
//			{
//				str += "11";
//				PokFormat(str, el._1_god, 'F', 2);
//				PokFormat(str, el._2_SPP, 'F', 4);
//				PokFormat(str, el._3_SSK, 'F', 1);
//				PokFormat(str, el._4_RMR, 'D', 2);
//				PokFormat(str, el._5_RVR, 'D', 2);
//				PokFormat(str, el._6_kol, 'D', 3);
//				PokFormat(str, el._7_sost, 'F', 1);
//				PokFormat(str, el._8_PG, 'F', 2);
//				VstavkaSimv(str, 21, '0');	// Пропуск 21
//			}
//		}
//
//		// Макет 12
//		if (!videl.M_12.empty())
//		{
//			for (Maket_12 el : videl.M_12)
//			{
//				str += "12";
//				PokFormat(str, el._1_tip, 'F', 2);
//				PokFormat(str, el._2_god, 'F', 2);
//				PokFormat(str, el._3_por, 'P', 6);
//				PokFormat(str, el._4_vid1, 'F', 3);
//				PokFormat(str, el._5_stepen1, 'F', 3);
//				PokFormat(str, el._6_vid2, 'F', 3);
//				PokFormat(str, el._7_stepen2, 'F', 3);
//				VstavkaSimv(str, 16, '0');	// Пропуск 16
//			}
//		}
//
//		// Макет 13
//		if (!videl.M_13.empty())
//		{
//			for (Maket_13 el : videl.M_13)
//			{
//				str += "13";
//				PokFormat(str, el._1_shir, 'D', 4);
//				PokFormat(str, el._2_dlin, 'D', 3);
//				PokFormat(str, el._3_sost, 'F', 3);
//				PokFormat(str, el._4_nazn, 'F', 1);
//				PokFormat(str, el._5_tipPok, 'F', 2);
//				PokFormat(str, el._6_shirPrCh, 'D', 2);
//				PokFormat(str, el._7_sezD, 'F', 1);
//				PokFormat(str, el._8_dlinHM, 'D', 3);
//				VstavkaSimv(str, 19, '0');	// Пропуск 19
//
//			}
//		}
//
//		// Макет 14
//		if (!videl.M_14.empty())
//		{
//			for (Maket_14 el : videl.M_14)
//			{
//				str += "14";
//				PokFormat(str, el._1_katU, 'F', 1);
//				PokFormat(str, el._2_vid1, 'F', 4);
//				PokFormat(str, el._3_procP1, 'F', 3);
//				PokFormat(str, el._4_vid2, 'F', 4);
//				PokFormat(str, el._5_procP2, 'F', 3);
//				PokFormat(str, el._6_vid3, 'F', 4);
//				PokFormat(str, el._7_procP3, 'F', 3);
//				VstavkaSimv(str, 16, '0');	// Пропуск 16
//			}
//		}
//
//		// Макет 17
//		if (!videl.M_17.empty())
//		{
//			for (Maket_17 el : videl.M_17)
//			{
//				str += "17";
//				PokFormat(str, el._1_polz, 'F', 1);
//				PokFormat(str, el._2_kach, 'F', 1);
//				PokFormat(str, el._3_tipS, 'F', 1);
//				PokFormat(str, el._4_sost, 'F', 1);
//				PokFormat(str, el._5_porZ, 'P', 6);
//				PokFormat(str, el._6_procZ, 'F', 3);
//				PokFormat(str, el._7_urogai, 'D', 3);
//			}
//		}
//
//		// Макет 18
//		if (!videl.M_18.empty())
//		{
//			for (Maket_18 el : videl.M_18)
//			{
//				str += "18";
//				PokFormat(str, el._1_godNach, 'F', 2);
//				PokFormat(str, el._2_godZP, 'F', 2);
//				PokFormat(str, el._3_godZF, 'F', 2);
//				PokFormat(str, el._4_sost, 'F', 1);
//				PokFormat(str, el._5_prNeudSost, 'F', 2);
//				PokFormat(str, el._6_nomTS, 'F', 1);
//				PokFormat(str, el._7_narTeh, 'F', 2);
//				PokFormat(str, el._8_stim, 'F', 1);
//			}
//		}
//
//		// Макет 19
//		if (!videl.M_19.empty())
//		{
//			for (Maket_19 el : videl.M_19)
//			{
//				str += "19";
//				PokFormat(str, el._1_tipB, 'F', 2);
//				PokFormat(str, el._2_tipR, 'F', 2);
//				PokFormat(str, el._3_moshT, 'D', 2);
//				PokFormat(str, el._4_porZ, 'P', 6);
//				PokFormat(str, el._5_porcZ, 'F', 3);
//			}
//		}
//
//		// Макет 23
//		if (!videl.M_23.empty())
//		{
//			for (Maket_23 el : videl.M_23)
//			{
//				str += "23";
//				PokFormat(str, el._1_osVd_1, 'F', 3);
//				PokFormat(str, el._2_osVd_2, 'F', 3);
//				PokFormat(str, el._3_osVd_3, 'F', 3);
//				PokFormat(str, el._4_osVd_4, 'F', 3);
//				PokFormat(str, el._5_osVd_5, 'F', 3);
//				PokFormat(str, el._6_osVd_6, 'F', 3);
//				PokFormat(str, el._7_osVd_7, 'F', 3);
//				PokFormat(str, el._8_osVd_8, 'F', 3);
//				PokFormat(str, el._9_osVd_9, 'F', 3);
//				PokFormat(str, el._10_osVd_10, 'F', 3);
//				PokFormat(str, el._11_osVd_11, 'F', 3);
//			}
//		}
//
//		Convert(str, CP866);
//		fout << str << endl;
//		str.clear();
//	}
//	fout.close();
//}
void ProverkaChtenZapis()
{
	ifstream FIshodn(FileNameIn);
	ifstream FNovi(FileNameOut);
	int n = 1;
	int sIshodn = 0, sNovi = 0;
	string strIshodn;
	string strNovi;
	getline(FIshodn, strIshodn);
	getline(FNovi, strNovi);
	cout << endl << "Проверка чтения/записи базы!" << endl;
	cout << "--------------------------------------" << endl;
	while (!FIshodn.eof() || !FNovi.eof())
	{
		getline(FIshodn, strIshodn);
		getline(FNovi, strNovi);
		n++;
		sIshodn = accumulate(strIshodn.begin(), strIshodn.end(), 0);
		sNovi = accumulate(strNovi.begin(), strNovi.end(), 0);
		if (sIshodn != sNovi)
		{
			cout << "Ошибка в строке " << n << endl;
			cout << strIshodn << endl;
			cout << strNovi << endl;
		}
	}
	cout << "--------------------------------------" << endl;
	cout << "Проверка окончена." << endl;
}
void RazdelenieVidelov(list<Videl>& base)
{
	ifstream fin("ProtRazd.txt");
	if (fin.is_open())
	{
		class PRV
		{
		public:
			int id_star;
			int id_nov;
			int KZ_nov;

		};
		list<PRV> prv;
		PRV temp;
		while (!fin.eof())
		{
			fin >> temp.id_star;
			fin >> temp.id_nov;
			fin >> temp.KZ_nov;
			if (temp.id_star != temp.id_nov || temp.KZ_nov != 0)
			{
				prv.push_back(temp);
			}
		}
		for (PRV el : prv)
		{
			auto iter = find_if(base.begin(), base.end(), [&el](const Videl& vd)
				{
					return vd.RP.id == el.id_star;
				});
			if (iter != base.end())
			{
				if (el.id_star != el.id_nov)
				{
					base.insert(iter, *iter);
					iter->RP.id = el.id_nov;
					iter->M_0._2_kv = el.id_nov / 1000;
					iter->M_1._1_vd = el.id_nov % 1000;
				}
				if (el.KZ_nov != 0)
				{
					iter->M_23.push_back(Maket_23());
					if (el.KZ_nov == 110300)
					{
						iter->M_23.back()._1_osVd_1 = 96;
						iter->M_23.back()._2_osVd_2 = 93;
					}
					if (el.KZ_nov == 120800)	iter->M_23.back()._1_osVd_1 = 97;
				}
			}
			else
				cout << "Выдел не найден: " << el.id_star;
		}
	}
	else
		cout << "Не найден файл ProtRazd.txt!";
}
void NaznachMeropr(list<Videl>& base)
{
	char grupZashin{};
	char grupBon{};
	char sostav{};
	int shifUhod{};
	int kolHvoi{};
	int polnota{};
	int vozSpelost{};
	char vibRubExp;
	int raion;
	class GTL
	{
	public:
		string tipLesa;
		int shifrGTL{};
		GTL(string shifG, int tl)
		{
			this->tipLesa = shifG;
			this->shifrGTL = tl;
		}
	};
	list<GTL> Spr_GTL;
	int grupTipLes{};
	class LesnKult
	{
	public:
		string tipLesa;
		char porodaLK{};
	};
	LesnKult oprPorLK;

	cout << "Северо-Уральский таежный район - 1" << endl;
	cout << "Средне-Уральский таежный район - 2" << endl;
	cin >> raion;
	cout << "Назначить в эксплуатационных лесах выборочные рубки? y/n: ";
	cin >> vibRubExp;

	for (Videl& VD : base)
	{
		if (!VD.M_2)	VD.M_2 = new Maket_2;
		VD.M_1._4_spRub = 0;
		VD.M_2->_1_hoz1 = 0;
		VD.M_2->_2_procVib = 0;
		VD.M_2->_3_rtk1 = 0;
		VD.M_2->_4_hoz2 = 0;
		VD.M_2->_5_rtk2 = 0;
		VD.M_2->_6_hoz3 = 0;
		VD.M_2->_7_rtk3 = 0;
		VD.M_2->_8_celPor = "";
		if (VD.RP.id == 1005)
		{
			int c = 1;
		}
		if (VD.M_1._3_katZem >= 3 && VD.M_1._3_katZem <= 17) // ЕСЛИ ПОКРЫТЫЕ ЛЕСОМ
		{
			if (VD.M_1._5_OZU > 0)	goto v_konec; // в ОЗУ не назначаются
			for (auto& el : VD.M_23)
			{
				if (el._1_osVd_1 == 96 || el._1_osVd_1 == 97) // в проектируемых в ВЗ  и защитки вдоль дорог не назначаются
				{
					goto v_konec;
				}
			}

			VD.RaschPokaz();
			if (VD.M_0._1_kz >= 83)	grupZashin = 'Э';
			else					grupZashin = 'З';

			if (VD.RP.GrupVozrasta == 4)
			{
				if (grupZashin == 'Э' && VD.M_10.front()._11_zapas > 50)  // в ЭКСПЛ. ЛЕСАХ С ЗАПАСОМ ВЫШЕ 50 ГА НАЗНАЧИТЬ СПЛОШНЫЕ РУБКИ
				{
					if (VD.M_31)
					{
						int kolPodr = int(stof(VD.M_31->_1_kol) * 10);
						int visPodr = int(stof(VD.M_31->_2_vis) * 10);
						if (visPodr <= 5)	kolPodr = int(round(kolPodr * 0.5));
						else if (visPodr <= 15)	kolPodr = int(round(kolPodr * 0.8));

						if (VD.M_31->_5_por1 == "С" || VD.M_31->_5_por1 == "Л")
						{
							for (GTL& el : Spr_GTL)
							{
								if (el.tipLesa == VD.M_3->_3_tipL)
								{
									grupTipLes = el.shifrGTL;
									break;
								}
							}
							if (grupTipLes == 0)
							{
								cout << "Определите группу типа леса " << VD.M_3->_3_tipL << " " << VD.M_3->_4_tum << ": ";
								cin >> grupTipLes;
								Spr_GTL.push_back(GTL(VD.M_3->_3_tipL, grupTipLes));
							}
							if (grupTipLes == 1)
							{
								if (kolPodr > 25)	VD.M_2->_4_hoz2 = 68;
								else if (kolPodr >= 10)	VD.M_2->_4_hoz2 = 64;
								else					VD.M_2->_4_hoz2 = 50;
							}
							else
							{
								if (kolPodr > 40)	VD.M_2->_4_hoz2 = 68;
								else if (kolPodr >= 20)	VD.M_2->_4_hoz2 = 64;
								else					VD.M_2->_4_hoz2 = 50;
							}
							grupTipLes = 0;
						}
						else if (VD.M_31->_5_por1 == "Е" || VD.M_31->_5_por1 == "П")
						{
							if (kolPodr > 20)	VD.M_2->_4_hoz2 = 68;
							else if (kolPodr >= 10)	VD.M_2->_4_hoz2 = 64;
							else					VD.M_2->_4_hoz2 = 50;
						}
						else if (VD.M_31->_5_por1 == "К")
						{
							if (kolPodr > 10)	VD.M_2->_4_hoz2 = 68;
							else if (kolPodr >= 5)	VD.M_2->_4_hoz2 = 64;
							else					VD.M_2->_4_hoz2 = 50;
						}
						else if (VD.M_31->_5_por1 == "Б")
						{
							for (GTL& el : Spr_GTL)
							{
								if (el.tipLesa == VD.M_3->_3_tipL)
								{
									grupTipLes = el.shifrGTL;
									break;
								}
							}
							if (grupTipLes == 0)
							{
								cout << "Определите группу типа леса " << VD.M_3->_3_tipL << " " << VD.M_3->_4_tum << ": ";
								cin >> grupTipLes;
								Spr_GTL.push_back(GTL(VD.M_3->_3_tipL, grupTipLes));
							}
							if (grupTipLes >= 3)
							{
								if (kolPodr > 40)	VD.M_2->_4_hoz2 = 68;
								else if (kolPodr >= 10)	VD.M_2->_4_hoz2 = 64;
								else					VD.M_2->_4_hoz2 = 50;
							}
							else
							{
								if (kolPodr > 60)	VD.M_2->_4_hoz2 = 68;
								else if (kolPodr >= 20)	VD.M_2->_4_hoz2 = 64;
								else					VD.M_2->_4_hoz2 = 50;
							}
							grupTipLes = 0;
						}
					}
					else VD.M_2->_4_hoz2 = 50;

					if (VD.M_2->_4_hoz2 == 68)
					{
						VD.M_2->_1_hoz1 = 2;
						VD.M_2->_8_celPor = VD.M_31->_5_por1;
						if (vibRubExp == 'y')
						{
							if (VD.M_3->_1_glPor == "Б" || VD.M_3->_1_glPor == "ОС" || VD.M_3->_1_glPor == "ЛП" || VD.M_3->_1_glPor == "ОЛС" || VD.M_3->_1_glPor == "ОЛЧ")
							{
								polnota = int(stof(VD.M_10.front()._9_poln) * 10);
								if (polnota > 5)
								{
									if (VD.M_1._2_S >= 30)
									{
										if (VD.M_3->_2_bon == "3" || VD.M_3->_2_bon == "2" || VD.M_3->_2_bon == "1" || VD.M_3->_2_bon == "1А" || VD.M_3->_2_bon == "1Б")
										{
											VD.M_2->_4_hoz2 = 0;
											VD.M_2->_8_celPor = "";
											VD.M_1._4_spRub = 5;
											VD.M_2->_1_hoz1 = 5;
											if (polnota == 6)	VD.M_2->_2_procVib = 15;
											else if (polnota == 7)	VD.M_2->_2_procVib = 20;
											else if (polnota == 8)	VD.M_2->_2_procVib = 25;
											else					VD.M_2->_2_procVib = 30;
										}
									}
								}
							}
						}
					}
					else if (VD.M_2->_4_hoz2 == 64)
					{
						VD.M_2->_1_hoz1 = 1;
						VD.M_2->_8_celPor = VD.M_31->_5_por1;
					}
					else if (VD.M_2->_4_hoz2 == 50)
					{
						VD.M_2->_1_hoz1 = 1;
						if (VD.M_3->_3_tipL[0] == 'С' || VD.M_3->_3_tipL[0] == 'Л')										VD.M_2->_8_celPor = "С";
						else if (VD.M_3->_3_tipL[0] == 'Е' || VD.M_3->_3_tipL[0] == 'К' || VD.M_3->_3_tipL[0] == 'П')	VD.M_2->_8_celPor = "Е";
						else if (VD.M_3->_3_tipL == oprPorLK.tipLesa)
						{
							VD.M_2->_8_celPor = oprPorLK.porodaLK;
						}
						else
						{
							oprPorLK.tipLesa = VD.M_3->_3_tipL;
							cout << "Определите породу для лесных культур (С или Е) " << VD.M_3->_3_tipL << " " << VD.M_3->_4_tum << ": ";
							cin >> oprPorLK.porodaLK;
							while (!(oprPorLK.porodaLK == 'С' || oprPorLK.porodaLK == 'Е'))
							{
								cout << "Некорретный символ (С или Е): ";
								cin >> oprPorLK.porodaLK;
							}
							VD.M_2->_8_celPor = oprPorLK.porodaLK;
						}
						if (VD.M_2->_8_celPor == "С")	VD.M_2->_5_rtk2 = 2;
						else							VD.M_2->_5_rtk2 = 6;
					}
				}
				else if (grupZashin == 'З')
				{
					polnota = int(stof(VD.M_10.front()._9_poln) * 10);
					if (((VD.M_3->_1_glPor == "Е" || VD.M_3->_1_glPor == "П") && polnota > 6) || (VD.M_3->_1_glPor != "Е" && VD.M_3->_1_glPor != "П" && polnota > 5))
					{
						if (VD.M_3->_2_bon == "3" || VD.M_3->_2_bon == "2" || VD.M_3->_2_bon == "1" || VD.M_3->_2_bon == "1А" || VD.M_3->_2_bon == "1Б")
						{
							VD.M_1._4_spRub = 5;
							VD.M_2->_1_hoz1 = 5;
							if (polnota == 6)	VD.M_2->_2_procVib = 10;
							else if (polnota == 7)	VD.M_2->_2_procVib = 20;
							else if (polnota == 8)	VD.M_2->_2_procVib = 25;
							else					VD.M_2->_2_procVib = 30;
						}
					}
				}
			}
			else if (VD.RP.GrupVozrasta <= 2)
			{
				polnota = int(stof(VD.M_10.front()._9_poln) * 10);
				if (polnota > 7)
				{
					grupBon = '0';
					sostav = '0';
					kolHvoi = 0;
					shifUhod = 0;
					vozSpelost = 0;
					for (Maket_10& el : VD.M_10)
					{
						if (el._1_yarus > 1)		break;
						if (el._3_porod == "С" ||
							el._3_porod == "Е" ||
							el._3_porod == "П" ||
							el._3_porod == "К" ||
							el._3_porod == "Л")		kolHvoi += el._2_kSost;
					}
					if (VD.M_3->_1_glPor == "С")
					{
						if (VD.M_3->_2_bon == "2" || VD.M_3->_2_bon == "1")	grupBon = 'В';
						else if (VD.M_3->_2_bon == "3" || VD.M_3->_2_bon == "4")	grupBon = 'Н';
						if (raion == 1)
						{
							if (kolHvoi >= 6)	sostav = 'Ч';
							else				sostav = 'С';
						}
						else if (raion == 2)
						{
							if (kolHvoi >= 7)	sostav = 'Ч';
							else				sostav = 'С';
						}
					}
					else if (VD.M_3->_1_glPor == "Е")
					{
						if (VD.M_3->_2_bon == "3" || VD.M_3->_2_bon == "2" || VD.M_3->_2_bon == "1")	grupBon = 'В';
						else if (VD.M_3->_2_bon == "4")													grupBon = 'Н';
						if (raion == 1)
						{
							if (kolHvoi >= 6)	sostav = 'Ч';
							else				sostav = 'С';
						}
						else if (raion == 2)
						{
							if (kolHvoi >= 7)	sostav = 'Ч';
							else				sostav = 'С';
						}
					}
					else if (VD.M_3->_1_glPor == "Б")
					{
						if (VD.M_3->_2_bon == "3" || VD.M_3->_2_bon == "2" || VD.M_3->_2_bon == "1")	grupBon = 'В';
						if (kolHvoi == 0)	sostav = 'Ч';
					}
					else if (VD.M_3->_1_glPor == "ОС")
					{
						if (VD.M_3->_2_bon == "2" || VD.M_3->_2_bon == "1")	grupBon = 'В';
						if (kolHvoi == 0)	sostav = 'Ч';
					}

					if (VD.M_10.front()._4_vozr < 11)		shifUhod = 20;
					else if (VD.M_10.front()._4_vozr < 21)	shifUhod = 25;
					else
					{
						if (VD.M_0._1_kz == 4)	grupZashin = 'Э';
						for (VozrSpel& el : Spr_VozSpel)
						{
							if (el.poroda == VD.M_3->_1_glPor)
							{
								if (el.grupBonit == grupBon)
								{
									if (el.grupZashitn == grupZashin)
									{
										vozSpelost = el.vozrastSpel;
										break;
									}
								}
							}
						}
						if (vozSpelost > 100)
						{
							if (VD.M_10.front()._4_vozr < 61)	shifUhod = 32;
							else								shifUhod = 37;
						}
						else if (vozSpelost > 60)
						{
							if (VD.M_10.front()._4_vozr < 41)	shifUhod = 32;
							else								shifUhod = 37;
						}
						else if (vozSpelost > 40)
						{
							if (VD.M_10.front()._4_vozr < 31)	shifUhod = 32;
							else								shifUhod = 37;
						}
					}

					if (VD.M_3->_1_glPor == "Е" && (shifUhod == 32 || shifUhod == 37)) /* В НАСАЖДЕНИЯХ С УЧАСТИЕМ ЕЛИ И ПИХТЫ 8
																						И БОЛЕЕ ЕДИНИЦ ПРХ И ПРЖ НЕ ПРОВОДЯТСЯ*/
					{
						kolHvoi = 0;
						for (Maket_10& el : VD.M_10)
						{
							if (el._1_yarus > 1)		break;
							if (el._3_porod == "Е" ||
								el._3_porod == "П")		kolHvoi += el._2_kSost;
						}
						if (kolHvoi >= 8)
							shifUhod = 0;
					}
					for (RubkiUhoda& el : Spr_RubkiUhoda)
					{
						if (el.raion == raion)
						{
							if (el.poroda == VD.M_3->_1_glPor)
							{
								if (el.sostav == sostav)
								{
									if (el.bonitet == grupBon)
									{
										if (el.shifrUhoda == shifUhod)
										{
											if (el.polnota == polnota)
											{
												VD.M_2->_1_hoz1 = el.shifrUhoda;
												VD.M_2->_2_procVib = el.procentViborki;
												if (VD.M_3->_1_glPor == "Б" || VD.M_3->_1_glPor == "ОС") // Уведомлять об уходах в листве
												{
													cout << "Уход в лиственных id-" << VD.RP.id << endl;
												}
												break;
											}
										}
									}
								}
							}
						}
					}
				}
			}
		}
		else if (VD.M_1._3_katZem >= 53 && VD.M_1._3_katZem <= 62)
		{
			for (Maket_23& el : VD.M_23)
			{
				if (el._1_osVd_1 == 18)
				{
					VD.M_2->_1_hoz1 = 68;
					if (VD.M_31)
					{
						VD.M_2->_8_celPor = VD.M_31->_5_por1;
					}
					else
					{
						if (VD.M_3->_3_tipL[0] == 'С' || VD.M_3->_3_tipL[0] == 'Л')
						{
							VD.M_2->_8_celPor = "С";
						}
						else
						{
							VD.M_2->_8_celPor = "Е";
						}
					}
				}
			}
			if (VD.M_2->_1_hoz1 == 0)
			{
				if (VD.M_31)
				{
					int kolPodr = int(stof(VD.M_31->_1_kol) * 10);
					int visPodr = int(stof(VD.M_31->_2_vis) * 10);
					if (visPodr <= 5)	kolPodr = int(round(kolPodr * 0.5));
					else if (visPodr <= 15)	kolPodr = int(round(kolPodr * 0.8));

					if (VD.M_31->_5_por1 == "С" || VD.M_31->_5_por1 == "Л")
					{
						for (GTL& el : Spr_GTL)
						{
							if (el.tipLesa == VD.M_3->_3_tipL)
							{
								grupTipLes = el.shifrGTL;
								break;
							}
						}
						if (grupTipLes == 0)
						{
							cout << "Определите группу типа леса " << VD.M_3->_3_tipL << " " << VD.M_3->_4_tum << ": ";
							cin >> grupTipLes;
							Spr_GTL.push_back(GTL(VD.M_3->_3_tipL, grupTipLes));
						}
						if (grupTipLes == 1)
						{
							if (kolPodr > 25)	VD.M_2->_1_hoz1 = 68;
							else if (kolPodr >= 10)	VD.M_2->_1_hoz1 = 64;
							else					VD.M_2->_1_hoz1 = 50;
						}
						else
						{
							if (kolPodr > 40)	VD.M_2->_1_hoz1 = 68;
							else if (kolPodr >= 20)	VD.M_2->_1_hoz1 = 64;
							else					VD.M_2->_1_hoz1 = 50;
						}
						grupTipLes = 0;
					}
					else if (VD.M_31->_5_por1 == "Е" || VD.M_31->_5_por1 == "П")
					{
						if (kolPodr > 20)	VD.M_2->_1_hoz1 = 68;
						else if (kolPodr >= 10)	VD.M_2->_1_hoz1 = 64;
						else					VD.M_2->_1_hoz1 = 50;
					}
					else if (VD.M_31->_5_por1 == "К")
					{
						if (kolPodr > 10)	VD.M_2->_1_hoz1 = 68;
						else if (kolPodr >= 5)	VD.M_2->_1_hoz1 = 64;
						else					VD.M_2->_1_hoz1 = 50;
					}
					else if (VD.M_31->_5_por1 == "Б")
					{
						for (GTL& el : Spr_GTL)
						{
							if (el.tipLesa == VD.M_3->_3_tipL)
							{
								grupTipLes = el.shifrGTL;
								break;
							}
						}
						if (grupTipLes == 0)
						{
							cout << "Определите группу типа леса " << VD.M_3->_3_tipL << " " << VD.M_3->_4_tum << ": ";
							cin >> grupTipLes;
							Spr_GTL.push_back(GTL(VD.M_3->_3_tipL, grupTipLes));
						}
						if (grupTipLes >= 3)
						{
							if (kolPodr > 40)	VD.M_2->_1_hoz1 = 68;
							else if (kolPodr >= 10)	VD.M_2->_1_hoz1 = 64;
							else					VD.M_2->_1_hoz1 = 50;
						}
						else
						{
							if (kolPodr > 60)	VD.M_2->_1_hoz1 = 68;
							else if (kolPodr >= 20)	VD.M_2->_1_hoz1 = 64;
							else					VD.M_2->_1_hoz1 = 50;
						}
						grupTipLes = 0;
					}
				}
				else VD.M_2->_1_hoz1 = 50;
				if (VD.M_2->_1_hoz1 == 68)	VD.M_2->_8_celPor = VD.M_31->_5_por1;
				else if (VD.M_2->_1_hoz1 == 64)	VD.M_2->_8_celPor = VD.M_31->_5_por1;
				else if (VD.M_2->_1_hoz1 == 50)
				{
					if (VD.M_3->_3_tipL[0] == 'С' || VD.M_3->_3_tipL[0] == 'Л')										VD.M_2->_8_celPor = "С";
					else if (VD.M_3->_3_tipL[0] == 'Е' || VD.M_3->_3_tipL[0] == 'К' || VD.M_3->_3_tipL[0] == 'П')	VD.M_2->_8_celPor = "Е";
					else if (VD.M_3->_3_tipL == oprPorLK.tipLesa)
					{
						VD.M_2->_8_celPor = oprPorLK.porodaLK;
					}
					else
					{
						oprPorLK.tipLesa = VD.M_3->_3_tipL;
						cout << "Определите породу для лесных культур (С или Е) " << VD.M_3->_3_tipL << " " << VD.M_3->_4_tum << ": ";
						cin >> oprPorLK.porodaLK;
						while (!(oprPorLK.porodaLK == 'С' || oprPorLK.porodaLK == 'Е'))
						{
							cout << "Некорретный символ (С или Е): ";
							cin >> oprPorLK.porodaLK;
						}
						VD.M_2->_8_celPor = oprPorLK.porodaLK;
					}
					if (VD.M_2->_8_celPor == "С")	VD.M_2->_3_rtk1 = 2;
					else							VD.M_2->_3_rtk1 = 6;
				}
			}
		}
		else if (VD.M_1._3_katZem >= 31 && VD.M_1._3_katZem <= 37)
		{
			VD.M_2->_1_hoz1 = 57;
		}
		else if (!VD.M_13.empty()) // РАСЧИСТКА В ЛИНЕЙНИКАХ
		{
			if (VD.M_1._5_OZU > 0 && VD.M_1._5_OZU < 88)	goto v_konec; // В ОЗУ НЕ НАЗНАЧАТЬ

			//if (!VD.M_23.empty()) // В ПРОЕКТИРУЕМЫХ ВОДООХРАНКАХ НЕ НАЗНАЧАТЬ
			//{
			//	for (Maket_23& el : VD.M_23)
			//	{
			//		if (el._1_osVd_1 == 96 || el._1_osVd_1 == 97)
			//		{
			//			goto v_konec;
			//		}
			//	}
			//}
			for (Maket_13& el : VD.M_13)
			{
				if (el._3_sost == 63)
				{
					VD.M_2->_1_hoz1 = 43;
				}
			}
		}

	v_konec:
		if (VD.M_2->_1_hoz1 == 0)
		{
			delete VD.M_2;
			VD.M_2 = NULL;
		}
	}
}
void TaksacOpisanie(list<Videl>& base)
{
	string nameUch;
	cout << "Участок: ";
	cin >> nameUch;
	ofstream fout("ТО (" + nameUch + " уч).txt");
	fout << "Участок\t"
		<< "Квартал\t"
		<< "Выдел\t"
		<< "Категория защитности\t"
		<< "ОЗУ\t"
		<< "Категория земель\t"
		<< "Площадь\t"
		<< "Главная порода\t"
		<< "Год рубки\t"
		<< "Тип леса\t"
		<< "Бонитет\t"
		<< "Состав, возраст, высота, полнота, запас на га.\t"
		<< "Состав подроста, возраст, высота, количество\t"
		<< "Хозмероптиятие 1\t"
		<< "Процент выборки\t"
		<< "Хозмероприятие 2\t"
		<< "Ширина\t"
		<< "Длина\n";

	KatZashit tempKZ;
	OZU tempOZU;
	KatZemel tempK_Zem;
	Meropr tempMer;
	int summPor{};

	for (Videl& el : base)
	{
		fout << nameUch << '\t'
			<< el.M_0._2_kv << '\t'
			<< el.M_1._1_vd << '\t';
		for (auto& KZ : Spr_KatZash)
		{
			if (KZ.TXT == el.M_0._1_kz)
			{
				fout << KZ.NAME << '\t';
				break;
			}
		}
		for (auto& ozu : Spr_OZU)
		{
			if (ozu.TXT == el.M_1._5_OZU)
			{
				fout << ozu.NAME;
				break;
			}
		}
		fout << '\t';
		for (auto& katZem : Spr_KatZemel)
		{
			if (katZem.TXT == el.M_1._3_katZem)
			{
				fout << katZem.NAME << '\t';
				break;
			}
		}
		fout << (double)el.M_1._2_S / 10 << '\t';
		if (el.M_3)
		{
			fout << el.M_3->_1_glPor << '\t'
				<< el.M_3->_5_godRub << '\t'
				<< el.M_3->_3_tipL << '\t'
				<< el.M_3->_2_bon << '\t';
		}
		else
		{
			fout << "" << '\t'
				<< "" << '\t'
				<< "" << '\t'
				<< "" << '\t';
		}
		if (!el.M_10.empty())
		{
			summPor = 0;
			for (auto& Maket : el.M_10)
			{
				summPor += Maket._2_kSost;
				if (summPor <= 10)
				{
					if (Maket._2_kSost)
					{
						fout << Maket._2_kSost;
					}
					else
					{
						fout << '+';
					}
					fout << Maket._3_porod;
				}
				else
					break;
			}
			fout << " ("
				<< el.M_10.front()._4_vozr
				<< ") ";
			if (el.M_1._3_katZem != 31)
			{
				fout << el.M_10.front()._5_visot
					<< " / "
					<< el.M_10.front()._6_diam
					<< "-"
					<< el.M_10.front()._9_poln
					<< "-"
					<< el.M_10.front()._11_zapas;
			}
		}
		fout << '\t';
		if (el.M_31)
		{
			fout << el.M_31->_4_koef1;
			fout << el.M_31->_5_por1;
			if (el.M_31->_6_koef2)
			{
				fout << el.M_31->_6_koef2;
				fout << el.M_31->_7_por2;
			}
			if (el.M_31->_8_koef3)
			{
				fout << el.M_31->_8_koef3;
				fout << el.M_31->_9_por3;
			}
			fout << " ("
				<< el.M_31->_3_vozr
				<< ") "
				<< el.M_31->_2_vis
				<< " / "
				<< el.M_31->_1_kol;
		}
		fout << '\t';
		if (el.M_2)
		{
			for (auto& Meropr : Spr_Meropr)
			{
				if (Meropr.TXT == el.M_2->_1_hoz1)
				{
					fout << Meropr.NAME;
					break;
				}
			}
			fout << '\t';
			if (el.M_2->_2_procVib)
			{
				fout << el.M_2->_2_procVib;
			}
			fout << '\t';
			for (auto& Meropr : Spr_Meropr)
			{
				if (Meropr.TXT == el.M_2->_4_hoz2)
				{
					fout << Meropr.NAME;
					break;
				}
			}
			fout << '\t';
		}
		else fout << "\t\t\t";

		if (!el.M_13.empty())
		{
			fout << el.M_13.front()._1_shir << '\t'
				<< el.M_13.front()._2_dlin;
		}
		fout << endl;
	}
	fout.close();
}

void Raschet(list<Videl>& base)
{
	ofstream fff("1.txt");
	string Uchastok; // НАЗВАНИЕ УЧАСТКА
	cout << "Участок: ";
	cin.ignore();
	getline(cin, Uchastok);

	string procent;
	int ZashVibSrokPovHvoia{}; // СРОК ПОВТОРЯЕМОСТИ ВЫБОРОЧНЫХ РУБОК В ХВОЙНЫХ, ЗАЩИТНЫХ ЛЕСАХ
	int ZashVibSrokPovListva{}; // СРОК ПОВТОРЯЕМОСТИ ВЫБОРОЧНЫХ РУБОК В ЛИСТВЕННЫХ, ЗАЩИТНЫХ ЛЕСАХ
	int ExpVibSrokPovHvoia{}; // СРОК ПОВТОРЯЕМОСТИ ВЫБОРОЧНЫХ РУБОК В ХВОЙНЫХ, ЭКСПЛ. ЛЕСАХ
	int ExpVibSrokPovListva{}; // СРОК ПОВТОРЯЕМОСТИ ВЫБОРОЧНЫХ РУБОК В ЛИСТВЕННЫХ, ЭКСПЛ. ЛЕСАХ

	cout << endl << "Введите срок повторяемости выборочных рубок." << endl;
	cout << "Защитные леса." << endl;
	while (true)
	{
		cout << "Хвойное хозяйство: ";
		cin >> procent;
		if (Str_is_int(procent))
		{
			ZashVibSrokPovHvoia = stoi(procent);
			break;
		}
		else
			cout << "Некорректное значение!" << endl;
	}
	while (true)
	{
		cout << "Лиственное хозяйство: ";
		cin >> procent;
		if (Str_is_int(procent))
		{
			ZashVibSrokPovListva = stoi(procent);
			break;
		}
		else
			cout << "Некорректное значение!" << endl;
	}

	cout << endl << "Эксплуатационные леса." << endl;
	while (true)
	{
		cout << "Хвойное хозяйство: ";
		cin >> procent;
		if (Str_is_int(procent))
		{
			ExpVibSrokPovHvoia = stoi(procent);
			break;
		}
		else
			cout << "Некорректное значение!" << endl;
	}
	while (true)
	{
		cout << "Лиственное хозяйство:  ";
		cin >> procent;
		if (Str_is_int(procent))
		{
			ExpVibSrokPovListva = stoi(procent);
			break;
		}
		else
			cout << "Некорректное значение!" << endl;
	}


	// СПЛОШНЫЕ
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	class SploshnieRubki
	{
	public:
		class SrVoz
		{
		public:
			int Vsego{};
			int KlVozr[5]{};
		};
		class OprPrirosta
		{
		public:
			int SumPlosh[20]{};
			int SumPloshNaVozr[20]{};
			double SrednVozrKlassa[20]{};
			int ZapasKlassa[20]{};
			double PrirostKlassa[20]{};
			int ObSredPritost{};
		};

		//РАСПРЕДЕЛЕНИЕ ЛЕСНОГО ФОНДА
		string PorodaBonitet;
		int VozrSpelosti{};
		int ProdKlassVozr{};
		int ProcLikvid{};
		int ProcDel{};

		int PokrLesom{};
		int Molodn{};
		SrVoz SredVoz{};
		int Prispev{};
		int SpelPerest{};
		int Perest{};

		//ЗАПАСЫ
		int ZapasSpPer{};
		int Zapas_ga{};

		OprPrirosta PrirostData{};

		//ИСЧИСЛЕННЫЕ ЛЕСОСЕКИ
		int L_1_vozrostnaia{};
		int L_2_vozrostnaia{};
		int L_ravnomernaia{};
		int L_integralnaia{};

		//ПРИНЯТАЯ ЛЕСОСЕКА
		int PloshPL{};
		int KornevoiPL{};
		int LikvidPL{};
		int DelovoiPL{};

		int ChislLetIsp{};

		int ZapasObsh{};
		double ProcSpel{};
	};
	SploshnieRubki RaschSplRubki[16] // ТАБЛИЦА ПО СПЛОШНЫМ РУБКАМ
	{
		{"Сосна 1-2 бон.", 81, 20, 89, 50},
		{"Сосна 3-5 бон.", 101, 20, 89, 50},
		{"Ель 1-3 бон.", 81, 20, 89, 50},
		{"Ель 4-5 бон.", 101, 20, 89, 50},
		{"Пихта 1-3 бон.", 81, 20, 89, 50},
		{"Пихта 4-5 бон.", 101, 20, 89, 50},
		{"Лиственница", 101, 20, 89, 50},
		{"Береза 1-5 бон.", 61, 10, 88, 50},
		{"Осина", 41, 10, 86, 50},
		{"Липа", 61, 10, 88, 50},
		{"Ольха черная", 61, 10, 88, 50},
		{"Ольха серая", 41, 10, 86, 50},
		{"Липа медоносная", 81, 10, 88, 50},
		{"Всего"},
		{"в т.ч. хвойные"},
		{"в т.ч. лиственные"}
	};
	int id_Porodi{};

	for (Videl VD : base)
	{
		if (VD.M_1._5_OZU == 0 && // НЕ ОЗУ
			VD.M_0._1_kz >= 83 && // ЭКСПЛУАТАЦИОННЫЕ ЛЕСА
			VD.M_1._3_katZem <= 17 && // ПОКРЫТЫЕ ЛЕСОМ
			VD.M_1._4_spRub == 0 && // НЕ НАЗНАЧЕНЫ ВЫБОРОЧНЫЕ РУБКИ
			VD.M_3->_1_glPor != "К" && // КЕДР НЕ БРАТЬ В РАСЧЕТ
			VD.M_3->_2_bon != "5А" && // 5А, 5Б БОНИТЕТЫ
			VD.M_3->_2_bon != "5Б")		// КЛЕМЯТОВСКАЯ ПРОГА НЕ УЧИТЫВАЕТ 5А И 5Б БОНИТЕТЫ НО УЧИТЫВАЕТ ЗАПАСЫ <= 50
		{
			if (VD.M_3->_1_glPor == "С")
			{
				if (VD.RP.GruppaBoniteiov == 'V')
				{
					id_Porodi = 0;
				}
				else								id_Porodi = 1;
			}
			else if (VD.M_3->_1_glPor == "Е")
			{
				if (VD.RP.GruppaBoniteiov == 'V')	id_Porodi = 2;
				else								id_Porodi = 3;
			}
			else if (VD.M_3->_1_glPor == "П")
			{
				if (VD.RP.GruppaBoniteiov == 'V')	id_Porodi = 4;
				else								id_Porodi = 5;
			}
			else if (VD.M_3->_1_glPor == "Л")		id_Porodi = 6;
			else if (VD.M_3->_1_glPor == "Б")		id_Porodi = 7;
			else if (VD.M_3->_1_glPor == "ОС")		id_Porodi = 8;
			else if (VD.M_3->_1_glPor == "ЛП")		id_Porodi = 9;
			else if (VD.M_3->_1_glPor == "ОЛЧ")		id_Porodi = 10;
			else if (VD.M_3->_1_glPor == "ОЛС")		id_Porodi = 11;
			else if (VD.M_3->_1_glPor == "ЛПН")		id_Porodi = 12;
			else cout << "Неизвестная порода id: " << VD.RP.id << endl;
			//if (VD.RP.id == 19013)
			//{
			//	int bbb = 1;
			//}
			switch (VD.RP.GrupVozrasta) // РАСПРЕДЕЛЕНИЕ ПЛОЩАДЕЙ ПО ГРУППАМ ВОЗРАСТА
			{
			case 1:
				RaschSplRubki[id_Porodi].Molodn += VD.M_1._2_S;
				break;
			case 2:
				switch (id_Porodi)
				{
				case 0: // Сосна 1-2 бон.
					RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					break;
				case 1: // Сосна 3-5 бон.
					if (VD.M_10.front()._4_vozr > 60)	RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					else								RaschSplRubki[id_Porodi].SredVoz.KlVozr[1] += VD.M_1._2_S;
					break;
				case 2: // Ель 1-3 бон.
					RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					break;
				case 3: // Ель 4-5 бон.
					if (VD.M_10.front()._4_vozr > 60)	RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					else								RaschSplRubki[id_Porodi].SredVoz.KlVozr[1] += VD.M_1._2_S;
					break;
				case 4: // Пихта 1-3 бон.
					RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					break;
				case 5: // Пихта 4-5 бон.
					if (VD.M_10.front()._4_vozr > 60)	RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					else								RaschSplRubki[id_Porodi].SredVoz.KlVozr[1] += VD.M_1._2_S;
					break;
				case 6: // Лиственница
					if (VD.M_10.front()._4_vozr > 60)	RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					else								RaschSplRubki[id_Porodi].SredVoz.KlVozr[1] += VD.M_1._2_S;
					break;
				case 7: // Береза 1-5 бон.
					if (VD.M_10.front()._4_vozr > 40)		RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					else if (VD.M_10.front()._4_vozr > 30)	RaschSplRubki[id_Porodi].SredVoz.KlVozr[1] += VD.M_1._2_S;
					else									RaschSplRubki[id_Porodi].SredVoz.KlVozr[2] += VD.M_1._2_S;
					break;
				case 8: // Осина
					RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					break;
				case 9: // Липа
					if (VD.M_10.front()._4_vozr > 40)		RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					else if (VD.M_10.front()._4_vozr > 30)	RaschSplRubki[id_Porodi].SredVoz.KlVozr[1] += VD.M_1._2_S;
					else									RaschSplRubki[id_Porodi].SredVoz.KlVozr[2] += VD.M_1._2_S;
					break;
				case 10: // Ольха черная
					if (VD.M_10.front()._4_vozr > 40)		RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					else if (VD.M_10.front()._4_vozr > 30)	RaschSplRubki[id_Porodi].SredVoz.KlVozr[1] += VD.M_1._2_S;
					else									RaschSplRubki[id_Porodi].SredVoz.KlVozr[2] += VD.M_1._2_S;
					break;
				case 11: // Ольха серая
					RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					break;
				case 12: // Липа медоносная
					if (VD.M_10.front()._4_vozr > 60)		RaschSplRubki[id_Porodi].SredVoz.KlVozr[0] += VD.M_1._2_S;
					else if (VD.M_10.front()._4_vozr > 50)	RaschSplRubki[id_Porodi].SredVoz.KlVozr[1] += VD.M_1._2_S;
					else if (VD.M_10.front()._4_vozr > 40)	RaschSplRubki[id_Porodi].SredVoz.KlVozr[2] += VD.M_1._2_S;
					else if (VD.M_10.front()._4_vozr > 30)	RaschSplRubki[id_Porodi].SredVoz.KlVozr[3] += VD.M_1._2_S;
					else									RaschSplRubki[id_Porodi].SredVoz.KlVozr[4] += VD.M_1._2_S;
					break;
				default:
					break;
				}
				RaschSplRubki[id_Porodi].SredVoz.Vsego += VD.M_1._2_S;
				if (id_Porodi == 0)
				{
					fff << VD.RP.id << " " << VD.M_1._2_S << " " << RaschSplRubki[id_Porodi].SredVoz.Vsego << endl;
				}

				break;
			case 3:
				RaschSplRubki[id_Porodi].Prispev += VD.M_1._2_S;
				break;
			case 4:
				RaschSplRubki[id_Porodi].SpelPerest += VD.M_1._2_S;
				RaschSplRubki[id_Porodi].ZapasSpPer += (VD.M_10.front()._11_zapas * VD.M_1._2_S);
				for (Maket_10 el : VD.M_10)	// ИСКЛЮЧЕНИЕ ЗАПАСА КЕДРА
				{
					if (el._3_porod == "К" && el._2_kSost > 0)
					{
						RaschSplRubki[id_Porodi].ZapasSpPer -= int((VD.M_10.front()._11_zapas * VD.M_1._2_S) * (el._2_kSost / 10.0));
					}
				}
				if (VD.M_10.front()._4_vozr >= (VD.RP.VozrastSpelosti + VD.RP.ProdolgKlVoz * 2))	// перестойные через 2 класса после возраста спелости
					RaschSplRubki[id_Porodi].Perest += VD.M_1._2_S;
				break;
			default:
				break;
			}

			//ПОКАЗАТЕЛИ ДЛЯ ОПРЕДЕЛЕНИЯ СРЕДНЕГО ПРИРОСТА
			RaschSplRubki[id_Porodi].PrirostData.SumPlosh[VD.RP.KlassVozrasta] += VD.M_1._2_S;
			RaschSplRubki[id_Porodi].PrirostData.SumPloshNaVozr[VD.RP.KlassVozrasta] += VD.M_1._2_S * VD.M_10.front()._4_vozr;
			RaschSplRubki[id_Porodi].PrirostData.ZapasKlassa[VD.RP.KlassVozrasta] += VD.M_10.front()._11_zapas * VD.M_1._2_S;

			RaschSplRubki[id_Porodi].ZapasObsh += (VD.M_10.front()._11_zapas * VD.M_1._2_S);
		}
	}
	for (int i = 0; i <= 12; i++)
	{
		RaschSplRubki[i].PokrLesom = RaschSplRubki[i].Molodn + RaschSplRubki[i].SredVoz.Vsego + RaschSplRubki[i].Prispev + RaschSplRubki[i].SpelPerest;
		if (RaschSplRubki[i].SpelPerest)
			RaschSplRubki[i].Zapas_ga = (int)round((double)RaschSplRubki[i].ZapasSpPer / RaschSplRubki[i].SpelPerest);
		if (RaschSplRubki[i].PokrLesom)
		{
			for (int n = 2; n < 20; n++) // РАСЧЕТ ПРИРОСТА
			{
				if (RaschSplRubki[i].PrirostData.SumPlosh[n])
				{
					RaschSplRubki[i].PrirostData.SrednVozrKlassa[n] = (double)RaschSplRubki[i].PrirostData.SumPloshNaVozr[n] / RaschSplRubki[i].PrirostData.SumPlosh[n];
					RaschSplRubki[i].PrirostData.PrirostKlassa[n] = RaschSplRubki[i].PrirostData.ZapasKlassa[n] / RaschSplRubki[i].PrirostData.SrednVozrKlassa[n];
					if (n == 2)
					{
						if (i < 7)
						{
							RaschSplRubki[i].PrirostData.ObSredPritost += (int)round(RaschSplRubki[i].PrirostData.PrirostKlassa[2] / RaschSplRubki[i].PrirostData.SumPlosh[2] * 0.4 * RaschSplRubki[i].PrirostData.SumPlosh[1]);
							RaschSplRubki[i].PrirostData.ObSredPritost += (int)round(RaschSplRubki[i].PrirostData.PrirostKlassa[2]);
						}
						else
						{
							RaschSplRubki[i].PrirostData.ObSredPritost += (int)round(RaschSplRubki[i].PrirostData.PrirostKlassa[2] / RaschSplRubki[i].PrirostData.SumPlosh[2] * 0.6 * RaschSplRubki[i].PrirostData.SumPlosh[1]);
							RaschSplRubki[i].PrirostData.ObSredPritost += (int)round(RaschSplRubki[i].PrirostData.PrirostKlassa[2]);
						}
					}
					else
					{
						RaschSplRubki[i].PrirostData.ObSredPritost += (int)round(RaschSplRubki[i].PrirostData.PrirostKlassa[n]);
					}
				}
			}
			RaschSplRubki[i].PrirostData.ObSredPritost = (int)round(RaschSplRubki[i].PrirostData.ObSredPritost / 1000.0) * 100;

			// ОПРЕДЕЛЕНИЕ РАСЧЕТНЫХ ЛЕСОСЕК
			RaschSplRubki[i].L_ravnomernaia = (int)round(RaschSplRubki[i].PokrLesom / 10.0 / RaschSplRubki[i].VozrSpelosti);
			RaschSplRubki[i].L_1_vozrostnaia = (int)round((RaschSplRubki[i].Prispev + RaschSplRubki[i].SpelPerest) / 10.0 / (2 * RaschSplRubki[i].ProdKlassVozr));
			RaschSplRubki[i].L_2_vozrostnaia = (int)round((RaschSplRubki[i].SredVoz.KlVozr[0] + RaschSplRubki[i].Prispev + RaschSplRubki[i].SpelPerest) / 10.0 / (3 * RaschSplRubki[i].ProdKlassVozr));
			if (i == 0)			RaschSplRubki[i].L_integralnaia = (int)round((0.2 * RaschSplRubki[i].Molodn + 0.6 * RaschSplRubki[i].SredVoz.Vsego + 1.4 * RaschSplRubki[i].Prispev + 1.8 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);
			else if (i == 1)	RaschSplRubki[i].L_integralnaia = (int)round((0.2 * RaschSplRubki[i].Molodn + 0.6 * RaschSplRubki[i].SredVoz.KlVozr[1] + RaschSplRubki[i].SredVoz.KlVozr[0] + 1.4 * RaschSplRubki[i].Prispev + 1.8 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);
			else if (i == 2)	RaschSplRubki[i].L_integralnaia = (int)round((0.2 * RaschSplRubki[i].Molodn + 0.6 * RaschSplRubki[i].SredVoz.Vsego + 1.4 * RaschSplRubki[i].Prispev + 1.8 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);
			else if (i == 3)	RaschSplRubki[i].L_integralnaia = (int)round((0.2 * RaschSplRubki[i].Molodn + 0.6 * RaschSplRubki[i].SredVoz.KlVozr[1] + RaschSplRubki[i].SredVoz.KlVozr[0] + 1.4 * RaschSplRubki[i].Prispev + 1.8 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);
			else if (i == 4)	RaschSplRubki[i].L_integralnaia = (int)round((0.2 * RaschSplRubki[i].Molodn + 0.6 * RaschSplRubki[i].SredVoz.Vsego + 1.4 * RaschSplRubki[i].Prispev + 1.8 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);
			else if (i == 5)	RaschSplRubki[i].L_integralnaia = (int)round((0.2 * RaschSplRubki[i].Molodn + 0.6 * RaschSplRubki[i].SredVoz.KlVozr[1] + RaschSplRubki[i].SredVoz.KlVozr[0] + 1.4 * RaschSplRubki[i].Prispev + 1.8 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);
			else if (i == 6)	RaschSplRubki[i].L_integralnaia = (int)round((0.2 * RaschSplRubki[i].Molodn + 0.6 * RaschSplRubki[i].SredVoz.KlVozr[1] + RaschSplRubki[i].SredVoz.KlVozr[0] + 1.4 * RaschSplRubki[i].Prispev + 1.8 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);
			else if (i == 7)	RaschSplRubki[i].L_integralnaia = (int)round((0.4 * RaschSplRubki[i].SredVoz.KlVozr[2] + 1.2 * RaschSplRubki[i].SredVoz.KlVozr[1] + 2.0 * RaschSplRubki[i].SredVoz.KlVozr[0] + 2.8 * RaschSplRubki[i].Prispev + 3.6 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);
			else if (i == 8)	RaschSplRubki[i].L_integralnaia = (int)round((0.4 * RaschSplRubki[i].Molodn + 1.2 * RaschSplRubki[i].SredVoz.Vsego + 2.8 * RaschSplRubki[i].Prispev + 3.6 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);
			else if (i == 9)	RaschSplRubki[i].L_integralnaia = (int)round((0.4 * RaschSplRubki[i].SredVoz.KlVozr[2] + 1.2 * RaschSplRubki[i].SredVoz.KlVozr[1] + 2.0 * RaschSplRubki[i].SredVoz.KlVozr[0] + 2.8 * RaschSplRubki[i].Prispev + 3.6 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);
			else if (i == 10)	RaschSplRubki[i].L_integralnaia = (int)round((0.4 * RaschSplRubki[i].SredVoz.KlVozr[2] + 1.2 * RaschSplRubki[i].SredVoz.KlVozr[1] + 2.0 * RaschSplRubki[i].SredVoz.KlVozr[0] + 2.8 * RaschSplRubki[i].Prispev + 3.6 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);
			else if (i == 11)	RaschSplRubki[i].L_integralnaia = (int)round((0.4 * RaschSplRubki[i].Molodn + 1.2 * RaschSplRubki[i].SredVoz.Vsego + 2.8 * RaschSplRubki[i].Prispev + 3.6 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);
			else if (i == 12)	RaschSplRubki[i].L_integralnaia = (int)round((0.4 * (RaschSplRubki[i].SredVoz.KlVozr[4] + RaschSplRubki[i].SredVoz.KlVozr[3] + RaschSplRubki[i].SredVoz.KlVozr[2]) + 1.2 * RaschSplRubki[i].SredVoz.KlVozr[1] + 2.0 * RaschSplRubki[i].SredVoz.KlVozr[0] + 2.8 * RaschSplRubki[i].Prispev + 3.6 * RaschSplRubki[i].SpelPerest) / 10.0 * 0.01);

			// ВЫБОР ЛЕСОСЕКИ
			if (RaschSplRubki[i].ZapasSpPer > 0)
			{
				RaschSplRubki[i].ProcSpel = (double)RaschSplRubki[i].ZapasSpPer / RaschSplRubki[i].ZapasObsh * 100;
				if (RaschSplRubki[i].ProcSpel < 20)
					RaschSplRubki[i].PloshPL = RaschSplRubki[i].L_1_vozrostnaia; // 1-я возростная
				else if (RaschSplRubki[i].ProcSpel > 50)
					RaschSplRubki[i].PloshPL = RaschSplRubki[i].L_integralnaia; // интегральная
				else
					RaschSplRubki[i].PloshPL = RaschSplRubki[i].PrirostData.ObSredPritost / RaschSplRubki[i].Zapas_ga; // оптимальная

				RaschSplRubki[i].ZapasSpPer = (int)round(RaschSplRubki[i].ZapasSpPer / 1000.0) * 100; // КОРРЕКЦИЯ ЗНАЧЕНИЯ
				if (RaschSplRubki[i].PloshPL)
				{
					RaschSplRubki[i].KornevoiPL = int(round((RaschSplRubki[i].PloshPL * RaschSplRubki[i].Zapas_ga) / 100.0) * 100); // КОРРЕКЦИЯ ЗНАЧЕНИЯ
					RaschSplRubki[i].LikvidPL = int(round(RaschSplRubki[i].KornevoiPL * RaschSplRubki[i].ProcLikvid / 10000.0) * 100); // КОРРЕКЦИЯ ЗНАЧЕНИЯ
					RaschSplRubki[i].DelovoiPL = int(round(RaschSplRubki[i].LikvidPL * RaschSplRubki[i].ProcDel / 10000.0) * 100); // КОРРЕКЦИЯ ЗНАЧЕНИЯ
					RaschSplRubki[i].ChislLetIsp = int(round(RaschSplRubki[i].ZapasSpPer * 1.0 / RaschSplRubki[i].KornevoiPL)); // ОКРУГЛИТЬ ЧИСЛО ЛЕТ ИСПОЛЬЗОВАНИЯ ДО БЛИЛЖАЙШЕГО ЦЕЛОГО
					if (RaschSplRubki[i].ChislLetIsp < 10) // РАСЧИТАТЬ ЛЕСОСЕКУ ОТ ЧИСЛА ЛЕТ ИСПОЛЬЗОВАНИЯ
					{
						cout << endl << "Недостаточное число лет использования " << RaschSplRubki[i].PorodaBonitet << endl;
						cout << "Введите число лет использования из регламента: ";
						cin >> RaschSplRubki[i].ChislLetIsp;
						RaschSplRubki[i].KornevoiPL = RaschSplRubki[i].ZapasSpPer / RaschSplRubki[i].ChislLetIsp;
						RaschSplRubki[i].PloshPL = RaschSplRubki[i].KornevoiPL / RaschSplRubki[i].Zapas_ga;
						RaschSplRubki[i].LikvidPL = int(round(RaschSplRubki[i].KornevoiPL * RaschSplRubki[i].ProcLikvid / 10000.0) * 100); // КОРРЕКЦИЯ ЗНАЧЕНИЯ
						RaschSplRubki[i].DelovoiPL = int(round(RaschSplRubki[i].LikvidPL * RaschSplRubki[i].ProcDel / 10000.0) * 100); // КОРРЕКЦИЯ ЗНАЧЕНИЯ
					}
				}
			}
			// итоги
			{
				if (i < 7) // хвойные
				{
					RaschSplRubki[14].PokrLesom += RaschSplRubki[i].PokrLesom;
					RaschSplRubki[14].Molodn += RaschSplRubki[i].Molodn;
					RaschSplRubki[14].SredVoz.Vsego += RaschSplRubki[i].SredVoz.Vsego;
					RaschSplRubki[14].SredVoz.KlVozr[0] += RaschSplRubki[i].SredVoz.KlVozr[0];
					RaschSplRubki[14].Prispev += RaschSplRubki[i].Prispev;
					RaschSplRubki[14].SpelPerest += RaschSplRubki[i].SpelPerest;
					RaschSplRubki[14].Perest += RaschSplRubki[i].Perest;
					RaschSplRubki[14].ZapasSpPer += RaschSplRubki[i].ZapasSpPer;
					RaschSplRubki[14].PrirostData.ObSredPritost += RaschSplRubki[i].PrirostData.ObSredPritost;
					RaschSplRubki[14].L_ravnomernaia += RaschSplRubki[i].L_ravnomernaia;
					RaschSplRubki[14].L_2_vozrostnaia += RaschSplRubki[i].L_2_vozrostnaia;
					RaschSplRubki[14].L_1_vozrostnaia += RaschSplRubki[i].L_1_vozrostnaia;
					RaschSplRubki[14].L_integralnaia += RaschSplRubki[i].L_integralnaia;
					RaschSplRubki[14].PloshPL += RaschSplRubki[i].PloshPL;
					RaschSplRubki[14].KornevoiPL += RaschSplRubki[i].KornevoiPL;
					RaschSplRubki[14].LikvidPL += RaschSplRubki[i].LikvidPL;
					RaschSplRubki[14].DelovoiPL += RaschSplRubki[i].DelovoiPL;
				}
				else // лиственные
				{
					RaschSplRubki[15].PokrLesom += RaschSplRubki[i].PokrLesom;
					RaschSplRubki[15].Molodn += RaschSplRubki[i].Molodn;
					RaschSplRubki[15].SredVoz.Vsego += RaschSplRubki[i].SredVoz.Vsego;
					RaschSplRubki[15].SredVoz.KlVozr[0] += RaschSplRubki[i].SredVoz.KlVozr[0];
					RaschSplRubki[15].Prispev += RaschSplRubki[i].Prispev;
					RaschSplRubki[15].SpelPerest += RaschSplRubki[i].SpelPerest;
					RaschSplRubki[15].Perest += RaschSplRubki[i].Perest;
					RaschSplRubki[15].ZapasSpPer += RaschSplRubki[i].ZapasSpPer;
					RaschSplRubki[15].PrirostData.ObSredPritost += RaschSplRubki[i].PrirostData.ObSredPritost;
					RaschSplRubki[15].L_ravnomernaia += RaschSplRubki[i].L_ravnomernaia;
					RaschSplRubki[15].L_2_vozrostnaia += RaschSplRubki[i].L_2_vozrostnaia;
					RaschSplRubki[15].L_1_vozrostnaia += RaschSplRubki[i].L_1_vozrostnaia;
					RaschSplRubki[15].L_integralnaia += RaschSplRubki[i].L_integralnaia;
					RaschSplRubki[15].PloshPL += RaschSplRubki[i].PloshPL;
					RaschSplRubki[15].KornevoiPL += RaschSplRubki[i].KornevoiPL;
					RaschSplRubki[15].LikvidPL += RaschSplRubki[i].LikvidPL;
					RaschSplRubki[15].DelovoiPL += RaschSplRubki[i].DelovoiPL;
				}
				// всего
				RaschSplRubki[13].PokrLesom += RaschSplRubki[i].PokrLesom;
				RaschSplRubki[13].Molodn += RaschSplRubki[i].Molodn;
				RaschSplRubki[13].SredVoz.Vsego += RaschSplRubki[i].SredVoz.Vsego;
				RaschSplRubki[13].SredVoz.KlVozr[0] += RaschSplRubki[i].SredVoz.KlVozr[0];
				RaschSplRubki[13].Prispev += RaschSplRubki[i].Prispev;
				RaschSplRubki[13].SpelPerest += RaschSplRubki[i].SpelPerest;
				RaschSplRubki[13].Perest += RaschSplRubki[i].Perest;
				RaschSplRubki[13].ZapasSpPer += RaschSplRubki[i].ZapasSpPer;
				RaschSplRubki[13].PrirostData.ObSredPritost += RaschSplRubki[i].PrirostData.ObSredPritost;
				RaschSplRubki[13].L_ravnomernaia += RaschSplRubki[i].L_ravnomernaia;
				RaschSplRubki[13].L_2_vozrostnaia += RaschSplRubki[i].L_2_vozrostnaia;
				RaschSplRubki[13].L_1_vozrostnaia += RaschSplRubki[i].L_1_vozrostnaia;
				RaschSplRubki[13].L_integralnaia += RaschSplRubki[i].L_integralnaia;
				RaschSplRubki[13].PloshPL += RaschSplRubki[i].PloshPL;
				RaschSplRubki[13].KornevoiPL += RaschSplRubki[i].KornevoiPL;
				RaschSplRubki[13].LikvidPL += RaschSplRubki[i].LikvidPL;
				RaschSplRubki[13].DelovoiPL += RaschSplRubki[i].DelovoiPL;
			}
		}
	}
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


	// ВЫБОРОЧНЫЕ, УХОДЫ
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	double ZashVibHvoia{};
	double ZashVibListva{};
	double ExpVibHvoia{};
	double ExpVibListva{};
	double ZashUhodHvoia{};
	double ZashUhodListva{};
	double ExpUhodHvoia{};
	double ExpUhodListva{};

	for (Videl& VD : base)
	{
		if (VD.M_2)
		{
			if (VD.M_0._1_kz < 83) // ЗАЩИТНЫЕ
			{
				if (VD.M_2->_1_hoz1 == 5 || VD.M_2->_1_hoz1 == 8) // ВЫБОРОЧНЫЕ
				{
					if (VD.M_3->_1_glPor == "С" || VD.M_3->_1_glPor == "Е" || VD.M_3->_1_glPor == "П" || VD.M_3->_1_glPor == "Л" || VD.M_3->_1_glPor == "К")
					{
						ZashVibHvoia += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / ZashVibSrokPovHvoia * 0.89;
					}
					else if (VD.M_3->_1_glPor == "Б" || VD.M_3->_1_glPor == "ОЛЧ" || VD.M_3->_1_glPor == "ЛП" || VD.M_3->_1_glPor == "ЛПН")
					{
						ZashVibListva += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / ZashVibSrokPovListva * 0.88;
					}
					else if (VD.M_3->_1_glPor == "ОС" || VD.M_3->_1_glPor == "ОЛС")
					{
						ZashVibListva += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / ZashVibSrokPovListva * 0.86;
					}
					else
					{
						cout << "Неизвестная порода id:  " << VD.RP.id << endl;
					}
				}
				else if (VD.M_2->_1_hoz1 >= 30 && VD.M_2->_1_hoz1 <= 33) // ПРЖ
				{
					if (VD.M_3->_1_glPor == "С" || VD.M_3->_1_glPor == "Е")
					{
						ZashUhodHvoia += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / 20 * 0.7;
					}
					else if (VD.M_3->_1_glPor == "ОС")
					{
						ZashUhodListva += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / 10 * 0.7;
					}
					else
					{
						cout << "Неизвестная порода id:  " << VD.RP.id << endl;
					}
				}
				else if (VD.M_2->_1_hoz1 >= 35 && VD.M_2->_1_hoz1 <= 37) // ПРХ
				{
					if (VD.M_3->_1_glPor == "С" || VD.M_3->_1_glPor == "Е")
					{
						ZashUhodHvoia += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / 20 * 0.8;
					}
					else if (VD.M_3->_1_glPor == "Б")
					{
						ZashUhodListva += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / 15 * 0.8;
					}
					else
					{
						cout << "Неизвестная порода id:  " << VD.RP.id << endl;
					}
				}
			}
			else // ЭКСПЛУАТАЦИОННЫЕ
			{
				if (VD.M_2->_1_hoz1 == 5 || VD.M_2->_1_hoz1 == 8) // ВЫБОРОЧНЫЕ
				{
					if (VD.M_3->_1_glPor == "С" || VD.M_3->_1_glPor == "Е" || VD.M_3->_1_glPor == "П" || VD.M_3->_1_glPor == "Л" || VD.M_3->_1_glPor == "К")
					{
						ExpVibHvoia += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / ExpVibSrokPovHvoia * 0.89;
					}
					else if (VD.M_3->_1_glPor == "Б" || VD.M_3->_1_glPor == "ОЛЧ" || VD.M_3->_1_glPor == "ЛП" || VD.M_3->_1_glPor == "ЛПН")
					{
						ExpVibListva += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / ExpVibSrokPovListva * 0.88;
					}
					else if (VD.M_3->_1_glPor == "ОС" || VD.M_3->_1_glPor == "ОЛС")
					{
						ExpVibListva += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / ExpVibSrokPovListva * 0.86;
					}
					else
					{
						cout << "Неизвестная порода id:  " << VD.RP.id << endl;
					}
				}
				else if (VD.M_2->_1_hoz1 >= 30 && VD.M_2->_1_hoz1 <= 33) // ПРЖ
				{
					if (VD.M_3->_1_glPor == "С" || VD.M_3->_1_glPor == "Е")
					{
						ExpUhodHvoia += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / 20 * 0.7;
					}
					else if (VD.M_3->_1_glPor == "ОС")
					{
						ExpUhodListva += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / 10 * 0.7;
					}
					else
					{
						cout << "Неизвестная порода id:  " << VD.RP.id << endl;
					}
				}
				else if (VD.M_2->_1_hoz1 >= 35 && VD.M_2->_1_hoz1 <= 37) // ПРХ
				{
					if (VD.M_3->_1_glPor == "С" || VD.M_3->_1_glPor == "Е")
					{
						ExpUhodHvoia += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / 20 * 0.8;
					}
					else if (VD.M_3->_1_glPor == "Б")
					{
						ExpUhodListva += (double)VD.M_1._2_S * VD.M_10.front()._11_zapas * VD.M_2->_2_procVib / 100 / 15 * 0.8;
					}
					else
					{
						cout << "Неизвестная порода id:  " << VD.RP.id << endl;
					}
				}
			}
		}
	}
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	// ВЫВОД В ФАЙЛ
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	ofstream F_SploshnRub("Сплошные рубки (" + Uchastok + ").txt");
	F_SploshnRub.precision(1);
	F_SploshnRub.setf(ios_base::fixed);
	F_SploshnRub << "Порода" << "\t" << "Пок.л." << "\t" << "Мол." << "\t" << "Ср.вс." << "\t" << "Ср.вк." << "\t" << "Присп." << "\t" << "Сп.пер." << "\t" << "Пер." << "\t" << "Зап.сп." << "\t" << "Зап.га." << "\t" << "Прир." << "\t"
		<< "В.сп." << "\t" << "L_р" << "\t" << "L_2в" << "\t" << "L_1в" << "\t" << "L_инт." << "\t\t" << "Пл.г." << "\t" << "З.к.г." << "\t" << "З.л.г" << "\t" << "З.д.г" << "\t" << "%дел." << "\t" << "Ч.лет" << "\t" << "% спелых" << endl;
	for (int i = 0; i <= 15; i++) // вывод таблицы
	{
		if (RaschSplRubki[i].PokrLesom)
		{
			F_SploshnRub << RaschSplRubki[i].PorodaBonitet << "\t"
				<< RaschSplRubki[i].PokrLesom / 10.0 << "\t"
				<< RaschSplRubki[i].Molodn / 10.0 << "\t"
				<< RaschSplRubki[i].SredVoz.Vsego / 10.0 << "\t"
				<< RaschSplRubki[i].SredVoz.KlVozr[0] / 10.0 << "\t"
				<< RaschSplRubki[i].Prispev / 10.0 << "\t"
				<< RaschSplRubki[i].SpelPerest / 10.0 << "\t"
				<< RaschSplRubki[i].Perest / 10.0 << "\t"
				<< RaschSplRubki[i].ZapasSpPer / 1000.0 << "\t"
				<< RaschSplRubki[i].Zapas_ga << "\t"
				<< RaschSplRubki[i].PrirostData.ObSredPritost / 1000.0 << "\t"
				<< RaschSplRubki[i].VozrSpelosti << "\t"
				<< RaschSplRubki[i].L_ravnomernaia << "\t"
				<< RaschSplRubki[i].L_2_vozrostnaia << "\t"
				<< RaschSplRubki[i].L_1_vozrostnaia << "\t"
				<< RaschSplRubki[i].L_integralnaia << "\t\t"
				<< RaschSplRubki[i].PloshPL << "\t"
				<< RaschSplRubki[i].KornevoiPL / 1000.0 << "\t"
				<< RaschSplRubki[i].LikvidPL / 1000.0 << "\t"
				<< RaschSplRubki[i].DelovoiPL / 1000.0 << "\t"
				<< RaschSplRubki[i].ProcDel << "\t"
				<< RaschSplRubki[i].ChislLetIsp << "\t"
				<< RaschSplRubki[i].ProcSpel << endl;
		}
	}

	ofstream F_Obemi("Объемы использования (" + Uchastok + ").txt");
	F_Obemi.precision(0);
	F_Obemi.setf(ios_base::fixed);
	F_Obemi << "1\t2\t3\t4\t5\t6\t7" << endl;
	F_Obemi << Uchastok << endl;
	F_Obemi << "Защитные леса" << endl;
	F_Obemi << "Хвойное\t\t" << ZashVibHvoia / 10 << "\t" << ZashUhodHvoia / 10 << "\t\t\t" << round(ZashVibHvoia / 10) + round(ZashUhodHvoia / 10) << endl;
	F_Obemi << "Мягколиственное\t\t" << ZashVibListva / 10 << "\t" << ZashUhodListva / 10 << "\t\t\t" << round(ZashVibListva / 10) + round(ZashUhodListva / 10) << endl;
	F_Obemi << "Итого защитные\t\t" << round(ZashVibHvoia / 10) + round(ZashVibListva / 10) << "\t" << round(ZashUhodHvoia / 10) + round(ZashUhodListva / 10) << "\t\t\t" << round(ZashVibHvoia / 10) + round(ZashVibListva / 10) + round(ZashUhodHvoia / 10) + round(ZashUhodListva / 10) << endl;

	F_Obemi << "Эксплуатационные леса" << endl;
	F_Obemi << "Хвойное\t" << RaschSplRubki[14].LikvidPL << "\t" << ExpVibHvoia / 10 << "\t" << ExpUhodHvoia / 10 << "\t\t\t" << RaschSplRubki[14].LikvidPL + round(ExpVibHvoia / 10) + round(ExpUhodHvoia / 10) << endl;
	F_Obemi << "Мягколиственное\t" << RaschSplRubki[15].LikvidPL << "\t" << ExpVibListva / 10 << "\t" << ExpUhodListva / 10 << "\t\t\t" << RaschSplRubki[15].LikvidPL + round(ExpVibListva / 10) + round(ExpUhodListva / 10) << endl;
	F_Obemi << "Итого эксплуатационные\t" << RaschSplRubki[13].LikvidPL << "\t" << round(ExpVibHvoia / 10) + round(ExpVibListva / 10) << "\t" << round(ExpUhodHvoia / 10) + round(ExpUhodListva / 10) << "\t\t\t" << RaschSplRubki[13].LikvidPL + round(ExpVibHvoia / 10) + round(ExpVibListva / 10) + round(ExpUhodHvoia / 10) + round(ExpUhodListva / 10) << endl;

	F_Obemi << "Всего по участку\t" << RaschSplRubki[13].LikvidPL << "\t"
		<< round(ZashVibHvoia / 10) + round(ZashVibListva / 10) + round(ExpVibHvoia / 10) + round(ExpVibListva / 10) << "\t"
		<< round(ZashUhodHvoia / 10) + round(ZashUhodListva / 10) + round(ExpUhodHvoia / 10) + round(ExpUhodListva / 10) << "\t\t\t"
		<< RaschSplRubki[13].LikvidPL + round(ZashVibHvoia / 10) + round(ZashVibListva / 10) + round(ExpVibHvoia / 10) + round(ExpVibListva / 10) + round(ZashUhodHvoia / 10) + round(ZashUhodListva / 10) + round(ExpUhodHvoia / 10) + round(ExpUhodListva / 10) << endl;
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
}

void ProverkaBazi(list<Videl>& base)
{
	string god_lesoustr{};
	cout << endl << "Введите год лесоустройства: ";
	cin >> god_lesoustr;

	cout << endl << "Проверка правильности заполнения базы." << endl;
	cout << "--------------------------------------" << endl;
	for (Videl& VD : base) // ПРОЛИСТАТЬ БАЗУ
	{
		VD.Proverka_3(god_lesoustr);
		VD.Proverka_10(god_lesoustr);
		VD.Proverka_11();
		VD.Proverka_12();
		VD.Proverka_13();
		VD.Proverka_17();
		VD.Proverka_31();

		switch (VD.M_1._3_katZem)
		{
		case 3:
		{
			break;
		}
		case 8:
		{
			break;
		}
		case 9:
		{
			break;
		}
		case 10:
		{
			break;
		}
		case 31:
		{
			break;
		}
		case 57:
		{
			break;
		}
		case 59:
		{
			break;
		}
		case 82:
		{
			if (!VD.M_17.empty())
			{
				if (VD.M_17.front()._1_polz != 0)	cout << VD.RP.id << "/пользователь не указывается" << endl;

			}
			else
				cout << VD.RP.id << "/не указан 17-й макет" << endl;
			break;
		}
		case 102:
		{
			
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 103:
		{

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;

			break;
		}
		case 106:
		{
			
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;

			break;
		}
		case 107:
		{
			
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;

			break;
		}
		case 121:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;

			break;
		}
		case 122:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 123:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 125:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 126:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 127:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 128:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 129:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 130:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 131:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 132:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 133:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 140:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 141:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 148:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 149:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 150:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 151:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 152:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 153:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 154:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		case 256:
		{
			if (VD.M_4)				cout << VD.RP.id << "/4-й макет не заполняется" << endl;

			
			if (VD.M_32)			cout << VD.RP.id << "/32-й макет не заполняется" << endl;
			if (!VD.M_11.empty())	cout << VD.RP.id << "/11-й макет не заполняется" << endl;
			if (!VD.M_12.empty())	cout << VD.RP.id << "/12-й макет не заполняется" << endl;
			if (!VD.M_14.empty())	cout << VD.RP.id << "/14-й макет не заполняется" << endl;
			if (!VD.M_15.empty())	cout << VD.RP.id << "/15-й макет не заполняется" << endl;
			if (!VD.M_16.empty())	cout << VD.RP.id << "/16-й макет не заполняется" << endl;
			if (!VD.M_17.empty())	cout << VD.RP.id << "/17-й макет не заполняется" << endl;
			if (!VD.M_18.empty())	cout << VD.RP.id << "/18-й макет не заполняется" << endl;
			if (!VD.M_19.empty())	cout << VD.RP.id << "/19-й макет не заполняется" << endl;
			if (!VD.M_20.empty())	cout << VD.RP.id << "/20-й макет не заполняется" << endl;
			if (!VD.M_22.empty())	cout << VD.RP.id << "/22-й макет не заполняется" << endl;
			if (!VD.M_24.empty())	cout << VD.RP.id << "/24-й макет не заполняется" << endl;
			if (!VD.M_25.empty())	cout << VD.RP.id << "/25-й макет не заполняется" << endl;
			if (!VD.M_26.empty())	cout << VD.RP.id << "/26-й макет не заполняется" << endl;
			if (!VD.M_27.empty())	cout << VD.RP.id << "/27-й макет не заполняется" << endl;
			if (!VD.M_28.empty())	cout << VD.RP.id << "/28-й макет не заполняется" << endl;
			if (!VD.M_29.empty())	cout << VD.RP.id << "/29-й макет не заполняется" << endl;
			if (!VD.M_34.empty())	cout << VD.RP.id << "/34-й макет не заполняется" << endl;
			break;
		}
		default:
			break;
		}
	}
	cout << "--------------------------------------" << endl;
	cout << "Проверка окончена." << endl;
}

void ClTovChange(list<Videl>& base) 
{
	for (Videl& VD : base) // ПРОЛИСТАТЬ БАЗУ
	{
		if (VD.RP.GrupVozrasta >= 3)
		{
			if (VD.M_3->_2_bon == "3" || VD.M_3->_2_bon == "4" || VD.M_3->_2_bon == "5" || VD.M_3->_2_bon == "5А" || VD.M_3->_2_bon == "5Б")
			{
				int i = 1;
			}
			int i = 1;
		}
	}
}

int main()
{
	setlocale(LC_ALL, "Russian");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	list<Videl> base;
	ChtenieFaila(base);
	ZapisBase_TXT(base);
	ProverkaChtenZapis();
	for (Videl& VD : base)
	{
		if (VD.M_1._3_katZem <= 17)
		{
			VD.RaschPokaz(); // РАСЧИТЫВАЕМЫЕ ПОКАЗАТЕЛИ
		}
	}
	//Raschet(base);
	//ProverkaBazi(base);
	//Raschet(base);

	cout << "\n\t\tМеню\n";
	cout << "1 - Разделение выделов." << endl;
	cout << "2 - Назначение мероприятий." << endl;
	cout << "3 - Таксационное описание." << endl;
	cout << "4 - Расчет пользования." << endl;
	cout << "5 - Проверка заполнения базы." << endl;
	cout << "6 - Изменить класс товарности." << endl;
	cout << "0 - Выход" << endl;
	int ch{};
	cin >> ch;
	while (ch)
	{
		switch (ch)
		{
		case 1:	RazdelenieVidelov(base);	break;
		case 2:	NaznachMeropr(base);		break;
		case 3:	TaksacOpisanie(base);		break;
		case 4:	Raschet(base);				break;
		case 5:	ProverkaBazi(base);			break;
		case 6:	ClTovChange(base);			break;
		default:
			break;
		}
		//system("cls");
		cout << endl << "\t\tМеню" << endl << endl;
		cout << "1 - Разделение выделов." << endl;
		cout << "2 - Назначение мероприятий." << endl;
		cout << "3 - Таксационное описание." << endl;
		cout << "4 - Расчет пользования." << endl;
		cout << "5 - Проверка заполнения базы." << endl;
		cout << "6 - Изменить класс товарности." << endl;
		cout << "0 - Выход" << endl;
		cin >> ch;
	}

	ZapisBase_TXT(base);
	return 0;
}

